
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.2.3.&nbsp;Expressions - 3.2.&nbsp;Syntax</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <link rel="prev" href="../naming/index.html" title="3.2.2.&nbsp;Naming rules and recommendations"></link>
      <link rel="next" href="../variables/index.html" title="3.2.4.&nbsp;Variables"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../naming/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Naming rules and recommendations</a></span><span class="nav-current">
               <p class="nav-title hidden">3.2.3.&nbsp;Expressions</p></span><span class="nav-next"><a accesskey="n" href="../variables/index.html">Variables<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="cypher-expressions">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#cypher-expressions"></a>3.2.3.&nbsp;Expressions
                  </h3>
               </div>
            </div>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#cypher-expressions-general" title="3.2.3.1.&nbsp;Expressions in general">Expressions in general</a></li>
               <li class="listitem"><a class="link" href="index.html#cypher-expressions-string-literals" title="3.2.3.2.&nbsp;Note on string literals">Note on string literals</a></li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-syntax-case" title="3.2.3.3.&nbsp;CASE expressions"><code class="literal">CASE</code> expressions</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#syntax-simple-case" title="Simple CASE form: comparing an expression against multiple values">Simple <code class="literal">CASE</code> form: comparing an expression against multiple values</a></li>
                        <li class="listitem"><a class="link" href="index.html#syntax-generic-case" title="Generic CASE form: allowing for multiple conditionals to be expressed">Generic <code class="literal">CASE</code> form: allowing for multiple conditionals to be expressed</a></li>
                        <li class="listitem"><a class="link" href="index.html#syntax-distinguish-case" title="Distinguishing between when to use the simple and generic CASE forms">Distinguishing between when to use the simple and generic <code class="literal">CASE</code> forms</a></li>
                     </ul>
                  </div>
               </li>
            </ul>
         </div>
         <section class="section" id="cypher-expressions-general">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-expressions-general"></a>3.2.3.1.&nbsp;Expressions in general
                     </h4>
                  </div>
               </div>
            </div>
            <p>An expression in Cypher can be:</p>
            <div class="itemizedlist">
               <ul class="itemizedlist" style="list-style-type: disc; ">
                  <li class="listitem">A decimal (integer or double) literal: <code class="literal">13</code>, <code class="literal">-40000</code>, <code class="literal">3.14</code>, <code class="literal">6.022E23</code>.
                  </li>
                  <li class="listitem">A hexadecimal integer literal (starting with <code class="literal">0x</code>): <code class="literal">0x13zf</code>, <code class="literal">0xFC3A9</code>, <code class="literal">-0x66eff</code>.
                  </li>
                  <li class="listitem">An octal integer literal (starting with <code class="literal">0</code>): <code class="literal">01372</code>, <code class="literal">02127</code>, <code class="literal">-05671</code>.
                  </li>
                  <li class="listitem">A string literal: <code class="literal">'Hello'</code>, <code class="literal">"World"</code>.
                  </li>
                  <li class="listitem">A boolean literal:  <code class="literal">true</code>, <code class="literal">false</code>, <code class="literal">TRUE</code>, <code class="literal">FALSE</code>.
                  </li>
                  <li class="listitem">A variable: <code class="literal">n</code>, <code class="literal">x</code>, <code class="literal">rel</code>, <code class="literal">myFancyVariable</code>, <code class="literal">`A name with weird stuff in it[]!`</code>.
                  </li>
                  <li class="listitem">A property: <code class="literal">n.prop</code>, <code class="literal">x.prop</code>, <code class="literal">rel.thisProperty</code>, <code class="literal">myFancyVariable.`(weird property name)`</code>.
                  </li>
                  <li class="listitem">A dynamic property: <code class="literal">n["prop"]</code>, <code class="literal">rel[n.city + n.zip]</code>, <code class="literal">map[coll[0]]</code>.
                  </li>
                  <li class="listitem">A parameter: <code class="literal">$param</code>, <code class="literal">$0</code></li>
                  <li class="listitem">A list of expressions: <code class="literal">['a', 'b']</code>, <code class="literal">[1, 2, 3]</code>, <code class="literal">['a', 2, n.property, $param]</code>, <code class="literal">[ ]</code>.
                  </li>
                  <li class="listitem">A function call: <code class="literal">length(p)</code>, <code class="literal">nodes(p)</code>.
                  </li>
                  <li class="listitem">An aggregate function: <code class="literal">avg(x.prop)</code>, <code class="literal">count(*)</code>.
                  </li>
                  <li class="listitem">A path-pattern: <code class="literal">(a)--&gt;()&lt;--(b)</code>.
                  </li>
                  <li class="listitem">An operator application: <code class="literal">1 + 2</code> and <code class="literal">3 &lt; 4</code>.
                  </li>
                  <li class="listitem">A predicate expression is an expression that returns true or false: <code class="literal">a.prop = 'Hello'</code>, <code class="literal">length(p) &gt; 10</code>,
                     <code class="literal">exists(a.name)</code>.
                  </li>
                  <li class="listitem">A regular expression: <code class="literal">a.name =~ 'Tim.*'</code></li>
                  <li class="listitem">A case-sensitive string matching expression: <code class="literal">a.surname STARTS WITH 'Sven'</code>, <code class="literal">a.surname ENDS WITH 'son'</code> or <code class="literal">a.surname CONTAINS 'son'</code></li>
                  <li class="listitem">A <code class="literal">CASE</code> expression.
                  </li>
               </ul>
            </div>
         </section>
         <section class="section" id="cypher-expressions-string-literals">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-expressions-string-literals"></a>3.2.3.2.&nbsp;Note on string literals
                     </h4>
                  </div>
               </div>
            </div>
            <p>String literals can contain the following escape sequences:</p>
            <div class="informaltable">
               <div class="table" id="d0e3213">
                  <table class="informaltable" border="1" width="50%">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: right; vertical-align: top; ">Escape sequence</th>
                           <th style="text-align: left; vertical-align: top; ">Character</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: right; vertical-align: top; ">
                              <p><code class="literal">\t</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Tab</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: right; vertical-align: top; ">
                              <p><code class="literal">\b</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Backspace</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: right; vertical-align: top; ">
                              <p><code class="literal">\n</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Newline</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: right; vertical-align: top; ">
                              <p><code class="literal">\r</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Carriage return</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: right; vertical-align: top; ">
                              <p><code class="literal">\f</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Form feed</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: right; vertical-align: top; ">
                              <p><code class="literal">\'</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Single quote</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: right; vertical-align: top; ">
                              <p><code class="literal">\"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Double quote</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: right; vertical-align: top; ">
                              <p><code class="literal">\\</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Backslash</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: right; vertical-align: top; ">
                              <p><code class="literal">\uxxxx</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Unicode UTF-16 code point (4 hex digits must follow the <code class="literal">\u</code>)
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: right; vertical-align: top; ">
                              <p><code class="literal">\Uxxxxxxxx</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Unicode UTF-32 code point (8 hex digits must follow the <code class="literal">\U</code>)
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
         </section>
         <section class="section" id="query-syntax-case">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-syntax-case"></a>3.2.3.3.&nbsp;<code class="literal">CASE</code> expressions
                     </h4>
                  </div>
               </div>
            </div>
            <p>Generic conditional expressions may be expressed using the well-known <code class="literal">CASE</code> construct.
               Two variants of <code class="literal">CASE</code> exist within Cypher: the simple form, which allows an expression to be compared against multiple values, and the generic
               form, which allows multiple conditional statements to be expressed.
            </p>
            <p>The following graph is used for the examples below:</p>
            <div class="figure" id="d0e3328">
               <div class="figure-title">Figure&nbsp;3.2.&nbsp;Graph</div>
               <div class="figure-contents">
                  <div class="mediaobject"><img src="../../../images/`CASE`&#32;expressions-1.svg" alt="alt"></img></div>
               </div>
            </div>
            <section class="section" id="syntax-simple-case">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#syntax-simple-case"></a>Simple <code class="literal">CASE</code> form: comparing an expression against multiple values
                        </h5>
                     </div>
                  </div>
               </div>
               <p>The expression is calculated, and compared in order with the <code class="literal">WHEN</code> clauses until a match is found.
                  If no match is found, the expression in the <code class="literal">ELSE</code> clause is returned.
                  However, if there is no <code class="literal">ELSE</code> case and no match is found, <code class="literal">null</code> will be returned.
               </p>
               <p><span class="strong"><strong>Syntax:</strong></span></p><pre class="programlisting highlight"><code data-lang="cypher">CASE test
 WHEN value THEN result
  [WHEN ...]
  [ELSE default]
END</code></pre><p><span class="strong"><strong>Arguments:</strong></span></p>
               <div class="informaltable">
                  <div class="table" id="d0e3365">
                     <table class="informaltable" border="1">
                        <colgroup>
                           <col class="col_1"></col>
                           <col class="col_2"></col>
                        </colgroup>
                        <thead>
                           <tr>
                              <th style="text-align: left; vertical-align: top; ">Name</th>
                              <th style="text-align: left; vertical-align: top; ">Description</th>
                           </tr>
                        </thead>
                        <tbody>
                           <tr>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p><code class="literal">test</code></p>
                              </td>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p>A valid expression.</p>
                              </td>
                           </tr>
                           <tr>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p><code class="literal">value</code></p>
                              </td>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p>An expression whose result will be compared to <code class="literal">test</code>.
                                 </p>
                              </td>
                           </tr>
                           <tr>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p><code class="literal">result</code></p>
                              </td>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p>This is the expression returned as output if <code class="literal">value</code> matches <code class="literal">test</code>.
                                 </p>
                              </td>
                           </tr>
                           <tr>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p><code class="literal">default</code></p>
                              </td>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p>If no match is found, <code class="literal">default</code> is returned.
                                 </p>
                              </td>
                           </tr>
                        </tbody>
                     </table>
                  </div>
               </div>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN
CASE n.eyes
WHEN 'blue'
THEN 1
WHEN 'brown'
THEN 2
ELSE 3 END AS result</code></pre><p>
                  
               </p>
               <div class="table" id="d0e3428">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.1.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">result</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>5 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">2</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">3</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">2</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (alice:A {name:'Alice', age: 38, eyes: 'brown'}),
                            (bob:B {name: 'Bob', age: 25, eyes: 'blue'}),
                            (charlie:C {name: 'Charlie', age: 53, eyes: 'green'}),
                            (daniel:D {name: 'Daniel', eyes: 'brown'}),
                            (eskil:E {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                     
                            (alice)-[:KNOWS]-&gt;(bob),
                            (alice)-[:KNOWS]-&gt;(charlie),
                            (bob)-[:KNOWS]-&gt;(daniel),
                            (charlie)-[:KNOWS]-&gt;(daniel),
                            (bob)-[:MARRIED]-&gt;(eskil)
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        RETURN
                        CASE n.eyes
                        WHEN 'blue'  THEN 1
                        WHEN 'brown' THEN 2
                        ELSE 3
                        END AS result
                        </strong></span></p>
            </section>
            <section class="section" id="syntax-generic-case">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#syntax-generic-case"></a>Generic <code class="literal">CASE</code> form: allowing for multiple conditionals to be expressed
                        </h5>
                     </div>
                  </div>
               </div>
               <p>The predicates are evaluated in order until a <code class="literal">true</code> value is found, and the result value is used.
                  If no match is found, the expression in the <code class="literal">ELSE</code> clause is returned.
                  However, if there is no <code class="literal">ELSE</code> case and no match is found, <code class="literal">null</code> will be returned.
               </p>
               <p><span class="strong"><strong>Syntax:</strong></span></p><pre class="programlisting highlight"><code data-lang="cypher">CASE
WHEN predicate THEN result
  [WHEN ...]
  [ELSE default]
END</code></pre><p><span class="strong"><strong>Arguments:</strong></span></p>
               <div class="informaltable">
                  <div class="table" id="d0e3504">
                     <table class="informaltable" border="1">
                        <colgroup>
                           <col class="col_1"></col>
                           <col class="col_2"></col>
                        </colgroup>
                        <thead>
                           <tr>
                              <th style="text-align: left; vertical-align: top; ">Name</th>
                              <th style="text-align: left; vertical-align: top; ">Description</th>
                           </tr>
                        </thead>
                        <tbody>
                           <tr>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p><code class="literal">predicate</code></p>
                              </td>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p>A predicate that is tested to find a valid alternative.</p>
                              </td>
                           </tr>
                           <tr>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p><code class="literal">result</code></p>
                              </td>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p>This is the expression returned as output if <code class="literal">predicate</code> evaluates to <code class="literal">true</code>.
                                 </p>
                              </td>
                           </tr>
                           <tr>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p><code class="literal">default</code></p>
                              </td>
                              <td style="text-align: left; vertical-align: top; ">
                                 <p>If no match is found, <code class="literal">default</code> is returned.
                                 </p>
                              </td>
                           </tr>
                        </tbody>
                     </table>
                  </div>
               </div>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN
CASE
WHEN n.eyes = 'blue'
THEN 1
WHEN n.age &lt; 40
THEN 2
ELSE 3 END AS result</code></pre><p>
                  
               </p>
               <div class="table" id="d0e3556">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.2.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">result</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>5 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">2</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">3</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">3</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (alice:A {name:'Alice', age: 38, eyes: 'brown'}),
                            (bob:B {name: 'Bob', age: 25, eyes: 'blue'}),
                            (charlie:C {name: 'Charlie', age: 53, eyes: 'green'}),
                            (daniel:D {name: 'Daniel', eyes: 'brown'}),
                            (eskil:E {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                     
                            (alice)-[:KNOWS]-&gt;(bob),
                            (alice)-[:KNOWS]-&gt;(charlie),
                            (bob)-[:KNOWS]-&gt;(daniel),
                            (charlie)-[:KNOWS]-&gt;(daniel),
                            (bob)-[:MARRIED]-&gt;(eskil)
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        RETURN
                        CASE
                        WHEN n.eyes = 'blue'  THEN 1
                        WHEN n.age &lt; 40       THEN 2
                        ELSE 3
                        END AS result
                        </strong></span></p>
            </section>
            <section class="section" id="syntax-distinguish-case">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#syntax-distinguish-case"></a>Distinguishing between when to use the simple and generic <code class="literal">CASE</code> forms
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Owing to the close similarity between the syntax of the two forms, sometimes it may not be clear at the outset as to which
                  form to use.
                  We illustrate this scenario by means of the following query, in which there is an expectation that <code class="literal">age_10_years_ago</code> is <code class="literal">-1</code> if <code class="literal">n.age</code> is <code class="literal">null</code>:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN n.name,
CASE n.age
WHEN n.age IS NULL THEN -1
ELSE n.age - 10 END AS age_10_years_ago</code></pre><p>
                  
               </p>
               <p>However, as this query is written using the simple <code class="literal">CASE</code> form, instead of <code class="literal">age_10_years_ago</code> being <code class="literal">-1</code> for the node named <code class="literal">Daniel</code>, it is <code class="literal">null</code>.
                  This is because a comparison is made between <code class="literal">n.age</code> and <code class="literal">n.age IS NULL</code>.
                  As <code class="literal">n.age IS NULL</code> is a boolean value, and <code class="literal">n.age</code> is an integer value, the <code class="literal">WHEN n.age IS NULL THEN -1</code> branch is never taken.
                  This results in the <code class="literal">ELSE n.age - 10</code> branch being taken instead, returning <code class="literal">null</code>.
               </p>
               <div class="table" id="d0e3670">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.3.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">age_10_years_ago</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>5 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Alice"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">28</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Bob"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">15</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Charlie"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">43</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Daniel"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">&lt;null&gt;</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Eskil"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">31</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (alice:A {name:'Alice', age: 38, eyes: 'brown'}),
                            (bob:B {name: 'Bob', age: 25, eyes: 'blue'}),
                            (charlie:C {name: 'Charlie', age: 53, eyes: 'green'}),
                            (daniel:D {name: 'Daniel', eyes: 'brown'}),
                            (eskil:E {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                     
                            (alice)-[:KNOWS]-&gt;(bob),
                            (alice)-[:KNOWS]-&gt;(charlie),
                            (bob)-[:KNOWS]-&gt;(daniel),
                            (charlie)-[:KNOWS]-&gt;(daniel),
                            (bob)-[:MARRIED]-&gt;(eskil)
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        RETURN n.name,
                        CASE n.age
                        WHEN n.age IS NULL THEN -1
                        ELSE n.age - 10
                        END AS age_10_years_ago
                        </strong></span></p>
               <p>The corrected query, behaving as expected, is given by the following generic <code class="literal">CASE</code> form:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN n.name,
CASE
WHEN n.age IS NULL THEN -1
ELSE n.age - 10 END AS age_10_years_ago</code></pre><p>
                  
               </p>
               <p>We now see that the <code class="literal">age_10_years_ago</code> correctly returns <code class="literal">-1</code> for the node named <code class="literal">Daniel</code>.
               </p>
               <div class="table" id="d0e3765">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.4.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">age_10_years_ago</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>5 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Alice"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">28</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Bob"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">15</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Charlie"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">43</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Daniel"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">-1</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Eskil"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">31</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (alice:A {name:'Alice', age: 38, eyes: 'brown'}),
                            (bob:B {name: 'Bob', age: 25, eyes: 'blue'}),
                            (charlie:C {name: 'Charlie', age: 53, eyes: 'green'}),
                            (daniel:D {name: 'Daniel', eyes: 'brown'}),
                            (eskil:E {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                     
                            (alice)-[:KNOWS]-&gt;(bob),
                            (alice)-[:KNOWS]-&gt;(charlie),
                            (bob)-[:KNOWS]-&gt;(daniel),
                            (charlie)-[:KNOWS]-&gt;(daniel),
                            (bob)-[:MARRIED]-&gt;(eskil)
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        RETURN n.name,
                        CASE
                        WHEN n.age IS NULL THEN -1
                        ELSE n.age - 10
                        END AS age_10_years_ago
                        </strong></span></p>
            </section>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>