
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.4.11.&nbsp;User-defined functions - 3.4.&nbsp;Functions</title>
      <link rel="stylesheet" type="text/css" href="../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../javascript/colorize.js" type="text/javascript"></script><script src="../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="User-defined functions are written in Java, deployed into the database and are called in the same way as any other Cypher function."></meta>
      <link rel="prev" href="../../cypher/functions/spatial/index.html" title="3.4.10.&nbsp;Spatial functions"></link>
      <link rel="next" href="../../cypher/schema/index.html" title="3.5.&nbsp;Schema"></link>
      <link rel="shortcut icon" href="../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../index.html" id="logo"><img src="../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../../cypher/functions/spatial/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Spatial functions</a></span><span class="nav-current">
               <p class="nav-title hidden">3.4.11.&nbsp;User-defined functions</p></span><span class="nav-next"><a accesskey="n" href="../../cypher/schema/index.html">Schema<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-functions-user-defined">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-functions-user-defined"></a>3.4.11.&nbsp;User-defined functions
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>User-defined functions are written in Java, deployed into the database and are called in the same way as any other Cypher
               function.
            </p>
         </div>
         <p>There are two main types of functions that can be developed and used:</p>
         <div class="informaltable">
            <div class="table" id="d0e53240">
               <table class="informaltable" border="1">
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                     <col class="col_3"></col>
                     <col class="col_4"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">Type</th>
                        <th style="text-align: left; vertical-align: top; ">Description</th>
                        <th style="text-align: left; vertical-align: top; ">Usage</th>
                        <th style="text-align: left; vertical-align: top; ">Developing</th>
                     </tr>
                  </thead>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p>Scalar</p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p>For each row the function takes parameters and returns a result</p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><a class="link" href="index.html#query-functions-udf" title="3.4.11.1.&nbsp;User-defined scalar functions">Using UDF</a></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><a class="link" href="../../extending-neo4j/cypher-functions/index.html" title="6.2.&nbsp;User-defined functions">Extending Neo4j (UDF)</a></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p>Aggregating</p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p>Consumes many rows and produces an aggregated result</p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><a class="link" href="index.html#query-functions-user-defined-aggregation" title="3.4.11.2.&nbsp;User-defined aggregation functions">Using aggregating UDF</a></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><a class="link" href="../../extending-neo4j/cypher-functions/index.html#user-defined-aggregation-functions" title="6.2.3.&nbsp;User-defined aggregation functions">Extending Neo4j (Aggregating UDF)</a></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
         </div>
         <section class="section" id="query-functions-udf">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-functions-udf"></a>3.4.11.1.&nbsp;User-defined scalar functions
                     </h4>
                  </div>
               </div>
            </div>
            <p>For each incoming row the function takes parameters and returns a single result.</p>
            <p>This example shows how you invoke a user-defined function called <code class="literal">join</code> from Cypher.
            </p>
            <section class="section" id="_call_a_user_defined_function">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#_call_a_user_defined_function"></a>Call a user-defined function
                        </h5>
                     </div>
                  </div>
               </div>
               <p>This calls the user-defined function <code class="literal">org.neo4j.procedure.example.join()</code>.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n:Member)
RETURN org.neo4j.function.example.join(collect(n.name)) AS members</code></pre><p>
                  
               </p>
               <div class="table" id="d0e53313">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.383.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">members</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"John,Paul,George,Ringo"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     UNWIND ["John", "Paul", "George", "Ringo"] as name CREATE (:Member {name: name})
                     
                     </span><span class="command"><strong>
                        MATCH (n:Member) RETURN org.neo4j.function.example.join(collect(n.name)) AS members
                        </strong></span></p>
               <p>For developing and deploying user-defined functions in Neo4j, see <a class="link" href="../../extending-neo4j/cypher-functions/index.html" title="6.2.&nbsp;User-defined functions">Extending Neo4j &#8594; User-defined functions</a>.
               </p>
            </section>
         </section>
         <section class="section" id="query-functions-user-defined-aggregation">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-functions-user-defined-aggregation"></a>3.4.11.2.&nbsp;User-defined aggregation functions
                     </h4>
                  </div>
               </div>
            </div>
            <p>Aggregating functions consume many rows and produces a single aggregated result.</p>
            <p>This example shows how you invoke a user-defined aggregation function called <code class="literal">longestString</code> from Cypher.
            </p>
            <section class="section" id="functions-call-a-user-defined-aggregation-function">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#functions-call-a-user-defined-aggregation-function"></a>Call a user-defined aggregation function
                        </h5>
                     </div>
                  </div>
               </div>
               <p>This calls the user-defined function <code class="literal">org.neo4j.function.example.longestString()</code>.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n:Member)
RETURN org.neo4j.function.example.longestString(n.name) AS member</code></pre><p>
                  
               </p>
               <div class="table" id="d0e53372">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.384.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">member</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"George"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     UNWIND ['John', 'Paul', 'George', 'Ringe'] AS beatle
                     CREATE (:Member {name: beatle})
                     
                     </span><span class="command"><strong>
                        MATCH (n:Member)
                        RETURN org.neo4j.function.example.longestString(n.name) AS member
                        </strong></span></p>
            </section>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>