
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.4.4.&nbsp;List functions - 3.4.&nbsp;Functions</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="List functions return lists of things&#8201;&#8212;&#8201;nodes in a path, and so on."></meta>
      <link rel="prev" href="../aggregating/index.html" title="3.4.3.&nbsp;Aggregating functions"></link>
      <link rel="next" href="../mathematical/numeric/index.html" title="3.4.5.&nbsp;Mathematical functions - numeric"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../aggregating/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Aggregating functions</a></span><span class="nav-current">
               <p class="nav-title hidden">3.4.4.&nbsp;List functions</p></span><span class="nav-next"><a accesskey="n" href="../mathematical/numeric/index.html">Mathematical functions - numeric<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-functions-list">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-functions-list"></a>3.4.4.&nbsp;List functions
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>List functions return lists of things&#8201;&#8212;&#8201;nodes in a path, and so on.</p>
         </div>
         <p>Further details and examples of lists may be found in <a class="xref" href="../../syntax/lists/index.html" title="3.2.11.&nbsp;Lists">Section&nbsp;3.2.11, &#8220;Lists&#8221;</a> and <a class="xref" href="../../syntax/operators/index.html#query-operators-list" title="3.2.7.10.&nbsp;List operators">Section&nbsp;3.2.7.10, &#8220;List operators&#8221;</a>.
         </p>
         <div class="admonitionblock note">
            <table>
               <tbody>
                  <tr>
                     <td class="icon"><i class="fa icon-note" title="note"></i></td>
                     <td class="content">
                        <p>The function <code class="literal">rels()</code> has been superseded by <code class="literal">relationships()</code>, and will be removed in a future release.
                        </p>
                     </td>
                  </tr>
               </tbody>
            </table>
         </div>
         <p>Functions:</p>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#functions-extract" title="3.4.4.1.&nbsp;extract()">extract()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-filter" title="3.4.4.2.&nbsp;filter()">filter()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-keys" title="3.4.4.3.&nbsp;keys()">keys()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-labels" title="3.4.4.4.&nbsp;labels()">labels()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-nodes" title="3.4.4.5.&nbsp;nodes()">nodes()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-range" title="3.4.4.6.&nbsp;range()">range()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-reduce" title="3.4.4.7.&nbsp;reduce()">reduce()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-relationships" title="3.4.4.8.&nbsp;relationships()">relationships()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-reverse-list" title="3.4.4.9.&nbsp;reverse()">reverse()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-tail" title="3.4.4.10.&nbsp;tail()">tail()</a></li>
            </ul>
         </div>
         <div class="figure" id="d0e32923">
            <div class="figure-title">Figure&nbsp;3.25.&nbsp;Graph</div>
            <div class="figure-contents">
               <div class="mediaobject"><img src="../../../images/List&#32;functions-1.svg" alt="alt"></img></div>
            </div>
         </div>
         <section class="section" id="functions-extract">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-extract"></a>3.4.4.1.&nbsp;extract()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">extract()</code> returns a list <code class="literal">l<sub>result</sub></code> containing the values resulting from an expression which has been applied to each element in a list <code class="literal">list</code>.
               This function is analogous to the <code class="literal">map</code> method in functional languages such as Lisp and Scala.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">extract(variable IN list | expression)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32959">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A list containing heterogeneous elements; the types of the elements are determined by <code class="literal">expression</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32973">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">list</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a list.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">variable</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>The closure will have a variable introduced in its context. We decide here which variable to use.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>This expression will run once per value in <code class="literal">list</code>, and add it to the list which is returned by <code class="literal">extract()</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33017">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Any <code class="literal">null</code> values in <code class="literal">list</code> are preserved.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p>Common usages of <code class="literal">extract()</code> include:
            </p>
            <div class="itemizedlist">
               <ul class="itemizedlist" style="list-style-type: disc; ">
                  <li class="listitem">Returning a property from a list of nodes or relationships; for example, <code class="literal">expression</code> = <code class="literal">n.prop</code> and <code class="literal">list</code> = <code class="literal">nodes(&lt;some-path&gt;)</code>.
                  </li>
                  <li class="listitem">Returning the result of the application of a function on each element in a list; for example, <code class="literal">expression</code> = <code class="literal">toUpper(x)</code> and <code class="literal">variable</code> = <code class="literal">x</code>.
                  </li>
               </ul>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH p =(a)--&gt;(b)--&gt;(c)
WHERE a.name = 'Alice' AND b.name = 'Bob' AND c.name = 'Daniel'
RETURN extract(n IN nodes(p)| n.age) AS extracted</code></pre><p>
               
            </p>
            <p>The <code class="literal">age</code> property of all nodes in path <code class="literal">p</code> are returned.
            </p>
            <div class="table" id="d0e33083">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.252.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">extracted</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">[38,25,54]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice:Person:Developer {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH p = (a)--&gt;(b)--&gt;(c)
                     WHERE a.name = 'Alice' AND b.name = 'Bob' AND c.name = 'Daniel'
                     RETURN extract(n IN nodes(p) | n.age) AS extracted
                     </strong></span></p>
         </section>
         <section class="section" id="functions-filter">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-filter"></a>3.4.4.2.&nbsp;filter()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">filter()</code> returns a list <code class="literal">l<sub>result</sub></code> containing all the elements from a list <code class="literal">list</code> that comply with the given predicate.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">filter(variable IN list WHERE predicate)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33135">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A list containing heterogeneous elements; the types of the elements are determined by the elements in <code class="literal">list</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33149">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">list</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a list.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">variable</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>This is the variable that can be used from the predicate.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">predicate</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A predicate that is tested against all elements in <code class="literal">list</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a)
WHERE a.name = 'Eskil'
RETURN a.array, filter(x IN a.array WHERE size(x)= 3)</code></pre><p>
               
            </p>
            <p>The property named <code class="literal">array</code> and a list of all values having size <span class="strong"><strong>'3'</strong></span> are returned.
            </p>
            <div class="table" id="d0e33203">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.253.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">a.array</th>
                        <th style="text-align: left; vertical-align: top; ">filter(x IN a.array WHERE size(x)= 3)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="2">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">["one","two","three"]</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">["one","two"]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice:Person:Developer {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH (a)
                     WHERE a.name = 'Eskil'
                     RETURN a.array, filter(x IN a.array WHERE size(x)= 3)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-keys">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-keys"></a>3.4.4.3.&nbsp;keys()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">keys</code> returns a list containing the string representations for all the property names of a node, relationship, or map.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">keys(expression)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33254">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A list containing String elements.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33265">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a node, a relationship, or a map.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33287">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">keys(null)</code> returns <code class="literal">null</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a)
WHERE a.name = 'Alice'
RETURN keys(a)</code></pre><p>
               
            </p>
            <p>A list containing the names of all the properties on the node bound to <code class="literal">a</code> is returned.
            </p>
            <div class="table" id="d0e33313">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.254.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">keys(a)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">["name","age","eyes"]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice:Person:Developer {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH (a) WHERE a.name = 'Alice'
                     RETURN keys(a)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-labels">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-labels"></a>3.4.4.4.&nbsp;labels()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">labels</code> returns a list containing the string representations for all the labels of a node.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">labels(node)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33357">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A list containing String elements.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33368">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">node</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a single node.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33390">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">labels(null)</code> returns <code class="literal">null</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a)
WHERE a.name = 'Alice'
RETURN labels(a)</code></pre><p>
               
            </p>
            <p>A list containing all the labels of the node bound to <code class="literal">a</code> is returned.
            </p>
            <div class="table" id="d0e33416">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.255.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">labels(a)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">["Person","Developer"]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice:Person:Developer {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH (a) WHERE a.name = 'Alice'
                     RETURN labels(a)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-nodes">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-nodes"></a>3.4.4.5.&nbsp;nodes()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">nodes()</code> returns a list containing all the nodes in a path.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">nodes(path)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33460">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A list containing Node elements.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33471">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">path</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a path.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33493">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">nodes(null)</code> returns <code class="literal">null</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH p =(a)--&gt;(b)--&gt;(c)
WHERE a.name = 'Alice' AND c.name = 'Eskil'
RETURN nodes(p)</code></pre><p>
               
            </p>
            <p>A list containing all the nodes in the path <code class="literal">p</code> is returned.
            </p>
            <div class="table" id="d0e33519">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.256.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">nodes(p)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">[Node[0]{name:"Alice",age:38,eyes:"brown"},Node[1]{name:"Bob",age:25,eyes:"blue"},Node[4]{array:["one","two","three"],name:"Eskil",age:41,eyes:"blue"}]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice:Person:Developer {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH p = (a)--&gt;(b)--&gt;(c)
                     WHERE a.name = 'Alice' AND c.name = 'Eskil'
                     RETURN nodes(p)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-range">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-range"></a>3.4.4.6.&nbsp;range()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">range()</code> returns a list comprising all integer values within a range bounded by a start value <code class="literal">start</code> and end value <code class="literal">end</code>, where the difference <code class="literal">step</code> between any two consecutive values is constant; i.e. an arithmetic progression.
               The range is inclusive, and the arithmetic progression will therefore always contain <code class="literal">start</code> and&#8201;&#8212;&#8201;depending on the values of <code class="literal">start</code>, <code class="literal">step</code> and <code class="literal">end</code>&#8201;&#8212;&#8201;<code class="literal">end</code>.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">range(start, end [, step])</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33587">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A list of Integer elements.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33598">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">start</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns an integer value.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">end</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns an integer value.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">step</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A numeric expression defining the difference between any two consecutive values, with a default of <code class="literal">1</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">RETURN range(0, 10), range(2, 18, 3)</code></pre><p>
               
            </p>
            <p>Two lists of numbers in the given ranges are returned.</p>
            <div class="table" id="d0e33646">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.257.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">range(0, 10)</th>
                        <th style="text-align: left; vertical-align: top; ">range(2, 18, 3)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="2">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">[0,1,2,3,4,5,6,7,8,9,10]</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">[2,5,8,11,14,17]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice:Person:Developer {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     RETURN range(0, 10), range(2, 18, 3)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-reduce">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-reduce"></a>3.4.4.7.&nbsp;reduce()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">reduce()</code> returns the value resulting from the application of an expression on each successive element in a list in conjunction with
               the result of the computation thus far.
                          This function will iterate through each element <code class="literal">e</code> in the given list, run the expression on <code class="literal">e</code>&#8201;&#8212;&#8201;taking into account the current partial result&#8201;&#8212;&#8201;and store the new partial result in the accumulator.
                          This function is analogous to the <code class="literal">fold</code> or <code class="literal">reduce</code> method in functional languages such as Lisp and Scala.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">reduce(accumulator = initial, variable IN list | expression)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33709">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>The type of the value returned depends on the arguments provided, along with the semantics of <code class="literal">expression</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33723">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">accumulator</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A variable that will hold the result and the partial results as the list is iterated.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">initial</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that runs once to give a starting value to the accumulator.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">list</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a list.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">variable</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>The closure will have a variable introduced in its context. We decide here which variable to use.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>This expression will run once per value in the list, and produce the result value.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH p =(a)--&gt;(b)--&gt;(c)
WHERE a.name = 'Alice' AND b.name = 'Bob' AND c.name = 'Daniel'
RETURN reduce(totalAge = 0, n IN nodes(p)| totalAge + n.age) AS reduction</code></pre><p>
               
            </p>
            <p>The <code class="literal">age</code> property of all nodes in the path are summed and returned as a single value.
            </p>
            <div class="table" id="d0e33787">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.258.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">reduction</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">117</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice:Person:Developer {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH p = (a)--&gt;(b)--&gt;(c)
                     WHERE a.name = 'Alice' AND b.name = 'Bob' AND c.name = 'Daniel'
                     RETURN reduce(totalAge = 0, n IN nodes(p) | totalAge + n.age) AS reduction
                     </strong></span></p>
         </section>
         <section class="section" id="functions-relationships">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-relationships"></a>3.4.4.8.&nbsp;relationships()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">relationships()</code> returns a list containing all the relationships in a path.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">relationships(path)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33831">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A list containing Relationship elements.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33842">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">path</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a path.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33864">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">relationships(null)</code> returns <code class="literal">null</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH p =(a)--&gt;(b)--&gt;(c)
WHERE a.name = 'Alice' AND c.name = 'Eskil'
RETURN relationships(p)</code></pre><p>
               
            </p>
            <p>A list containing all the relationships in the path <code class="literal">p</code> is returned.
            </p>
            <div class="table" id="d0e33890">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.259.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">relationships(p)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">[:KNOWS[0]{},:MARRIED[4]{}]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice:Person:Developer {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH p = (a)--&gt;(b)--&gt;(c)
                     WHERE a.name = 'Alice' AND c.name = 'Eskil'
                     RETURN relationships(p)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-reverse-list">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-reverse-list"></a>3.4.4.9.&nbsp;reverse()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">reverse()</code> returns a list in which the order of all elements in the original list have been reversed.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">reverse(original)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33934">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A list containing homogeneous or heterogeneous elements; the types of the elements are determined by the elements within <code class="literal">original</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33948">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">original</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a list.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e33970">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Any <code class="literal">null</code> element in <code class="literal">original</code> is preserved.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">WITH [4923,'abc',521, NULL , 487] AS ids
RETURN reverse(ids)</code></pre><p>
               
            </p>
            <div class="table" id="d0e33992">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.260.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">reverse(ids)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">[487,&lt;null&gt;,521,"abc",4923]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice:Person:Developer {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     WITH [4923,'abc',521, null, 487] AS ids
                     RETURN reverse(ids)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-tail">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-tail"></a>3.4.4.10.&nbsp;tail()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">tail()</code> returns a list <code class="literal">l<sub>result</sub></code> containing all the elements, excluding the first one, from a list <code class="literal">list</code>.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">tail(list)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e34044">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A list containing heterogeneous elements; the types of the elements are determined by the elements in <code class="literal">list</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e34058">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">list</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a list.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a)
WHERE a.name = 'Eskil'
RETURN a.array, tail(a.array)</code></pre><p>
               
            </p>
            <p>The property named <code class="literal">array</code> and a list comprising all but the first element of the <code class="literal">array</code> property are returned.
            </p>
            <div class="table" id="d0e34093">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.261.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">a.array</th>
                        <th style="text-align: left; vertical-align: top; ">tail(a.array)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="2">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">["one","two","three"]</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">["two","three"]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice:Person:Developer {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH (a) WHERE a.name = 'Eskil'
                     RETURN a.array, tail(a.array)
                     </strong></span></p>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>