
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.3.1.&nbsp;MATCH - 3.3.&nbsp;Clauses</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="The MATCH clause is used to search for the pattern described in it."></meta>
      <link rel="prev" href="../index.html" title="3.3.&nbsp;Clauses"></link>
      <link rel="next" href="../optional-match/index.html" title="3.3.2.&nbsp;OPTIONAL MATCH"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Clauses</a></span><span class="nav-current">
               <p class="nav-title hidden">3.3.1.&nbsp;MATCH</p></span><span class="nav-next"><a accesskey="n" href="../optional-match/index.html">OPTIONAL MATCH<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-match">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-match"></a>3.3.1.&nbsp;MATCH
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>The <code class="literal">MATCH</code> clause is used to search for the pattern described in it.
            </p>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#match-introduction" title="3.3.1.1.&nbsp;Introduction">Introduction</a></li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#basic-node-finding" title="3.3.1.2.&nbsp;Basic node finding">Basic node finding</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#get-all-nodes" title="Get all nodes">Get all nodes</a></li>
                        <li class="listitem"><a class="link" href="index.html#get-all-nodes-with-label" title="Get all nodes with a label">Get all nodes with a label</a></li>
                        <li class="listitem"><a class="link" href="index.html#related-nodes" title="Related nodes">Related nodes</a></li>
                        <li class="listitem"><a class="link" href="index.html#match-with-labels" title="Match with labels">Match with labels</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#relationship-basics" title="3.3.1.3.&nbsp;Relationship basics">Relationship basics</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#outgoing-relationships" title="Outgoing relationships">Outgoing relationships</a></li>
                        <li class="listitem"><a class="link" href="index.html#directed-rels-and-variable" title="Directed relationships and variable">Directed relationships and variable</a></li>
                        <li class="listitem"><a class="link" href="index.html#match-on-rel-type" title="Match on relationship type">Match on relationship type</a></li>
                        <li class="listitem"><a class="link" href="index.html#match-on-multiple-rel-types" title="Match on multiple relationship types">Match on multiple relationship types</a></li>
                        <li class="listitem"><a class="link" href="index.html#match-on-rel-type-use-variable" title="Match on relationship type and use a variable">Match on relationship type and use a variable</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#relationships-in-depth" title="3.3.1.4.&nbsp;Relationships in depth">Relationships in depth</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#rel-types-with-uncommon-chars" title="Relationship types with uncommon characters">Relationship types with uncommon characters</a></li>
                        <li class="listitem"><a class="link" href="index.html#multiple-rels" title="Multiple relationships">Multiple relationships</a></li>
                        <li class="listitem"><a class="link" href="index.html#varlength-rels" title="Variable length relationships">Variable length relationships</a></li>
                        <li class="listitem"><a class="link" href="index.html#rel-variable-in-varlength-rels" title="Relationship variable in variable length relationships">Relationship variable in variable length relationships</a></li>
                        <li class="listitem"><a class="link" href="index.html#match-props-on-varlength-path" title="Match with properties on a variable length path">Match with properties on a variable length path</a></li>
                        <li class="listitem"><a class="link" href="index.html#zero-length-paths" title="Zero length paths">Zero length paths</a></li>
                        <li class="listitem"><a class="link" href="index.html#named-paths" title="Named paths">Named paths</a></li>
                        <li class="listitem"><a class="link" href="index.html#match-on-bound-rel" title="Matching on a bound relationship">Matching on a bound relationship</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-shortest-path" title="3.3.1.5.&nbsp;Shortest path">Shortest path</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#single-shortest-path" title="Single shortest path">Single shortest path</a></li>
                        <li class="listitem"><a class="link" href="index.html#single-shortest-path-with-predicates" title="Single shortest path with predicates">Single shortest path with predicates</a></li>
                        <li class="listitem"><a class="link" href="index.html#all-shortest-paths" title="All shortest paths">All shortest paths</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#get-node-rel-by-id" title="3.3.1.6.&nbsp;Get node or relationship by id">Get node or relationship by id</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#match-node-by-id" title="Node by id">Node by id</a></li>
                        <li class="listitem"><a class="link" href="index.html#match-rel-by-id" title="Relationship by id">Relationship by id</a></li>
                        <li class="listitem"><a class="link" href="index.html#match-multiple-nodes-by-id" title="Multiple nodes by id">Multiple nodes by id</a></li>
                     </ul>
                  </div>
               </li>
            </ul>
         </div>
         <section class="section" id="match-introduction">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#match-introduction"></a>3.3.1.1.&nbsp;Introduction
                     </h4>
                  </div>
               </div>
            </div>
            <p>The <code class="literal">MATCH</code> clause allows you to specify the patterns Neo4j will search for in the database.
               This is the primary way of getting data into the current set of bindings.
               It is worth reading up more on the specification of the patterns themselves in <a class="xref" href="../../syntax/patterns/index.html" title="3.2.9.&nbsp;Patterns">Section&nbsp;3.2.9, &#8220;Patterns&#8221;</a>.
            </p>
            <p><code class="literal">MATCH</code> is often coupled to a <code class="literal">WHERE</code> part which adds restrictions, or predicates, to the <code class="literal">MATCH</code> patterns, making them more specific.
               The predicates are part of the pattern description, and should not be considered a filter applied only after the matching
               is done.
               <span class="emphasis"><em>This means that <code class="literal">WHERE</code> should always be put together with the <code class="literal">MATCH</code> clause it belongs to.</em></span></p>
            <p><code class="literal">MATCH</code> can occur at the beginning of the query or later, possibly after a <code class="literal">WITH</code>.
               If it is the first clause, nothing will have been bound yet, and Neo4j will design a search to find the results matching the
               clause and any associated predicates specified in any <code class="literal">WHERE</code> part.
               This could involve a scan of the database, a search for nodes having a certain label, or a search of an index to find starting
               points for the pattern matching.
               Nodes and relationships found by this search are available as <span class="emphasis"><em>bound pattern elements,</em></span> and can be used for pattern matching of sub-graphs.
               They can also be used in any further <code class="literal">MATCH</code> clauses, where Neo4j will use the known elements, and from there find further unknown elements.
            </p>
            <p>Cypher is declarative, and so usually the query itself does not specify the algorithm to use to perform the search.
               Neo4j will automatically work out the best approach to finding start nodes and matching patterns.
               Predicates in <code class="literal">WHERE</code> parts can be evaluated before pattern matching, during pattern matching, or after finding matches.
               However, there are cases where you can influence the decisions taken by the query compiler.
               Read more about indexes in <a class="xref" href="../../schema/index/index.html" title="3.5.1.&nbsp;Indexes">Section&nbsp;3.5.1, &#8220;Indexes&#8221;</a>, and more about specifying hints to force Neo4j to solve a query in a specific way in <a class="xref" href="../../query-tuning/using/index.html" title="3.6.4.&nbsp;Planner hints and the USING keyword">Section&nbsp;3.6.4, &#8220;Planner hints and the USING keyword&#8221;</a>.
            </p>
            <div class="admonitionblock tip">
               <table>
                  <tbody>
                     <tr>
                        <td class="icon"><i class="fa icon-tip" title="tip"></i></td>
                        <td class="content">
                           <p>To understand more about the patterns used in the <code class="literal">MATCH</code> clause, read <a class="xref" href="../../syntax/patterns/index.html" title="3.2.9.&nbsp;Patterns">Section&nbsp;3.2.9, &#8220;Patterns&#8221;</a></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p>The following graph is used for the examples below:</p>
            <div class="figure" id="d0e15777">
               <div class="figure-title">Figure&nbsp;3.6.&nbsp;Graph</div>
               <div class="figure-contents">
                  <div class="mediaobject"><img src="../../../images/MATCH-3.svg" alt="alt"></img></div>
               </div>
            </div>
         </section>
         <section class="section" id="basic-node-finding">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#basic-node-finding"></a>3.3.1.2.&nbsp;Basic node finding
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="get-all-nodes">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#get-all-nodes"></a>Get all nodes
                        </h5>
                     </div>
                  </div>
               </div>
               <p>By just specifying a pattern with a single node and no labels, all nodes in the graph will be returned.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN n</code></pre><p>
                  
               </p>
               <p>Returns all the nodes in the database.</p>
               <div class="table" id="d0e15804">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.81.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>7 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[0]{name:"Charlie Sheen"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[1]{name:"Martin Sheen"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[2]{name:"Michael Douglas"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[3]{name:"Oliver Stone"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[4]{name:"Rob Reiner"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[5]{title:"Wall Street"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[6]{title:"The American President"}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (n) RETURN n
                        </strong></span></p>
            </section>
            <section class="section" id="get-all-nodes-with-label">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#get-all-nodes-with-label"></a>Get all nodes with a label
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Getting all nodes with a label on them is done with a single node pattern where the node has a label on it.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (movie:Movie)
RETURN movie.title</code></pre><p>
                  
               </p>
               <p>Returns all the movies in the database.</p>
               <div class="table" id="d0e15877">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.82.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">movie.title</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>2 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Wall Street"</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"The American President"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (movie:Movie) RETURN movie.title
                        </strong></span></p>
            </section>
            <section class="section" id="related-nodes">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#related-nodes"></a>Related nodes
                        </h5>
                     </div>
                  </div>
               </div>
               <p>The symbol <code class="literal">--</code> means <span class="emphasis"><em>related to,</em></span> without regard to type or direction of the relationship.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (director { name: 'Oliver Stone' })--(movie)
RETURN movie.title</code></pre><p>
                  
               </p>
               <p>Returns all the movies directed by <span class="strong"><strong>'Oliver Stone'</strong></span>.
               </p>
               <div class="table" id="d0e15934">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.83.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">movie.title</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Wall Street"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (director {name: 'Oliver Stone'})--(movie) RETURN movie.title
                        </strong></span></p>
            </section>
            <section class="section" id="match-with-labels">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-with-labels"></a>Match with labels
                        </h5>
                     </div>
                  </div>
               </div>
               <p>To constrain your pattern with labels on nodes, you add it to your pattern nodes, using the label syntax.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (:Person { name: 'Oliver Stone' })--(movie:Movie)
RETURN movie.title</code></pre><p>
                  
               </p>
               <p>Returns any nodes connected with the <code class="literal">Person</code> <span class="strong"><strong>'Oliver'</strong></span> that are labeled <code class="literal">Movie</code>.
               </p>
               <div class="table" id="d0e15986">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.84.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">movie.title</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Wall Street"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (:Person {name: 'Oliver Stone'})--(movie:Movie) RETURN movie.title
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="relationship-basics">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#relationship-basics"></a>3.3.1.3.&nbsp;Relationship basics
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="outgoing-relationships">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#outgoing-relationships"></a>Outgoing relationships
                        </h5>
                     </div>
                  </div>
               </div>
               <p>When the direction of a relationship is of interest, it is shown by using <code class="literal">-&#8594;</code> or <code class="literal">&#8592;-</code>, like this:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (:Person { name: 'Oliver Stone' })--&gt;(movie)
RETURN movie.title</code></pre><p>
                  
               </p>
               <p>Returns any nodes connected with the <code class="literal">Person</code> <span class="strong"><strong>'Oliver'</strong></span> by an outgoing relationship.
               </p>
               <div class="table" id="d0e16044">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.85.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">movie.title</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Wall Street"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (:Person {name: 'Oliver Stone'})--&gt;(movie) RETURN movie.title
                        </strong></span></p>
            </section>
            <section class="section" id="directed-rels-and-variable">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#directed-rels-and-variable"></a>Directed relationships and variable
                        </h5>
                     </div>
                  </div>
               </div>
               <p>If a variable is required, either for filtering on properties of the relationship, or to return the relationship, this is
                  how you introduce the variable.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (:Person { name: 'Oliver Stone' })-[r]-&gt;(movie)
RETURN type(r)</code></pre><p>
                  
               </p>
               <p>Returns the type of each outgoing relationship from <span class="strong"><strong>'Oliver'</strong></span>.
               </p>
               <div class="table" id="d0e16090">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.86.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">type(r)</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"DIRECTED"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (:Person {name: 'Oliver Stone'})-[r]-&gt;(movie) RETURN type(r)
                        </strong></span></p>
            </section>
            <section class="section" id="match-on-rel-type">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-on-rel-type"></a>Match on relationship type
                        </h5>
                     </div>
                  </div>
               </div>
               <p>When you know the relationship type you want to match on, you can specify it by using a colon together with the relationship
                  type.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (wallstreet:Movie { title: 'Wall Street' })&lt;-[:ACTED_IN]-(actor)
RETURN actor.name</code></pre><p>
                  
               </p>
               <p>Returns all actors that <code class="literal">ACTED_IN</code> <span class="strong"><strong>'Wall Street'</strong></span>.
               </p>
               <div class="table" id="d0e16139">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.87.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">actor.name</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>3 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Michael Douglas"</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Martin Sheen"</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Charlie Sheen"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (wallstreet:Movie {title: 'Wall Street'})&lt;-[:ACTED_IN]-(actor) RETURN actor.name
                        </strong></span></p>
            </section>
            <section class="section" id="match-on-multiple-rel-types">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-on-multiple-rel-types"></a>Match on multiple relationship types
                        </h5>
                     </div>
                  </div>
               </div>
               <p>To match on one of multiple types, you can specify this by chaining them together with the pipe symbol <code class="literal">|</code>.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (wallstreet { title: 'Wall Street' })&lt;-[:ACTED_IN|:DIRECTED]-(person)
RETURN person.name</code></pre><p>
                  
               </p>
               <p>Returns nodes with an <code class="literal">ACTED_IN</code> or <code class="literal">DIRECTED</code> relationship to <span class="strong"><strong>'Wall Street'</strong></span>.
               </p>
               <div class="table" id="d0e16204">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.88.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">person.name</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>4 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Oliver Stone"</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Michael Douglas"</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Martin Sheen"</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Charlie Sheen"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (wallstreet {title: 'Wall Street'})&lt;-[:ACTED_IN|:DIRECTED]-(person) RETURN person.name
                        </strong></span></p>
            </section>
            <section class="section" id="match-on-rel-type-use-variable">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-on-rel-type-use-variable"></a>Match on relationship type and use a variable
                        </h5>
                     </div>
                  </div>
               </div>
               <p>If you both want to introduce an variable to hold the relationship, and specify the relationship type you want, just add them
                  both, like this:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (wallstreet { title: 'Wall Street' })&lt;-[r:ACTED_IN]-(actor)
RETURN r.role</code></pre><p>
                  
               </p>
               <p>Returns <code class="literal">ACTED_IN</code> roles for <span class="strong"><strong>'Wall Street'</strong></span>.
               </p>
               <div class="table" id="d0e16268">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.89.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">r.role</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>3 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Gordon Gekko"</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Carl Fox"</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Bud Fox"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (wallstreet {title: 'Wall Street'})&lt;-[r:ACTED_IN]-(actor) RETURN r.role
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="relationships-in-depth">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#relationships-in-depth"></a>3.3.1.4.&nbsp;Relationships in depth
                     </h4>
                  </div>
               </div>
            </div>
            <div class="admonitionblock note">
               <table>
                  <tbody>
                     <tr>
                        <td class="icon"><i class="fa icon-note" title="note"></i></td>
                        <td class="content">
                           <p>Inside a single pattern, relationships will only be matched once. You can read more about this in <a class="xref" href="../../introduction/uniqueness/index.html" title="3.1.4.&nbsp;Uniqueness">Section&nbsp;3.1.4, &#8220;Uniqueness&#8221;</a>.
                           </p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <section class="section" id="rel-types-with-uncommon-chars">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#rel-types-with-uncommon-chars"></a>Relationship types with uncommon characters
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Sometimes your database will have types with non-letter characters, or with spaces in them.
                   Use <code class="literal">`</code> (backtick) to quote these.
                   To demonstrate this we can add an additional relationship between <span class="strong"><strong>'Charlie Sheen'</strong></span> and <span class="strong"><strong>'Rob Reiner'</strong></span>:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (charlie:Person { name: 'Charlie Sheen' }),(rob:Person { name: 'Rob Reiner' })
CREATE (rob)-[:`TYPE
WITH SPACE`]-&gt;(charlie)</code></pre><p>
                  
               </p>
               <p>Which leads to the following graph:</p>
               <div class="figure" id="d0e16338">
                  <div class="figure-title">Figure&nbsp;3.7.&nbsp;Graph</div>
                  <div class="figure-contents">
                     <div class="mediaobject"><img src="../../../images/MATCH-1.svg" alt="alt"></img></div>
                  </div>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (charlie:Person {name: 'Charlie Sheen'}), (rob:Person {name: 'Rob Reiner'})
                        CREATE (rob)-[:`TYPE
                        WITH SPACE`]-&gt;(charlie)
                        </strong></span></p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n { name: 'Rob Reiner' })-[r:`TYPE
WITH SPACE`]-&gt;()
RETURN type(r)</code></pre><p>
                  
               </p>
               <p>Returns a relationship type with a space in it</p>
               <div class="table" id="d0e16365">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.90.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">type(r)</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"TYPE
                                    WITH SPACE"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     MATCH (charlie:Person {name: 'Charlie Sheen'}), (rob:Person {name: 'Rob Reiner'})
                     CREATE (rob)-[:`TYPE
                     WITH SPACE`]-&gt;(charlie)
                     </span><span class="command"><strong>
                        MATCH (n {name: 'Rob Reiner'})-[r:`TYPE
                        WITH SPACE`]-&gt;() RETURN type(r)
                        </strong></span></p>
            </section>
            <section class="section" id="multiple-rels">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#multiple-rels"></a>Multiple relationships
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Relationships can be expressed by using multiple statements in the form of <code class="literal">()--()</code>, or they can be strung together, like this:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (charlie { name: 'Charlie Sheen' })-[:ACTED_IN]-&gt;(movie)&lt;-[:DIRECTED]-(director)
RETURN movie.title, director.name</code></pre><p>
                  
               </p>
               <p>Returns the movie <span class="strong"><strong>'Charlie Sheen'</strong></span> acted in and its director.
               </p>
               <div class="table" id="d0e16414">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.91.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">movie.title</th>
                           <th style="text-align: left; vertical-align: top; ">director.name</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Wall Street"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Oliver Stone"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        match (charlie {name: 'Charlie Sheen'})-[:ACTED_IN]-&gt;(movie)&lt;-[:DIRECTED]-(director) RETURN movie.title, director.name
                        </strong></span></p>
            </section>
            <section class="section" id="varlength-rels">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#varlength-rels"></a>Variable length relationships
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Nodes that are a variable number of relationship&#8594;node hops away can be found using the following syntax:
                   <code class="literal">-[:TYPE*minHops..maxHops]&#8594;</code>.
                   <code class="literal">minHops</code> and <code class="literal">maxHops</code> are optional and default to 1 and infinity respectively.
                   When no bounds are given the dots may be omitted.
                   The dots may also be omitted when setting only one bound and this implies a fixed length pattern.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (martin { name: 'Charlie Sheen' })-[:ACTED_IN*1..3]-(movie:Movie)
RETURN movie.title</code></pre><p>
                  
               </p>
               <p>Returns all movies related to <span class="strong"><strong>'Charlie Sheen'</strong></span> by 1 to 3 hops.
               </p>
               <div class="table" id="d0e16476">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.92.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">movie.title</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>3 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Wall Street"</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"The American President"</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"The American President"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        match (martin {name: 'Charlie Sheen'})-[:ACTED_IN*1..3]-(movie:Movie) return movie.title
                        </strong></span></p>
            </section>
            <section class="section" id="rel-variable-in-varlength-rels">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#rel-variable-in-varlength-rels"></a>Relationship variable in variable length relationships
                        </h5>
                     </div>
                  </div>
               </div>
               <p>When the connection between two nodes is of variable length, the list of relationships comprising the connection can be returned
                  using the following syntax:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH p =(actor { name: 'Charlie Sheen' })-[:ACTED_IN*2]-(co_actor)
RETURN relationships(p)</code></pre><p>
                  
               </p>
               <p>Returns a list of relationships.</p>
               <div class="table" id="d0e16529">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.93.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">relationships(p)</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>2 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">[:ACTED_IN[0]{role:"Bud Fox"},:ACTED_IN[1]{role:"Carl Fox"}]</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">[:ACTED_IN[0]{role:"Bud Fox"},:ACTED_IN[2]{role:"Gordon Gekko"}]</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH p = (actor {name: 'Charlie Sheen'})-[:ACTED_IN*2]-(co_actor) RETURN relationships(p)
                        </strong></span></p>
            </section>
            <section class="section" id="match-props-on-varlength-path">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-props-on-varlength-path"></a>Match with properties on a variable length path
                        </h5>
                     </div>
                  </div>
               </div>
               <p>A variable length relationship with properties defined on in it means that all
                  relationships in the path must have the property set to the given value. In this query,
                  there are two paths between <span class="strong"><strong>'Charlie Sheen'</strong></span> and his father <span class="strong"><strong>'Martin Sheen'</strong></span>. One of them includes a
                  <span class="strong"><strong>'blocked'</strong></span> relationship and the other doesn&#8217;t. In this case we first alter the original
                  graph by using the following query to add <code class="literal">BLOCKED</code> and <code class="literal">UNBLOCKED</code> relationships:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (charlie:Person { name: 'Charlie Sheen' }),(martin:Person { name: 'Martin Sheen' })
CREATE (charlie)-[:X { blocked: FALSE }]-&gt;(:UNBLOCKED)&lt;-[:X { blocked: FALSE }]-(martin)
CREATE (charlie)-[:X { blocked: TRUE }]-&gt;(:BLOCKED)&lt;-[:X { blocked: FALSE }]-(martin)</code></pre><p>
                  
               </p>
               <p>This means that we are starting out with the following graph:</p>
               <div class="figure" id="d0e16592">
                  <div class="figure-title">Figure&nbsp;3.8.&nbsp;Graph</div>
                  <div class="figure-contents">
                     <div class="mediaobject"><img src="../../../images/MATCH-2.svg" alt="alt"></img></div>
                  </div>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (charlie:Person {name: 'Charlie Sheen'}), (martin:Person {name: 'Martin Sheen'})
                        CREATE (charlie)-[:X {blocked: false}]-&gt;(:UNBLOCKED)&lt;-[:X {blocked: false}]-(martin)
                        CREATE (charlie)-[:X {blocked: true}]-&gt;(:BLOCKED)&lt;-[:X {blocked: false}]-(martin)
                        </strong></span></p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH p =(charlie:Person)-[* { blocked:false }]-(martin:Person)
WHERE charlie.name = 'Charlie Sheen' AND martin.name = 'Martin Sheen'
RETURN p</code></pre><p>
                  
               </p>
               <p>Returns the paths between <span class="strong"><strong>'Charlie Sheen'</strong></span> and <span class="strong"><strong>'Martin Sheen'</strong></span> where all relationships have the <code class="literal">blocked</code> property set to <code class="literal">false</code>.
               </p>
               <div class="table" id="d0e16631">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.94.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">p</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">(0)-[X,20]-&gt;(20)&lt;-[X,21]-(1)</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     MATCH (charlie:Person {name: 'Charlie Sheen'}), (martin:Person {name: 'Martin Sheen'})
                     CREATE (charlie)-[:X {blocked: false}]-&gt;(:UNBLOCKED)&lt;-[:X {blocked: false}]-(martin)
                     CREATE (charlie)-[:X {blocked: true}]-&gt;(:BLOCKED)&lt;-[:X {blocked: false}]-(martin)
                     </span><span class="command"><strong>
                        MATCH p = (charlie:Person)-[* {blocked:false}]-(martin:Person)
                         WHERE charlie.name = 'Charlie Sheen' AND martin.name = 'Martin Sheen'
                         RETURN p
                        </strong></span></p>
            </section>
            <section class="section" id="zero-length-paths">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#zero-length-paths"></a>Zero length paths
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Using variable length paths that have the lower bound zero means that two variables can point to the same node.
                  If the path length between two nodes is zero, they are by definition the same node.
                  Note that when matching zero length paths the result may contain a match even when matching on a relationship type not in
                  use.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (wallstreet:Movie { title: 'Wall Street' })-[*0..1]-(x)
RETURN x</code></pre><p>
                  
               </p>
               <p>Returns the movie itself as well as actors and directors one relationship away</p>
               <div class="table" id="d0e16674">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.95.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">x</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>5 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[5]{title:"Wall Street"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[0]{name:"Charlie Sheen"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[1]{name:"Martin Sheen"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[2]{name:"Michael Douglas"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[3]{name:"Oliver Stone"}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (wallstreet:Movie {title: 'Wall Street'})-[*0..1]-(x) RETURN x
                        </strong></span></p>
            </section>
            <section class="section" id="named-paths">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#named-paths"></a>Named paths
                        </h5>
                     </div>
                  </div>
               </div>
               <p>If you want to return or filter on a path in your pattern graph, you can a introduce a named path.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH p =(michael { name: 'Michael Douglas' })--&gt;()
RETURN p</code></pre><p>
                  
               </p>
               <p>Returns the two paths starting from <span class="strong"><strong>'Michael Douglas'</strong></span></p>
               <div class="table" id="d0e16739">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.96.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">p</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>2 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">(2)-[ACTED_IN,5]-&gt;(6)</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">(2)-[ACTED_IN,2]-&gt;(5)</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH p = (michael {name: 'Michael Douglas'})--&gt;() RETURN p
                        </strong></span></p>
            </section>
            <section class="section" id="match-on-bound-rel">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-on-bound-rel"></a>Matching on a bound relationship
                        </h5>
                     </div>
                  </div>
               </div>
               <p>When your pattern contains a bound relationship, and that relationship pattern doesn&#8217;t
                   specify direction, Cypher will try to match the relationship in both directions.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a)-[r]-(b)
WHERE id(r)= 0
RETURN a,b</code></pre><p>
                  
               </p>
               <p>This returns the two connected nodes, once as the start node, and once as the end node</p>
               <div class="table" id="d0e16787">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.97.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">a</th>
                           <th style="text-align: left; vertical-align: top; ">b</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>2 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[0]{name:"Charlie Sheen"}</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[5]{title:"Wall Street"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[5]{title:"Wall Street"}</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[0]{name:"Charlie Sheen"}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (a)-[r]-(b) WHERE id(r)= 0 RETURN a,b
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="query-shortest-path">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-shortest-path"></a>3.3.1.5.&nbsp;Shortest path
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="single-shortest-path">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#single-shortest-path"></a>Single shortest path
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Finding a single shortest path between two nodes is as easy as using the <code class="literal">shortestPath</code> function. It&#8217;s done like this:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (martin:Person { name: 'Martin Sheen' }),(oliver:Person { name: 'Oliver Stone' }), p = shortestPath((martin)-[*..15]-(oliver))
RETURN p</code></pre><p>
                  
               </p>
               <p>This means: find a single shortest path between two nodes, as long as the path is max 15 relationships long.
                  Within the parentheses you define a single link of a path&#8201;&#8212;&#8201;the starting node, the connecting relationship
                  and the end node. Characteristics describing the relationship like relationship type, max hops and direction
                  are all used when finding the shortest path. If there is a <code class="literal">WHERE</code> clause following the match of a
                  <code class="literal">shortestPath</code>, relevant predicates will be included in the <code class="literal">shortestPath</code>.
                  If the predicate is a <code class="literal">none()</code> or <code class="literal">all()</code> on the relationship elements of the path,
                  it will be used during the search to improve performance (see <a class="xref" href="../../execution-plans/shortestpath-planning/index.html" title="3.7.5.&nbsp;Shortest path planning">Section&nbsp;3.7.5, &#8220;Shortest path planning&#8221;</a>).
               </p>
               <div class="table" id="d0e16869">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.98.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">p</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">(1)-[ACTED_IN,1]-&gt;(5)&lt;-[DIRECTED,3]-(3)</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (martin:Person {name: 'Martin Sheen'}),
                              (oliver:Person {name: 'Oliver Stone'}),
                              p = shortestPath((martin)-[*..15]-(oliver))
                        RETURN p
                        </strong></span></p>
            </section>
            <section class="section" id="single-shortest-path-with-predicates">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#single-shortest-path-with-predicates"></a>Single shortest path with predicates
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Predicates used in the <code class="literal">WHERE</code> clause that apply to the shortest path pattern are evaluated before deciding
                  what the shortest matching path is.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (charlie:Person { name: 'Charlie Sheen' }),(martin:Person { name: 'Martin Sheen' }), p = shortestPath((charlie)-[*]-(martin))
WHERE NONE (r IN relationships(p) WHERE type(r)= 'FATHER')
RETURN p</code></pre><p>
                  
               </p>
               <p>This query will find the shortest path between <span class="strong"><strong>'Charlie Sheen'</strong></span> and <span class="strong"><strong>'Martin Sheen'</strong></span>, and the <code class="literal">WHERE</code> predicate
                  will ensure that we don&#8217;t consider the father/son relationship between the two.
               </p>
               <div class="table" id="d0e16924">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.99.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">p</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">(0)-[ACTED_IN,0]-&gt;(5)&lt;-[ACTED_IN,1]-(1)</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (charlie:Person {name: 'Charlie Sheen'}),
                              (martin:Person {name: 'Martin Sheen'}),
                              p = shortestPath( (charlie)-[*]-(martin) )
                        WHERE none(r in relationships(p) WHERE type(r) = 'FATHER')
                        RETURN p
                        </strong></span></p>
            </section>
            <section class="section" id="all-shortest-paths">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#all-shortest-paths"></a>All shortest paths
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Finds all the shortest paths between two nodes.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (martin:Person { name: 'Martin Sheen' }),(michael:Person { name: 'Michael Douglas' }), p = allShortestPaths((martin)-[*]-(michael))
RETURN p</code></pre><p>
                  
               </p>
               <p>Finds the two shortest paths between <span class="strong"><strong>'Martin Sheen'</strong></span> and <span class="strong"><strong>'Michael Douglas'</strong></span>.
               </p>
               <div class="table" id="d0e16973">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.100.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">p</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>2 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">(1)-[ACTED_IN,1]-&gt;(5)&lt;-[ACTED_IN,2]-(2)</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">(1)-[ACTED_IN,4]-&gt;(6)&lt;-[ACTED_IN,5]-(2)</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (martin:Person {name: 'Martin Sheen'} ),
                              (michael:Person {name: 'Michael Douglas'}),
                              p = allShortestPaths((martin)-[*]-(michael))
                        RETURN p
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="get-node-rel-by-id">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#get-node-rel-by-id"></a>3.3.1.6.&nbsp;Get node or relationship by id
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="match-node-by-id">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-node-by-id"></a>Node by id
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Searching for nodes by id can be done with the <code class="literal">id()</code> function in a predicate.
               </p>
               <div class="admonitionblock note">
                  <table>
                     <tbody>
                        <tr>
                           <td class="icon"><i class="fa icon-note" title="note"></i></td>
                           <td class="content">
                              <p>Neo4j reuses its internal ids when nodes and relationships are deleted.
                                 This means that applications using, and relying on internal Neo4j ids, are brittle or at risk of making mistakes.
                                 It is therefore recommended to rather use application-generated ids.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE id(n)= 0
RETURN n</code></pre><p>
                  
               </p>
               <p>The corresponding node is returned.</p>
               <div class="table" id="d0e17030">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.101.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[0]{name:"Charlie Sheen"}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (n) WHERE id(n) = 0 RETURN n
                        </strong></span></p>
            </section>
            <section class="section" id="match-rel-by-id">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-rel-by-id"></a>Relationship by id
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Search for relationships by id can be done with the <code class="literal">id()</code> function in a predicate.
               </p>
               <p>This is not recommended practice. See <a class="xref" href="index.html#match-node-by-id" title="Node by id">the section called &#8220;Node by id&#8221;</a> for more information on the use of Neo4j ids.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH ()-[r]-&gt;()
WHERE id(r)= 0
RETURN r</code></pre><p>
                  
               </p>
               <p>The relationship with id <code class="literal">0</code> is returned.
               </p>
               <div class="table" id="d0e17083">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.102.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">r</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">:ACTED_IN[0]{role:"Bud Fox"}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH ()-[r]-&gt;() WHERE id(r) = 0 RETURN r
                        </strong></span></p>
            </section>
            <section class="section" id="match-multiple-nodes-by-id">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-multiple-nodes-by-id"></a>Multiple nodes by id
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Multiple nodes are selected by specifying them in an IN clause.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE id(n) IN [0, 3, 5]
RETURN n</code></pre><p>
                  
               </p>
               <p>This returns the nodes listed in the <code class="literal">IN</code> expression.
               </p>
               <div class="table" id="d0e17129">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.103.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>3 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[0]{name:"Charlie Sheen"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[3]{name:"Oliver Stone"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[5]{title:"Wall Street"}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                     
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                     
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     
                     </span><span class="command"><strong>
                        MATCH (n) WHERE id(n) IN [0, 3, 5] RETURN n
                        </strong></span></p>
            </section>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>