
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.3.9.&nbsp;SKIP - 3.3.&nbsp;Clauses</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="SKIP defines from which row to start including the rows in the output."></meta>
      <link rel="prev" href="../order-by/index.html" title="3.3.8.&nbsp;ORDER BY"></link>
      <link rel="next" href="../limit/index.html" title="3.3.10.&nbsp;LIMIT"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../order-by/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>ORDER BY</a></span><span class="nav-current">
               <p class="nav-title hidden">3.3.9.&nbsp;SKIP</p></span><span class="nav-next"><a accesskey="n" href="../limit/index.html">LIMIT<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-skip">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-skip"></a>3.3.9.&nbsp;SKIP
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p><code class="literal">SKIP</code> defines from which row to start including the rows in the output.
            </p>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#skip-introduction" title="3.3.9.1.&nbsp;Introduction">Introduction</a></li>
               <li class="listitem"><a class="link" href="index.html#skip-first-three-rows" title="3.3.9.2.&nbsp;Skip first three rows">Skip first three rows</a></li>
               <li class="listitem"><a class="link" href="index.html#skip-return-middle-rows" title="3.3.9.3.&nbsp;Return middle two rows">Return middle two rows</a></li>
               <li class="listitem"><a class="link" href="index.html#skip-using-expression" title="3.3.9.4.&nbsp;Using an expression with SKIP to return a subset of the rows">Using an expression with <code class="literal">SKIP</code> to return a subset of the rows</a></li>
            </ul>
         </div>
         <section class="section" id="skip-introduction">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#skip-introduction"></a>3.3.9.1.&nbsp;Introduction
                     </h4>
                  </div>
               </div>
            </div>
            <p>By using <code class="literal">SKIP</code>, the result set will get trimmed from the top.
               Please note that no guarantees are made on the order of the result unless the query specifies the <code class="literal">ORDER BY</code> clause.
               <code class="literal">SKIP</code> accepts any expression that evaluates to a positive integer&#8201;&#8212;&#8201;however the expression cannot refer to nodes or relationships.
            </p>
            <div class="figure" id="d0e21033">
               <div class="figure-title">Figure&nbsp;3.14.&nbsp;Graph</div>
               <div class="figure-contents">
                  <div class="mediaobject"><img src="../../../images/SKIP-1.svg" alt="alt"></img></div>
               </div>
            </div>
         </section>
         <section class="section" id="skip-first-three-rows">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#skip-first-three-rows"></a>3.3.9.2.&nbsp;Skip first three rows
                     </h4>
                  </div>
               </div>
            </div>
            <p>To return a subset of the result, starting from the fourth result, use the following syntax:</p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN n.name
ORDER BY n.name
SKIP 3</code></pre><p>
               
            </p>
            <p>The first three nodes are skipped, and only the last two are returned in the result.</p>
            <div class="table" id="d0e21057">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.153.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n.name</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>2 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"D"</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"E"</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a {name: 'A'}),
                         (b {name: 'B'}),
                         (c {name: 'C'}),
                         (d {name: 'D'}),
                         (e {name: 'E'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(d),
                         (a)-[:KNOWS]-&gt;(e)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n)
                     RETURN n.name
                     ORDER BY n.name
                     SKIP 3
                     </strong></span></p>
         </section>
         <section class="section" id="skip-return-middle-rows">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#skip-return-middle-rows"></a>3.3.9.3.&nbsp;Return middle two rows
                     </h4>
                  </div>
               </div>
            </div>
            <p>To return a subset of the result, starting from somewhere in the middle, use this syntax:</p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN n.name
ORDER BY n.name
SKIP 1
LIMIT 2</code></pre><p>
               
            </p>
            <p>Two nodes from the middle are returned.</p>
            <div class="table" id="d0e21105">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.154.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n.name</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>2 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"B"</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"C"</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a {name: 'A'}),
                         (b {name: 'B'}),
                         (c {name: 'C'}),
                         (d {name: 'D'}),
                         (e {name: 'E'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(d),
                         (a)-[:KNOWS]-&gt;(e)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n)
                     RETURN n.name
                     ORDER BY n.name
                     SKIP 1
                     LIMIT 2
                     </strong></span></p>
         </section>
         <section class="section" id="skip-using-expression">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#skip-using-expression"></a>3.3.9.4.&nbsp;Using an expression with <code class="literal">SKIP</code> to return a subset of the rows
                     </h4>
                  </div>
               </div>
            </div>
            <p>Skip accepts any expression that evaluates to a positive integer as long as it is not referring to any external variables:</p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN n.name
ORDER BY n.name
SKIP toInteger(3*rand())+ 1</code></pre><p>
               
            </p>
            <p>The first three nodes are skipped, and only the last two are returned in the result.</p>
            <div class="table" id="d0e21156">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.155.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n.name</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>4 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"B"</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"C"</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"D"</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"E"</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a {name: 'A'}),
                         (b {name: 'B'}),
                         (c {name: 'C'}),
                         (d {name: 'D'}),
                         (e {name: 'E'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(d),
                         (a)-[:KNOWS]-&gt;(e)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n)
                     RETURN n.name
                     ORDER BY n.name
                     SKIP toInteger(3*rand()) + 1
                     </strong></span></p>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>