
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.6.3.&nbsp;Basic query tuning example - 3.6.&nbsp;Query tuning</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <link rel="prev" href="../how-do-i-profile-a-query/index.html" title="3.6.2.&nbsp;Profiling a query"></link>
      <link rel="next" href="../using/index.html" title="3.6.4.&nbsp;Planner hints and the USING keyword"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../how-do-i-profile-a-query/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Profiling a query</a></span><span class="nav-current">
               <p class="nav-title hidden">3.6.3.&nbsp;Basic query tuning example</p></span><span class="nav-next"><a accesskey="n" href="../using/index.html">Planner hints and the USING keyword<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="cypherdoc-basic-query-tuning-example">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#cypherdoc-basic-query-tuning-example"></a>3.6.3.&nbsp;Basic query tuning example
                  </h3>
               </div>
            </div>
         </div>
         <p>We&#8217;ll start with a basic example to help you get the hang of profiling queries.
            The following examples will use a movies data set.
         </p>
         <p>Let&#8217;s start by importing the data:</p>
         <p class="setup-query"></p><pre class="programlisting highlight"><code data-lang="cypher">LOAD CSV WITH HEADERS FROM 'https://neo4j.com/docs/developer-manual/3.4/csv/query-tuning/movies.csv' AS line
MERGE (m:Movie { title: line.title })
ON CREATE SET m.released = toInteger(line.released), m.tagline = line.tagline</code></pre><p class="setup-query"></p><pre class="programlisting highlight"><code data-lang="cypher">LOAD CSV WITH HEADERS FROM 'https://neo4j.com/docs/developer-manual/3.4/csv/query-tuning/actors.csv' AS line
MATCH (m:Movie { title: line.title })
MERGE (p:Person { name: line.name })
ON CREATE SET p.born = toInteger(line.born)
MERGE (p)-[:ACTED_IN { roles:split(line.roles, ';')}]-&gt;(m)</code></pre><p class="setup-query"></p><pre class="programlisting highlight"><code data-lang="cypher">LOAD CSV WITH HEADERS FROM 'https://neo4j.com/docs/developer-manual/3.4/csv/query-tuning/directors.csv' AS line
MATCH (m:Movie { title: line.title })
MERGE (p:Person { name: line.name })
ON CREATE SET p.born = toInteger(line.born)
MERGE (p)-[:DIRECTED]-&gt;(m)</code></pre><p>Let&#8217;s say we want to write a query to find <span class="strong"><strong>'Tom Hanks'</strong></span>.
            The naive way of doing this would be to write the following:
         </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (p { name: 'Tom Hanks' })
RETURN p</code></pre><p>This query will find the <span class="strong"><strong>'Tom Hanks'</strong></span> node but as the number of nodes in the database increase it will become slower and slower.
            We can profile the query to find out why that is.
         </p>
         <p>You can learn more about the options for profiling queries in <a class="xref" href="../how-do-i-profile-a-query/index.html" title="3.6.2.&nbsp;Profiling a query">Section&nbsp;3.6.2, &#8220;Profiling a query&#8221;</a> but in this case we&#8217;re going to prefix our query with <code class="literal">PROFILE</code>:
         </p><pre class="programlisting highlight"><code data-lang="cypher">PROFILE
MATCH (p { name: 'Tom Hanks' })
RETURN p</code></pre><pre class="screen highlight"><code>Compiler CYPHER 3.4

Planner COST

Runtime INTERPRETED

Runtime version 3.4

+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------------------+
| Operator        | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Variables | Other                     |
+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------------------+
| +ProduceResults |             16 |    1 |       0 |               0 |                 0 |               0.0000 | p         |                           |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------------------+
| +Filter         |             16 |    1 |     163 |               0 |                 0 |               0.0000 | p         | p.name = $`  AUTOSTRING0` |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------------------+
| +AllNodesScan   |            163 |  163 |     164 |               0 |                 0 |               0.0000 | p         |                           |
+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------------------+

Total database accesses: 327</code></pre><p>The first thing to keep in mind when reading execution plans is that you need to read from the bottom up.</p>
         <p>In that vein, starting from the last row, the first thing we notice is that the value in the <code class="literal">Rows</code> column seems high given there is only one node with the name property <span class="strong"><strong>'Tom Hanks'</strong></span> in the database.
            If we look across to the <code class="literal">Operator</code> column we&#8217;ll see that <a class="link" href="../../execution-plans/operators/index.html#query-plan-all-nodes-scan" title="3.7.4.1.&nbsp;All Nodes Scan">AllNodesScan</a> has been used which means that the query planner scanned through all the nodes in the database.
         </p>
         <p>This seems like an inefficient way of finding <span class="strong"><strong>'Tom Hanks'</strong></span> given that we are looking at many nodes that aren&#8217;t even people and therefore aren&#8217;t what we&#8217;re looking for.
         </p>
         <p>The solution to this problem is that whenever we&#8217;re looking for a node we should specify a label to help the query planner
            narrow down the search space.
            For this query we&#8217;d need to add a <code class="literal">Person</code> label.
         </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (p:Person { name: 'Tom Hanks' })
RETURN p</code></pre><p>This query will be faster than the first one but as the number of people in our database increase we again notice that the
            query slows down.
         </p>
         <p>Again we can profile the query to work out why:</p><pre class="programlisting highlight"><code data-lang="cypher">PROFILE
MATCH (p:Person { name: 'Tom Hanks' })
RETURN p</code></pre><pre class="screen highlight"><code>Compiler CYPHER 3.4

Planner COST

Runtime INTERPRETED

Runtime version 3.4

+------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------------------+
| Operator         | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Variables | Other                     |
+------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------------------+
| +ProduceResults  |             13 |    1 |       0 |               0 |                 0 |               0.0000 | p         |                           |
| |                +----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------------------+
| +Filter          |             13 |    1 |     125 |               0 |                 0 |               0.0000 | p         | p.name = $`  AUTOSTRING0` |
| |                +----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------------------+
| +NodeByLabelScan |            125 |  125 |     126 |               0 |                 0 |               0.0000 | p         | :Person                   |
+------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------------------+

Total database accesses: 251</code></pre><p>This time the <code class="literal">Rows</code> value on the last row has reduced so we&#8217;re not scanning some nodes that we were before which is a good start.
            The <a class="link" href="../../execution-plans/operators/index.html#query-plan-node-by-label-scan" title="3.7.4.4.&nbsp;Node By Label Scan">NodeByLabelScan</a> operator indicates that we achieved this by first doing a linear scan of all the <code class="literal">Person</code> nodes in the database.
         </p>
         <p>Once we&#8217;ve done that we again scan through all those nodes using the <code class="literal">Filter</code> operator, comparing the name property of each one.
         </p>
         <p>This might be acceptable in some cases but if we&#8217;re going to be looking up people by name frequently then we&#8217;ll see better
            performance if we create an index on the <code class="literal">name</code> property for the <code class="literal">Person</code> label:
         </p><pre class="programlisting highlight"><code data-lang="cypher">CREATE INDEX ON :Person(name)</code></pre><p>Now if we run the query again it will run more quickly:</p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (p:Person { name: 'Tom Hanks' })
RETURN p</code></pre><p>Let&#8217;s profile the query to see why that is:</p><pre class="programlisting highlight"><code data-lang="cypher">PROFILE
MATCH (p:Person { name: 'Tom Hanks' })
RETURN p</code></pre><pre class="screen highlight"><code>Compiler CYPHER 3.4

Planner COST

Runtime INTERPRETED

Runtime version 3.4

+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------+
| Operator        | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Variables | Other         |
+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------+
| +ProduceResults |              1 |    1 |       0 |               0 |                 0 |               0.0000 | p         |               |
| |               +----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------+
| +NodeIndexSeek  |              1 |    1 |       2 |               0 |                 0 |               0.0000 | p         | :Person(name) |
+-----------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------+---------------+

Total database accesses: 2</code></pre><p>Our execution plan is down to a single row and uses the <a class="link" href="../../execution-plans/operators/index.html#query-plan-node-index-seek" title="3.7.4.5.&nbsp;Node Index Seek">Node Index Seek</a> operator which does a schema index seek (see <a class="xref" href="../../schema/index/index.html" title="3.5.1.&nbsp;Indexes">Section&nbsp;3.5.1, &#8220;Indexes&#8221;</a>) to find the appropriate node.
         </p>
         <p class="cypherdoc-console"></p>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>