
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.3.8.&nbsp;ORDER BY - 3.3.&nbsp;Clauses</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="ORDER BY is a sub-clause following RETURN or WITH, and it specifies that the output should be sorted and how."></meta>
      <link rel="prev" href="../where/index.html" title="3.3.7.&nbsp;WHERE"></link>
      <link rel="next" href="../skip/index.html" title="3.3.9.&nbsp;SKIP"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../where/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>WHERE</a></span><span class="nav-current">
               <p class="nav-title hidden">3.3.8.&nbsp;ORDER BY</p></span><span class="nav-next"><a accesskey="n" href="../skip/index.html">SKIP<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-order">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-order"></a>3.3.8.&nbsp;ORDER BY
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p><code class="literal">ORDER BY</code> is a sub-clause following <code class="literal">RETURN</code> or <code class="literal">WITH</code>, and it specifies that the output should be sorted and how.
            </p>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#order-introduction" title="3.3.8.1.&nbsp;Introduction">Introduction</a></li>
               <li class="listitem"><a class="link" href="index.html#order-nodes-by-property" title="3.3.8.2.&nbsp;Order nodes by property">Order nodes by property</a></li>
               <li class="listitem"><a class="link" href="index.html#order-nodes-by-multiple-properties" title="3.3.8.3.&nbsp;Order nodes by multiple properties">Order nodes by multiple properties</a></li>
               <li class="listitem"><a class="link" href="index.html#order-nodes-in-descending-order" title="3.3.8.4.&nbsp;Order nodes in descending order">Order nodes in descending order</a></li>
               <li class="listitem"><a class="link" href="index.html#order-null" title="3.3.8.5.&nbsp;Ordering null">Ordering <code class="literal">null</code></a></li>
            </ul>
         </div>
         <section class="section" id="order-introduction">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#order-introduction"></a>3.3.8.1.&nbsp;Introduction
                     </h4>
                  </div>
               </div>
            </div>
            <p>Note that you cannot sort on nodes or relationships, just on properties on these.
               <code class="literal">ORDER BY</code> relies on comparisons to sort the output, see <a class="xref" href="../../syntax/operators/index.html#cypher-ordering" title="3.2.7.12.&nbsp;Ordering and comparison of values">Section&nbsp;3.2.7.12, &#8220;Ordering and comparison of values&#8221;</a>.
            </p>
            <p>In terms of scope of variables, <code class="literal">ORDER BY</code> follows special rules, depending on if the projecting <code class="literal">RETURN</code> or <code class="literal">WITH</code> clause is either aggregating or <code class="literal">DISTINCT</code>.
                          If it is an aggregating or <code class="literal">DISTINCT</code> projection, only the variables available in the projection are available.
                          If the projection does not alter the output cardinality (which aggregation and <code class="literal">DISTINCT</code> do), variables available from before the projecting clause are also available.
                          When the projection clause shadows already existing variables, only the new variables are available.
            </p>
            <p>Lastly, it is not allowed to use aggregating expressions in the <code class="literal">ORDER BY</code> sub-clause if they are not also listed in the projecting clause.
                          This last rule is to make sure that <code class="literal">ORDER BY</code> does not change the results, only the order of them.
            </p>
            <div class="figure" id="d0e20679">
               <div class="figure-title">Figure&nbsp;3.13.&nbsp;Graph</div>
               <div class="figure-contents">
                  <div class="mediaobject"><img src="../../../images/ORDER&#32;BY-1.svg" alt="alt"></img></div>
               </div>
            </div>
         </section>
         <section class="section" id="order-nodes-by-property">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#order-nodes-by-property"></a>3.3.8.2.&nbsp;Order nodes by property
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">ORDER BY</code> is used to sort the output.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN n.name, n.age
ORDER BY n.name</code></pre><p>
               
            </p>
            <p>The nodes are returned, sorted by their name.</p>
            <div class="table" id="d0e20705">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.149.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n.name</th>
                        <th style="text-align: left; vertical-align: top; ">n.age</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="2">
                           <p>3 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"A"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">34</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"B"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">34</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"C"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">32</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', age: 34, length: 170}),
                         (b {name: 'B', age: 34}),
                         (c {name: 'C', age: 32, length: 185}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (b)-[:KNOWS]-&gt;(c)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n)
                     RETURN n.name, n.age
                     ORDER BY n.name
                     </strong></span></p>
         </section>
         <section class="section" id="order-nodes-by-multiple-properties">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#order-nodes-by-multiple-properties"></a>3.3.8.3.&nbsp;Order nodes by multiple properties
                     </h4>
                  </div>
               </div>
            </div>
            <p>You can order by multiple properties by stating each variable in the <code class="literal">ORDER BY</code> clause.
               Cypher will sort the result by the first variable listed, and for equals values, go to the next property in the <code class="literal">ORDER BY</code> clause, and so on.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN n.name, n.age
ORDER BY n.age, n.name</code></pre><p>
               
            </p>
            <p>This returns the nodes, sorted first by their age, and then by their name.</p>
            <div class="table" id="d0e20779">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.150.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n.name</th>
                        <th style="text-align: left; vertical-align: top; ">n.age</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="2">
                           <p>3 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"C"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">32</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"A"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">34</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"B"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">34</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', age: 34, length: 170}),
                         (b {name: 'B', age: 34}),
                         (c {name: 'C', age: 32, length: 185}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (b)-[:KNOWS]-&gt;(c)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n)
                     RETURN n.name, n.age
                     ORDER BY n.age, n.name
                     </strong></span></p>
         </section>
         <section class="section" id="order-nodes-in-descending-order">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#order-nodes-in-descending-order"></a>3.3.8.4.&nbsp;Order nodes in descending order
                     </h4>
                  </div>
               </div>
            </div>
            <p>By adding <code class="literal">DESC[ENDING]</code> after the variable to sort on, the sort will be done in reverse order.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN n.name, n.age
ORDER BY n.name DESC</code></pre><p>
               
            </p>
            <p>The example returns the nodes, sorted by their name in reverse order.</p>
            <div class="table" id="d0e20850">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.151.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n.name</th>
                        <th style="text-align: left; vertical-align: top; ">n.age</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="2">
                           <p>3 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"C"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">32</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"B"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">34</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"A"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">34</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', age: 34, length: 170}),
                         (b {name: 'B', age: 34}),
                         (c {name: 'C', age: 32, length: 185}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (b)-[:KNOWS]-&gt;(c)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n)
                     RETURN n.name, n.age
                     ORDER BY n.name DESC
                     </strong></span></p>
         </section>
         <section class="section" id="order-null">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#order-null"></a>3.3.8.5.&nbsp;Ordering <code class="literal">null</code></h4>
                  </div>
               </div>
            </div>
            <p>When sorting the result set, <code class="literal">null</code> will always come at the end of the result set for ascending sorting, and first when doing descending sort.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN n.length, n.name, n.age
ORDER BY n.length</code></pre><p>
               
            </p>
            <p>The nodes are returned sorted by the length property, with a node without that property last.</p>
            <div class="table" id="d0e20923">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.152.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                     <col class="col_3"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n.length</th>
                        <th style="text-align: left; vertical-align: top; ">n.name</th>
                        <th style="text-align: left; vertical-align: top; ">n.age</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="3">
                           <p>3 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">170</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"A"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">34</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">185</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"C"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">32</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">&lt;null&gt;</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"B"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">34</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', age: 34, length: 170}),
                         (b {name: 'B', age: 34}),
                         (c {name: 'C', age: 32, length: 185}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (b)-[:KNOWS]-&gt;(c)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n)
                     RETURN n.length, n.name, n.age
                     ORDER BY n.length
                     </strong></span></p>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>