
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.4.3.&nbsp;Aggregating functions - 3.4.&nbsp;Functions</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <link rel="prev" href="../scalar/index.html" title="3.4.2.&nbsp;Scalar functions"></link>
      <link rel="next" href="../list/index.html" title="3.4.4.&nbsp;List functions"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../scalar/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Scalar functions</a></span><span class="nav-current">
               <p class="nav-title hidden">3.4.3.&nbsp;Aggregating functions</p></span><span class="nav-next"><a accesskey="n" href="../list/index.html">List functions<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-functions-aggregating">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-functions-aggregating"></a>3.4.3.&nbsp;Aggregating functions
                  </h3>
               </div>
            </div>
         </div>
         <p>To calculate aggregated data, Cypher offers aggregation, analogous to SQL&#8217;s <code class="literal">GROUP BY</code>.
         </p>
         <p>Aggregating functions take a set of values and calculate an aggregated value over them.
            Examples are <code class="literal">avg()</code> that calculates the average of multiple numeric values, or <code class="literal">min()</code> that finds the smallest numeric or string value in a set of values.
            When we say below that an aggregating function operates on a <span class="emphasis"><em>set of values</em></span>, we mean these to be the result of the application of the inner expression (such as <code class="literal">n.age</code>) to all the records within the same aggregation group.
         </p>
         <p>Aggregation can be computed over all the matching subgraphs, or it can be further divided by introducing grouping keys.
            These are non-aggregate expressions, that are used to group the values going into the aggregate functions.
         </p>
         <p>Assume we have the following return statement:</p><pre class="programlisting highlight"><code data-lang="cypher">RETURN n, count(*)</code></pre><p>We have two return expressions: <code class="literal">n</code>, and <code class="literal">count(*)</code>.
            The first, <code class="literal">n</code>, is not an aggregate function, and so it will be the grouping key.
            The latter, <code class="literal">count(*)</code> is an aggregate expression.
            The matching subgraphs will be divided into different buckets, depending on the grouping key.
            The aggregate function will then be run on these buckets, calculating an aggregate value per bucket.
         </p>
         <p>To use aggregations to sort the result set, the aggregation must be included in the <code class="literal">RETURN</code> to be used in the <code class="literal">ORDER BY</code>.
         </p>
         <p>The <code class="literal">DISTINCT</code> operator works in conjunction with aggregation.
            It is used to make all values unique before running them through an aggregate function.
            More information about <code class="literal">DISTINCT</code> may be found <a class="link" href="../../syntax/operators/index.html#query-operators-aggregation" title="3.2.7.2.&nbsp;Aggregation operators">here</a>.
         </p>
         <p>Functions:</p>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#functions-avg" title="3.4.3.1.&nbsp;avg()">avg()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-collect" title="3.4.3.2.&nbsp;collect()">collect()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-count" title="3.4.3.3.&nbsp;count()">count()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-max" title="3.4.3.4.&nbsp;max()">max()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-min" title="3.4.3.5.&nbsp;min()">min()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-percentilecont" title="3.4.3.6.&nbsp;percentileCont()">percentileCont()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-percentiledisc" title="3.4.3.7.&nbsp;percentileDisc()">percentileDisc()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-stdev" title="3.4.3.8.&nbsp;stDev()">stDev()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-stdevp" title="3.4.3.9.&nbsp;stDevP()">stDevP()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-sum" title="3.4.3.10.&nbsp;sum()">sum()</a></li>
            </ul>
         </div>
         <p>The following graph is used for the examples below:</p>
         <div class="figure" id="d0e31170">
            <div class="figure-title">Figure&nbsp;3.24.&nbsp;Graph</div>
            <div class="figure-contents">
               <div class="mediaobject"><img src="../../../images/Aggregating&#32;functions-1.svg" alt="alt"></img></div>
            </div>
         </div>
         <section class="section" id="functions-avg">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-avg"></a>3.4.3.1.&nbsp;avg()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">avg()</code> returns the average of a set of numeric values.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">avg(expression)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31195">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Either an Integer or a Float, depending on the values returned by <code class="literal">expression</code> and whether or not the calculation overflows.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31209">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression returning a set of numeric values.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31231">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Any <code class="literal">null</code> values are excluded from the calculation.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">avg(null)</code> returns <code class="literal">null</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n:Person)
RETURN avg(n.age)</code></pre><p>
               
            </p>
            <p>The average of all the values in the property <code class="literal">age</code> is returned.
            </p>
            <div class="table" id="d0e31264">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.234.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">avg(n.age)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">30.0</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     MATCH (n:Person) RETURN avg(n.age)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-collect">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-collect"></a>3.4.3.2.&nbsp;collect()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">collect()</code> returns a list containing the values returned by an expression.
               Using this function aggregates data by amalgamating multiple records or values into a single list.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">collect(expression)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31308">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A list containing heterogeneous elements; the types of the elements are determined by the values returned by <code class="literal">expression</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31322">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression returning a set of values.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31344">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Any <code class="literal">null</code> values are ignored and will not be added to the list.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">collect(null)</code> returns an empty list.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n:Person)
RETURN collect(n.age)</code></pre><p>
               
            </p>
            <p>All the values are collected and returned in a single list.</p>
            <div class="table" id="d0e31371">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.235.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">collect(n.age)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">[13,33,44]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     MATCH (n:Person) RETURN collect(n.age)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-count">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-count"></a>3.4.3.3.&nbsp;count()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">count()</code> returns the number of values or rows, and appears in two variants:
            </p>
            <div class="itemizedlist">
               <ul class="itemizedlist" style="list-style-type: disc; ">
                  <li class="listitem"><code class="literal">count(*)</code> returns the number of matching rows, and
                  </li>
                  <li class="listitem"><code class="literal">count(expr)</code> returns the number of non-<code class="literal">null</code> values returned by an expression.
                  </li>
               </ul>
            </div>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">count(expression)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31429">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An Integer.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31440">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31462">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">count(*)</code> includes rows returning <code class="literal">null</code>.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">count(expr)</code> ignores <code class="literal">null</code> values.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">count(null)</code> returns <code class="literal">0</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <section class="section" id="_using_literal_count_literal_to_return_the_number_of_nodes">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#_using_literal_count_literal_to_return_the_number_of_nodes"></a>Using <code class="literal">count(*)</code> to return the number of nodes
                        </h5>
                     </div>
                  </div>
               </div>
               <p><code class="literal">count(*)</code> can be used to return the number of nodes; for example, the number of nodes connected to some node <code class="literal">n</code>.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n { name: 'A' })--&gt;(x)
RETURN labels(n), n.age, count(*)</code></pre><p>
                  
               </p>
               <p>The labels and <code class="literal">age</code> property of the start node <code class="literal">n</code> and the number of nodes related to <code class="literal">n</code> are returned.
               </p>
               <div class="table" id="d0e31525">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.236.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">labels(n)</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                           <th style="text-align: left; vertical-align: top; ">count(*)</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">["Person"]</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">13</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">3</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (a:Person {name: 'A', age: 13}),
                            (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                            (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                            (d1:Person {name: 'D', eyes: 'brown'}),
                            (d2:Person {name: 'D'}),
                     
                            (a)-[:KNOWS]-&gt;(d1),
                            (a)-[:KNOWS]-&gt;(c),
                            (a)-[:KNOWS]-&gt;(b),
                            (c)-[:KNOWS]-&gt;(d2),
                            (b)-[:KNOWS]-&gt;(d2)
                     
                     </span><span class="command"><strong>
                        MATCH (n {name: 'A'})--&gt;(x) RETURN labels(n), n.age, count(*)
                        </strong></span></p>
            </section>
            <section class="section" id="_using_literal_count_literal_to_group_and_count_relationship_types">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#_using_literal_count_literal_to_group_and_count_relationship_types"></a>Using <code class="literal">count(*)</code> to group and count relationship types
                        </h5>
                     </div>
                  </div>
               </div>
               <p><code class="literal">count(*)</code> can be used to group relationship types and return the number.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n { name: 'A' })-[r]-&gt;()
RETURN type(r), count(*)</code></pre><p>
                  
               </p>
               <p>The relationship types and their group count are returned.</p>
               <div class="table" id="d0e31587">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.237.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">type(r)</th>
                           <th style="text-align: left; vertical-align: top; ">count(*)</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"KNOWS"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">3</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (a:Person {name: 'A', age: 13}),
                            (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                            (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                            (d1:Person {name: 'D', eyes: 'brown'}),
                            (d2:Person {name: 'D'}),
                     
                            (a)-[:KNOWS]-&gt;(d1),
                            (a)-[:KNOWS]-&gt;(c),
                            (a)-[:KNOWS]-&gt;(b),
                            (c)-[:KNOWS]-&gt;(d2),
                            (b)-[:KNOWS]-&gt;(d2)
                     
                     </span><span class="command"><strong>
                        MATCH (n {name: 'A'})-[r]-&gt;() RETURN type(r), count(*)
                        </strong></span></p>
            </section>
            <section class="section" id="_using_literal_count_expression_literal_to_return_the_number_of_values">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#_using_literal_count_expression_literal_to_return_the_number_of_values"></a>Using <code class="literal">count(expression)</code> to return the number of values
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Instead of simply returning the number of rows with <code class="literal">count(*)</code>, it may be more useful to return the actual number of values returned by an expression.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n { name: 'A' })--&gt;(x)
RETURN count(x)</code></pre><p>
                  
               </p>
               <p>The number of nodes connected to the start node is returned.</p>
               <div class="table" id="d0e31643">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.238.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">count(x)</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">3</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (a:Person {name: 'A', age: 13}),
                            (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                            (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                            (d1:Person {name: 'D', eyes: 'brown'}),
                            (d2:Person {name: 'D'}),
                     
                            (a)-[:KNOWS]-&gt;(d1),
                            (a)-[:KNOWS]-&gt;(c),
                            (a)-[:KNOWS]-&gt;(b),
                            (c)-[:KNOWS]-&gt;(d2),
                            (b)-[:KNOWS]-&gt;(d2)
                     
                     </span><span class="command"><strong>
                        MATCH (n {name: 'A'})--&gt;(x) RETURN count(x)
                        </strong></span></p>
            </section>
            <section class="section" id="_counting_non_literal_null_literal_values">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#_counting_non_literal_null_literal_values"></a>Counting non-<code class="literal">null</code> values
                        </h5>
                     </div>
                  </div>
               </div>
               <p><code class="literal">count(expression)</code> can be used to return the number of non-<code class="literal">null</code> values returned by the expression.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n:Person)
RETURN count(n.age)</code></pre><p>
                  
               </p>
               <p>The number of <code class="literal">:Person</code> nodes having an <code class="literal">age</code> property is returned.
               </p>
               <div class="table" id="d0e31700">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.239.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">count(n.age)</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">3</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (a:Person {name: 'A', age: 13}),
                            (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                            (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                            (d1:Person {name: 'D', eyes: 'brown'}),
                            (d2:Person {name: 'D'}),
                     
                            (a)-[:KNOWS]-&gt;(d1),
                            (a)-[:KNOWS]-&gt;(c),
                            (a)-[:KNOWS]-&gt;(b),
                            (c)-[:KNOWS]-&gt;(d2),
                            (b)-[:KNOWS]-&gt;(d2)
                     
                     </span><span class="command"><strong>
                        MATCH (n:Person) RETURN count(n.age)
                        </strong></span></p>
            </section>
            <section class="section" id="_counting_with_and_without_duplicates">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#_counting_with_and_without_duplicates"></a>Counting with and without duplicates
                        </h5>
                     </div>
                  </div>
               </div>
               <p>In this example we are trying to find all our friends of friends, and count them:</p>
               <div class="itemizedlist">
                  <ul class="itemizedlist" style="list-style-type: disc; ">
                     <li class="listitem">The first aggregate function, <code class="literal">count(DISTINCT friend_of_friend)</code>, will only count a <code class="literal">friend_of_friend</code> once, as <code class="literal">DISTINCT</code> removes the duplicates.
                     </li>
                     <li class="listitem">The second aggregate function, <code class="literal">count(friend_of_friend)</code>, will consider the same <code class="literal">friend_of_friend</code> multiple times.
                     </li>
                  </ul>
               </div>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (me:Person)--&gt;(friend:Person)--&gt;(friend_of_friend:Person)
WHERE me.name = 'A'
RETURN count(DISTINCT friend_of_friend), count(friend_of_friend)</code></pre><p>
                  
               </p>
               <p>Both <code class="literal">B</code> and <code class="literal">C</code> know <code class="literal">D</code> and thus <code class="literal">D</code> will get counted twice when not using <code class="literal">DISTINCT</code>.
               </p>
               <div class="table" id="d0e31780">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.240.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">count(DISTINCT friend_of_friend)</th>
                           <th style="text-align: left; vertical-align: top; ">count(friend_of_friend)</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">2</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (a:Person {name: 'A', age: 13}),
                            (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                            (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                            (d1:Person {name: 'D', eyes: 'brown'}),
                            (d2:Person {name: 'D'}),
                     
                            (a)-[:KNOWS]-&gt;(d1),
                            (a)-[:KNOWS]-&gt;(c),
                            (a)-[:KNOWS]-&gt;(b),
                            (c)-[:KNOWS]-&gt;(d2),
                            (b)-[:KNOWS]-&gt;(d2)
                     
                     </span><span class="command"><strong>
                        MATCH (me:Person)--&gt;(friend:Person)--&gt;(friend_of_friend:Person)
                        WHERE me.name = 'A'
                        RETURN count(DISTINCT friend_of_friend), count(friend_of_friend)
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="functions-max">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-max"></a>3.4.3.4.&nbsp;max()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">max()</code> returns the maximum value in a set of values.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">max(expression)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31831">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A <a class="link" href="../../syntax/values/index.html#property-types" title="3.2.1.1.&nbsp;Property types">property type</a>, or a list, depending on the values returned by <code class="literal">expression</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31848">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression returning a set containing any combination of <a class="link" href="../../syntax/values/index.html#property-types" title="3.2.1.1.&nbsp;Property types">property types</a> and lists thereof.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e31873">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Any <code class="literal">null</code> values are excluded from the calculation.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>In a mixed set, any numeric value is always considered to be higher than any string value, and any string value is always
                                 considered to be higher than any list.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Lists are compared in dictionary order, i.e. list elements are compared pairwise in ascending order from the start of the
                                 list to the end.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">max(null)</code> returns <code class="literal">null</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">UNWIND [1, 'a', NULL , 0.2, 'b', '1', '99'] AS val
RETURN max(val)</code></pre><p>
               
            </p>
            <p>The highest of all the values in the mixed set&#8201;&#8212;&#8201;in this case, the numeric value <code class="literal">1</code>&#8201;&#8212;&#8201;is returned.
               Note that the (string) value <code class="literal">"99"</code>, which may <span class="emphasis"><em>appear</em></span> at first glance to be the highest value in the list, is considered to be a lower value than <code class="literal">1</code> as the latter is a string.
            </p>
            <div class="table" id="d0e31923">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.241.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">max(val)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">1</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     UNWIND [1, 'a', null, 0.2, 'b', '1', '99'] AS val RETURN max(val)
                     </strong></span></p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">UNWIND [[1, 'a', 89],[1, 2]] AS val
RETURN max(val)</code></pre><p>
               
            </p>
            <p>The highest of all the lists in the set&#8201;&#8212;&#8201;in this case, the list <code class="literal">[1, 2]</code>&#8201;&#8212;&#8201;is returned, as the number <code class="literal">2</code> is considered to be a higher value than the string <code class="literal">"a"</code>, even though the list <code class="literal">[1, 'a', 89]</code> contains more elements.
            </p>
            <div class="table" id="d0e31973">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.242.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">max(val)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">[1,2]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     UNWIND [[1, 'a', 89], [1, 2]] AS val RETURN max(val)
                     </strong></span></p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n:Person)
RETURN max(n.age)</code></pre><p>
               
            </p>
            <p>The highest of all the values in the property <code class="literal">age</code> is returned.
            </p>
            <div class="table" id="d0e32014">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.243.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">max(n.age)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">44</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     MATCH (n:Person) RETURN max(n.age)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-min">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-min"></a>3.4.3.5.&nbsp;min()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">min()</code> returns the minimum value in a set of values.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">min(expression)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32058">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A <a class="link" href="../../syntax/values/index.html#property-types" title="3.2.1.1.&nbsp;Property types">property type</a>, or a list, depending on the values returned by <code class="literal">expression</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32075">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression returning a set containing any combination of <a class="link" href="../../syntax/values/index.html#property-types" title="3.2.1.1.&nbsp;Property types">property types</a> and lists thereof.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32100">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Any <code class="literal">null</code> values are excluded from the calculation.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>In a mixed set, any string value is always considered to be lower than any numeric value, and any list is always considered
                                 to be lower than any string.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Lists are compared in dictionary order, i.e. list elements are compared pairwise in ascending order from the start of the
                                 list to the end.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">min(null)</code> returns <code class="literal">null</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">UNWIND [1, 'a', NULL , 0.2, 'b', '1', '99'] AS val
RETURN min(val)</code></pre><p>
               
            </p>
            <p>The lowest of all the values in the mixed set&#8201;&#8212;&#8201;in this case, the string value <code class="literal">"1"</code>&#8201;&#8212;&#8201;is returned.
               Note that the (numeric) value <code class="literal">0.2</code>, which may <span class="emphasis"><em>appear</em></span> at first glance to be the lowest value in the list, is considered to be a higher value than <code class="literal">"1"</code> as the latter is a string.
            </p>
            <div class="table" id="d0e32150">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.244.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">min(val)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"1"</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     UNWIND [1, 'a', null, 0.2, 'b', '1', '99'] AS val RETURN min(val)
                     </strong></span></p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">UNWIND ['d',[1, 2],['a', 'c', 23]] AS val
RETURN min(val)</code></pre><p>
               
            </p>
            <p>The lowest of all the values in the set&#8201;&#8212;&#8201;in this case, the list <code class="literal">['a', 'c', 23]</code>&#8201;&#8212;&#8201;is returned, as (i) the two lists are considered to be lower values than the string <code class="literal">"d"</code>, and (ii) the string <code class="literal">"a"</code> is considered to be a lower value than the numerical value <code class="literal">1</code>.
            </p>
            <div class="table" id="d0e32200">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.245.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">min(val)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">["a","c",23]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     UNWIND ['d', [1, 2], ['a', 'c', 23]] AS val RETURN min(val)
                     </strong></span></p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n:Person)
RETURN min(n.age)</code></pre><p>
               
            </p>
            <p>The lowest of all the values in the property <code class="literal">age</code> is returned.
            </p>
            <div class="table" id="d0e32241">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.246.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">min(n.age)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">13</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     MATCH (n:Person) RETURN min(n.age)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-percentilecont">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-percentilecont"></a>3.4.3.6.&nbsp;percentileCont()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">percentileCont()</code> returns the percentile of the given value over a group, with a percentile from 0.0 to 1.0.
               It uses a linear interpolation method, calculating a weighted average between two values if the desired percentile lies between
               them.
               For nearest values using a rounding method, see <code class="literal">percentileDisc</code>.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">percentileCont(expression, percentile)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32288">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A Float.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32299">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A numeric expression.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">percentile</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A numeric value between 0.0 and 1.0</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32329">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Any <code class="literal">null</code> values are excluded from the calculation.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">percentileCont(null, percentile)</code> returns <code class="literal">null</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n:Person)
RETURN percentileCont(n.age, 0.4)</code></pre><p>
               
            </p>
            <p>The 40th percentile of the values in the property <code class="literal">age</code> is returned, calculated with a weighted average. In this case, 0.4 is the median, or 40th percentile.
            </p>
            <div class="table" id="d0e32362">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.247.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">percentileCont(n.age, 0.4)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">29.0</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     MATCH (n:Person) RETURN percentileCont(n.age, 0.4)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-percentiledisc">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-percentiledisc"></a>3.4.3.7.&nbsp;percentileDisc()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">percentileDisc()</code> returns the percentile of the given value over a group, with a percentile from 0.0 to 1.0.
               It uses a rounding method and calculates the nearest value to the percentile.
               For interpolated values, see <code class="literal">percentileCont</code>.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">percentileDisc(expression, percentile)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32409">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Either an Integer or a Float, depending on the values returned by <code class="literal">expression</code> and whether or not the calculation overflows.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32423">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A numeric expression.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">percentile</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A numeric value between 0.0 and 1.0</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32453">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Any <code class="literal">null</code> values are excluded from the calculation.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">percentileDisc(null, percentile)</code> returns <code class="literal">null</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n:Person)
RETURN percentileDisc(n.age, 0.5)</code></pre><p>
               
            </p>
            <p>The 50th percentile of the values in the property <code class="literal">age</code> is returned.
            </p>
            <div class="table" id="d0e32486">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.248.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">percentileDisc(n.age, 0.5)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">33</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     MATCH (n:Person) RETURN percentileDisc(n.age, 0.5)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-stdev">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-stdev"></a>3.4.3.8.&nbsp;stDev()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">stDev()</code> returns the standard deviation for the given value over a group.
               It uses a standard two-pass method, with <code class="literal">N - 1</code> as the denominator, and should be used when taking a sample of the population for an unbiased estimate.
               When the standard variation of the entire population is being calculated, <code class="literal">stdDevP</code> should be used.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">stDev(expression)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32536">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A Float.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32547">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A numeric expression.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32569">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Any <code class="literal">null</code> values are excluded from the calculation.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">stDev(null)</code> returns <code class="literal">0</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.name IN ['A', 'B', 'C']
RETURN stDev(n.age)</code></pre><p>
               
            </p>
            <p>The standard deviation of the values in the property <code class="literal">age</code> is returned.
            </p>
            <div class="table" id="d0e32602">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.249.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">stDev(n.age)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">15.716233645501712</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     MATCH (n) WHERE n.name IN ['A', 'B', 'C'] RETURN stDev(n.age)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-stdevp">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-stdevp"></a>3.4.3.9.&nbsp;stDevP()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">stDevP()</code> returns the standard deviation for the given value over a group.
               It uses a standard two-pass method, with <code class="literal">N</code> as the denominator, and should be used when calculating the standard deviation for an entire population.
               When the standard variation of only a sample of the population is being calculated, <code class="literal">stDev</code> should be used.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">stDevP(expression)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32652">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A Float.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32663">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A numeric expression.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32685">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Any <code class="literal">null</code> values are excluded from the calculation.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">stDevP(null)</code> returns <code class="literal">0</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.name IN ['A', 'B', 'C']
RETURN stDevP(n.age)</code></pre><p>
               
            </p>
            <p>The population standard deviation of the values in the property <code class="literal">age</code> is returned.
            </p>
            <div class="table" id="d0e32718">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.250.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">stDevP(n.age)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">12.832251036613439</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     MATCH (n) WHERE n.name IN ['A', 'B', 'C'] RETURN stDevP(n.age)
                     </strong></span></p>
         </section>
         <section class="section" id="functions-sum">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-sum"></a>3.4.3.10.&nbsp;sum()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">sum()</code> returns the sum of a set of numeric values.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">sum(expression)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32762">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Either an Integer or a Float, depending on the values returned by <code class="literal">expression</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32776">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">expression</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression returning a set of numeric values.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Considerations:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e32798">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>Any <code class="literal">null</code> values are excluded from the calculation.
                              </p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">sum(null)</code> returns <code class="literal">0</code>.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n:Person)
RETURN sum(n.age)</code></pre><p>
               
            </p>
            <p>The sum of all the values in the property <code class="literal">age</code> is returned.
            </p>
            <div class="table" id="d0e32831">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.251.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">sum(n.age)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">90</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Person {name: 'A', age: 13}),
                         (b:Person {name: 'B', age: 33, eyes: 'blue'}),
                         (c:Person {name: 'C', age: 44, eyes: 'blue'}),
                         (d1:Person {name: 'D', eyes: 'brown'}),
                         (d2:Person {name: 'D'}),
                  
                         (a)-[:KNOWS]-&gt;(d1),
                         (a)-[:KNOWS]-&gt;(c),
                         (a)-[:KNOWS]-&gt;(b),
                         (c)-[:KNOWS]-&gt;(d2),
                         (b)-[:KNOWS]-&gt;(d2)
                  
                  </span><span class="command"><strong>
                     MATCH (n:Person) RETURN sum(n.age)
                     </strong></span></p>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>