
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.3.7.&nbsp;WHERE - 3.3.&nbsp;Clauses</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="WHERE adds constraints to the patterns in a MATCH or OPTIONAL MATCH clause or filters the results of a WITH clause."></meta>
      <link rel="prev" href="../unwind/index.html" title="3.3.6.&nbsp;UNWIND"></link>
      <link rel="next" href="../order-by/index.html" title="3.3.8.&nbsp;ORDER BY"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../unwind/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>UNWIND</a></span><span class="nav-current">
               <p class="nav-title hidden">3.3.7.&nbsp;WHERE</p></span><span class="nav-next"><a accesskey="n" href="../order-by/index.html">ORDER BY<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-where">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-where"></a>3.3.7.&nbsp;WHERE
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p><code class="literal">WHERE</code> adds constraints to the patterns in a <code class="literal">MATCH</code> or <code class="literal">OPTIONAL MATCH</code> clause or filters the results of a <code class="literal">WITH</code> clause.
            </p>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#where-introduction" title="3.3.7.1.&nbsp;Introduction">Introduction</a></li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-where-basic" title="3.3.7.2.&nbsp;Basic usage">Basic usage</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#boolean-operations" title="Boolean operations">Boolean operations</a></li>
                        <li class="listitem"><a class="link" href="index.html#filter-on-node-label" title="Filter on node label">Filter on node label</a></li>
                        <li class="listitem"><a class="link" href="index.html#filter-on-node-property" title="Filter on node property">Filter on node property</a></li>
                        <li class="listitem"><a class="link" href="index.html#filter-on-relationship-property" title="Filter on relationship property">Filter on relationship property</a></li>
                        <li class="listitem"><a class="link" href="index.html#filter-on-dynamic-property" title="Filter on dynamically-computed node property">Filter on dynamically-computed property</a></li>
                        <li class="listitem"><a class="link" href="index.html#property-existence-checking" title="Property existence checking">Property existence checking</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-where-string" title="3.3.7.3.&nbsp;String matching">String matching</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#match-string-start" title="Prefix string search using STARTS WITH">Prefix string search using <code class="literal">STARTS WITH</code></a></li>
                        <li class="listitem"><a class="link" href="index.html#match-string-end" title="Suffix string search using ENDS WITH">Suffix string search using <code class="literal">ENDS WITH</code></a></li>
                        <li class="listitem"><a class="link" href="index.html#match-string-contains" title="Substring search using CONTAINS">Substring search using <code class="literal">CONTAINS</code></a></li>
                        <li class="listitem"><a class="link" href="index.html#match-string-negation" title="String matching negation">String matching negation</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-where-regex" title="3.3.7.4.&nbsp;Regular expressions">Regular expressions</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#matching-using-regular-expressions" title="Matching using regular expressions">Matching using regular expressions</a></li>
                        <li class="listitem"><a class="link" href="index.html#escaping-in-regular-expressions" title="Escaping in regular expressions">Escaping in regular expressions</a></li>
                        <li class="listitem"><a class="link" href="index.html#case-insensitive-regular-expressions" title="Case-insensitive regular expressions">Case-insensitive regular expressions</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-where-patterns" title="3.3.7.5.&nbsp;Using path patterns in WHERE">Using path patterns in <code class="literal">WHERE</code></a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#filter-on-patterns" title="Filter on patterns">Filter on patterns</a></li>
                        <li class="listitem"><a class="link" href="index.html#filter-on-patterns-using-not" title="Filter on patterns using NOT">Filter on patterns using <code class="literal">NOT</code></a></li>
                        <li class="listitem"><a class="link" href="index.html#filter-on-patterns-with-properties" title="Filter on patterns with properties">Filter on patterns with properties</a></li>
                        <li class="listitem"><a class="link" href="index.html#filter-on-relationship-type" title="Filter on relationship type">Filter on relationship type</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-where-lists" title="3.3.7.6.&nbsp;Lists">Lists</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#where-in-operator" title="IN operator"><code class="literal">IN</code> operator</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#missing-properties-and-values" title="3.3.7.7.&nbsp;Missing properties and values">Missing properties and values</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#default-to-false-missing-property" title="Default to false if property is missing">Default to <code class="literal">false</code> if property is missing</a></li>
                        <li class="listitem"><a class="link" href="index.html#default-to-true-missing-property" title="Default to true if property is missing">Default to <code class="literal">true</code> if property is missing</a></li>
                        <li class="listitem"><a class="link" href="index.html#filter-on-null" title="Filter on null">Filter on <code class="literal">null</code></a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-where-ranges" title="3.3.7.8.&nbsp;Using ranges">Using ranges</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#simple-range" title="Simple range">Simple range</a></li>
                        <li class="listitem"><a class="link" href="index.html#composite-range" title="Composite range">Composite range</a></li>
                     </ul>
                  </div>
               </li>
            </ul>
         </div>
         <section class="section" id="where-introduction">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#where-introduction"></a>3.3.7.1.&nbsp;Introduction
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">WHERE</code> is not a clause in its own right&#8201;&#8212;&#8201;rather, it&#8217;s part of <code class="literal">MATCH</code>, <code class="literal">OPTIONAL MATCH</code>, <code class="literal">START</code> and <code class="literal">WITH</code>.
            </p>
            <p>In the case of <code class="literal">WITH</code> and <code class="literal">START</code>, <code class="literal">WHERE</code> simply filters the results.
            </p>
            <p>For <code class="literal">MATCH</code> and <code class="literal">OPTIONAL MATCH</code> on the other hand, <code class="literal">WHERE</code> adds constraints to the patterns described.
               <span class="emphasis"><em>It should not be seen as a filter after the matching is finished.</em></span></p>
            <div class="admonitionblock important">
               <table>
                  <tbody>
                     <tr>
                        <td class="icon"><i class="fa icon-important" title="important"></i></td>
                        <td class="content">
                           <p>In the case of multiple <code class="literal">MATCH</code> / <code class="literal">OPTIONAL MATCH</code> clauses, the predicate in <code class="literal">WHERE</code> is always a part of the patterns in the directly preceding <code class="literal">MATCH</code> / <code class="literal">OPTIONAL MATCH</code>.
                              Both results and performance may be impacted if the <code class="literal">WHERE</code> is put inside the wrong <code class="literal">MATCH</code> clause.
                           </p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <div class="admonitionblock note">
               <table>
                  <tbody>
                     <tr>
                        <td class="icon"><i class="fa icon-note" title="note"></i></td>
                        <td class="content">
                           <p><a class="link" href="../../schema/index/index.html" title="3.5.1.&nbsp;Indexes">Indexes</a>` may be used to optimize queries using <code class="literal">WHERE</code> in a variety of cases.
                           </p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p>The following graph is used for the examples below:</p>
            <div class="figure" id="d0e19017">
               <div class="figure-title">Figure&nbsp;3.12.&nbsp;Graph</div>
               <div class="figure-contents">
                  <div class="mediaobject"><img src="../../../images/WHERE-1.svg" alt="alt"></img></div>
               </div>
            </div>
         </section>
         <section class="section" id="query-where-basic">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-where-basic"></a>3.3.7.2.&nbsp;Basic usage
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="boolean-operations">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#boolean-operations"></a>Boolean operations
                        </h5>
                     </div>
                  </div>
               </div>
               <p>You can use the boolean operators <code class="literal">AND</code>, <code class="literal">OR</code>, <code class="literal">XOR</code> and <code class="literal">NOT</code>.
                  See <a class="xref" href="../../syntax/working-with-null/index.html" title="3.2.14.&nbsp;Working with null">Section&nbsp;3.2.14, &#8220;Working with <code class="literal">null</code>&#8221;</a> for more information on how this works with <code class="literal">null</code>.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.name = 'Peter' XOR (n.age &lt; 30 AND n.name = 'Timothy') OR NOT (n.name = 'Timothy' OR n.name = 'Peter')
RETURN n.name, n.age</code></pre><p>
                  
               </p>
               <div class="table" id="d0e19059">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.126.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>3 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Andy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">36</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Timothy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">25</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE n.name = 'Peter' XOR (n.age &lt; 30 AND n.name = 'Timothy') OR NOT (n.name = 'Timothy' OR n.name = 'Peter')
                        RETURN n.name, n.age
                        </strong></span></p>
            </section>
            <section class="section" id="filter-on-node-label">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#filter-on-node-label"></a>Filter on node label
                        </h5>
                     </div>
                  </div>
               </div>
               <p>To filter nodes by label, write a label predicate after the <code class="literal">WHERE</code> keyword using <code class="literal">WHERE n:foo</code>.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n:Swedish
RETURN n.name, n.age</code></pre><p>
                  
               </p>
               <p>The name and age for the <span class="strong"><strong>'Andy'</strong></span> node will be returned.
               </p>
               <div class="table" id="d0e19136">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.127.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Andy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">36</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE n:Swedish
                        RETURN n.name, n.age
                        </strong></span></p>
            </section>
            <section class="section" id="filter-on-node-property">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#filter-on-node-property"></a>Filter on node property
                        </h5>
                     </div>
                  </div>
               </div>
               <p>To filter on a node property, write your clause after the <code class="literal">WHERE</code> keyword.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.age &lt; 30
RETURN n.name, n.age</code></pre><p>
                  
               </p>
               <p>The name and age values for the <span class="strong"><strong>'Timothy'</strong></span> node are returned because he is less than 30 years of age.
               </p>
               <div class="table" id="d0e19192">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.128.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Timothy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">25</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE n.age &lt; 30
                        RETURN n.name, n.age
                        </strong></span></p>
            </section>
            <section class="section" id="filter-on-relationship-property">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#filter-on-relationship-property"></a>Filter on relationship property
                        </h5>
                     </div>
                  </div>
               </div>
               <p>To filter on a relationship property, write your clause after the <code class="literal">WHERE</code> keyword.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)-[k:KNOWS]-&gt;(f)
WHERE k.since &lt; 2000
RETURN f.name, f.age, f.email</code></pre><p>
                  
               </p>
               <p>The name, age and email values for the <span class="strong"><strong>'Peter'</strong></span> node are returned because Andy has known him since before 2000.
               </p>
               <div class="table" id="d0e19248">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.129.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">f.name</th>
                           <th style="text-align: left; vertical-align: top; ">f.age</th>
                           <th style="text-align: left; vertical-align: top; ">f.email</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"peter_n@example.com"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)-[k:KNOWS]-&gt;(f)
                        WHERE k.since &lt; 2000
                        RETURN f.name, f.age, f.email
                        </strong></span></p>
            </section>
            <section class="section" id="filter-on-dynamic-property">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#filter-on-dynamic-property"></a>Filter on dynamically-computed node property
                        </h5>
                     </div>
                  </div>
               </div>
               <p>To filter on a property using a dynamically computed name, use square bracket syntax.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">WITH 'AGE' AS propname
MATCH (n)
WHERE n[toLower(propname)]&lt; 30
RETURN n.name, n.age</code></pre><p>
                  
               </p>
               <p>The name and age values for the <span class="strong"><strong>'Timothy'</strong></span> node are returned because he is less than 30 years of age.
               </p>
               <div class="table" id="d0e19308">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.130.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Timothy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">25</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        WITH 'AGE' as propname
                        MATCH (n)
                        WHERE n[toLower(propname)] &lt; 30
                        RETURN n.name, n.age
                        </strong></span></p>
            </section>
            <section class="section" id="property-existence-checking">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#property-existence-checking"></a>Property existence checking
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Use the <code class="literal">exists()</code> function to only include nodes or relationships in which a property exists.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE exists(n.belt)
RETURN n.name, n.belt</code></pre><p>
                  
               </p>
               <p>The name and belt for the <span class="strong"><strong>'Andy'</strong></span> node are returned because he is the only one with a <code class="literal">belt</code> property.
               </p>
               <div class="admonitionblock important">
                  <table>
                     <tbody>
                        <tr>
                           <td class="icon"><i class="fa icon-important" title="important"></i></td>
                           <td class="content">
                              <p>The <code class="literal">has()</code> function has been superseded by <code class="literal">exists()</code> and has been removed.
                              </p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <div class="table" id="d0e19376">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.131.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.belt</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Andy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"white"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE exists(n.belt)
                        RETURN n.name, n.belt
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="query-where-string">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-where-string"></a>3.3.7.3.&nbsp;String matching
                     </h4>
                  </div>
               </div>
            </div>
            <p>The prefix and suffix of a string can be matched using <code class="literal">STARTS WITH</code> and <code class="literal">ENDS WITH</code>.
               To undertake a substring search - i.e. match regardless of location within a string - use <code class="literal">CONTAINS</code>.
               The matching is <span class="emphasis"><em>case-sensitive</em></span>.
               Attempting to use these operators on values which are not strings will return <code class="literal">null</code>.
            </p>
            <section class="section" id="match-string-start">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-string-start"></a>Prefix string search using <code class="literal">STARTS WITH</code></h5>
                     </div>
                  </div>
               </div>
               <p>The <code class="literal">STARTS WITH</code> operator is used to perform case-sensitive matching on the beginning of a string.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.name STARTS WITH 'Pet'
RETURN n.name, n.age</code></pre><p>
                  
               </p>
               <p>The name and age for the <span class="strong"><strong>'Peter'</strong></span> node are returned because his name starts with <span class="strong"><strong>'Pet'</strong></span>.
               </p>
               <div class="table" id="d0e19457">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.132.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE n.name STARTS WITH 'Pet'
                        RETURN n.name, n.age
                        </strong></span></p>
            </section>
            <section class="section" id="match-string-end">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-string-end"></a>Suffix string search using <code class="literal">ENDS WITH</code></h5>
                     </div>
                  </div>
               </div>
               <p>The <code class="literal">ENDS WITH</code> operator is used to perform case-sensitive matching on the ending of a string.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.name ENDS WITH 'ter'
RETURN n.name, n.age</code></pre><p>
                  
               </p>
               <p>The name and age for the <span class="strong"><strong>'Peter'</strong></span> node are returned because his name ends with <span class="strong"><strong>'ter'</strong></span>.
               </p>
               <div class="table" id="d0e19518">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.133.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE n.name ENDS WITH 'ter'
                        RETURN n.name, n.age
                        </strong></span></p>
            </section>
            <section class="section" id="match-string-contains">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-string-contains"></a>Substring search using <code class="literal">CONTAINS</code></h5>
                     </div>
                  </div>
               </div>
               <p>The <code class="literal">CONTAINS</code> operator is used to perform case-sensitive matching regardless of location within a string.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.name CONTAINS 'ete'
RETURN n.name, n.age</code></pre><p>
                  
               </p>
               <p>The name and age for the <span class="strong"><strong>'Peter'</strong></span> node are returned because his name contains with <span class="strong"><strong>'ete'</strong></span>.
               </p>
               <div class="table" id="d0e19579">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.134.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE n.name CONTAINS 'ete'
                        RETURN n.name, n.age
                        </strong></span></p>
            </section>
            <section class="section" id="match-string-negation">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#match-string-negation"></a>String matching negation
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Use the <code class="literal">NOT</code> keyword to exclude all matches on given string from your result:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE NOT n.name ENDS WITH 'y'
RETURN n.name, n.age</code></pre><p>
                  
               </p>
               <p>The name and age for the <span class="strong"><strong>'Peter'</strong></span> node are returned because his name does not end with <span class="strong"><strong>'y'</strong></span>.
               </p>
               <div class="table" id="d0e19638">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.135.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE NOT n.name ENDS WITH 'y'
                        RETURN n.name, n.age
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="query-where-regex">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-where-regex"></a>3.3.7.4.&nbsp;Regular expressions
                     </h4>
                  </div>
               </div>
            </div>
            <p>Cypher supports filtering using regular expressions.
               The regular expression syntax is inherited from <a class="link" href="https://docs.oracle.com/javase/7/docs/api/java/util/regex/Pattern.html" target="_top">the Java regular expressions</a>.
               This includes support for flags that change how strings are matched, including case-insensitive <code class="literal">(?i)</code>, multiline <code class="literal">(?m)</code> and dotall <code class="literal">(?s)</code>.
               Flags are given at the beginning of the regular expression, for example <code class="literal">MATCH (n) WHERE n.name =~ '(?i)Lon.*' RETURN n</code> will return nodes with name 'London' or with name 'LonDoN'.
            </p>
            <section class="section" id="matching-using-regular-expressions">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#matching-using-regular-expressions"></a>Matching using regular expressions
                        </h5>
                     </div>
                  </div>
               </div>
               <p>You can match on regular expressions by using <code class="literal">=~ 'regexp'</code>, like this:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.name =~ 'Tim.*'
RETURN n.name, n.age</code></pre><p>
                  
               </p>
               <p>The name and age for the <span class="strong"><strong>'Timothy'</strong></span> node are returned because his name starts with <span class="strong"><strong>'Tim'</strong></span>.
               </p>
               <div class="table" id="d0e19717">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.136.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Timothy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">25</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE n.name =~ 'Tim.*'
                        RETURN n.name, n.age
                        </strong></span></p>
            </section>
            <section class="section" id="escaping-in-regular-expressions">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#escaping-in-regular-expressions"></a>Escaping in regular expressions
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Characters like <code class="literal">.</code> or <code class="literal">*</code> have special meaning in a regular expression.
                  To use these as ordinary characters, without special meaning, escape them.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.email =~ '.*\\.com'
RETURN n.name, n.age, n.email</code></pre><p>
                  
               </p>
               <p>The name, age and email for the <span class="strong"><strong>'Peter'</strong></span> node are returned because his email ends with <span class="strong"><strong>'.com'</strong></span>.
               </p>
               <div class="table" id="d0e19779">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.137.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                           <th style="text-align: left; vertical-align: top; ">n.email</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"peter_n@example.com"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE n.email =~ '.*\\\\.com'
                        RETURN n.name, n.age, n.email
                        </strong></span></p>
            </section>
            <section class="section" id="case-insensitive-regular-expressions">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#case-insensitive-regular-expressions"></a>Case-insensitive regular expressions
                        </h5>
                     </div>
                  </div>
               </div>
               <p>By pre-pending a regular expression with <code class="literal">(?i)</code>, the whole expression becomes case-insensitive.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.name =~ '(?i)AND.*'
RETURN n.name, n.age</code></pre><p>
                  
               </p>
               <p>The name and age for the <span class="strong"><strong>'Andy'</strong></span> node are returned because his name starts with <span class="strong"><strong>'AND'</strong></span> irrespective of casing.
               </p>
               <div class="table" id="d0e19845">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.138.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Andy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">36</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE n.name =~ '(?i)AND.*'
                        RETURN n.name, n.age
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="query-where-patterns">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-where-patterns"></a>3.3.7.5.&nbsp;Using path patterns in <code class="literal">WHERE</code></h4>
                  </div>
               </div>
            </div>
            <section class="section" id="filter-on-patterns">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#filter-on-patterns"></a>Filter on patterns
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Patterns are expressions in Cypher, expressions that return a list of paths.
                  List expressions are also predicates&#8201;&#8212;&#8201;an empty list represents <code class="literal">false</code>, and a non-empty represents <code class="literal">true</code>.
               </p>
               <p>So, patterns are not only expressions, they are also predicates.
                  The only limitation to your pattern is that you must be able to express it in a single path.
                  You cannot use commas between multiple paths like you do in <code class="literal">MATCH</code>.
                  You can achieve  the same effect by combining multiple patterns with <code class="literal">AND</code>.
               </p>
               <p>Note that you cannot introduce new variables here.
                  Although it might look very similar to the <code class="literal">MATCH</code> patterns, the <code class="literal">WHERE</code> clause is all about eliminating matched subgraphs.
                  <code class="literal">MATCH (a)-[*]&#8594;(b)</code> is very different from <code class="literal">WHERE (a)-[*]&#8594;(b)</code>.
                  The first will produce a subgraph for every path it can find between <code class="literal">a</code> and <code class="literal">b</code>, whereas the latter will eliminate any matched subgraphs where <code class="literal">a</code> and <code class="literal">b</code> do not have a directed relationship chain between them.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (timothy { name: 'Timothy' }),(others)
WHERE others.name IN ['Andy', 'Peter'] AND (timothy)&lt;--(others)
RETURN others.name, others.age</code></pre><p>
                  
               </p>
               <p>The name and age for nodes that have an outgoing relationship to the <span class="strong"><strong>'Timothy'</strong></span> node are returned.
               </p>
               <div class="table" id="d0e19943">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.139.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">others.name</th>
                           <th style="text-align: left; vertical-align: top; ">others.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Andy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">36</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (timothy {name: 'Timothy'}), (others)
                        WHERE others.name IN ['Andy', 'Peter'] AND (timothy)&lt;--(others)
                        RETURN others.name, others.age
                        </strong></span></p>
            </section>
            <section class="section" id="filter-on-patterns-using-not">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#filter-on-patterns-using-not"></a>Filter on patterns using <code class="literal">NOT</code></h5>
                     </div>
                  </div>
               </div>
               <p>The <code class="literal">NOT</code> operator can be used to exclude a pattern.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (persons),(peter { name: 'Peter' })
WHERE NOT (persons)--&gt;(peter)
RETURN persons.name, persons.age</code></pre><p>
                  
               </p>
               <p>Name and age values for nodes that do not have an outgoing relationship to the <span class="strong"><strong>'Peter'</strong></span> node are returned.
               </p>
               <div class="table" id="d0e20001">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.140.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">persons.name</th>
                           <th style="text-align: left; vertical-align: top; ">persons.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>2 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Timothy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">25</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (persons), (peter {name: 'Peter'})
                        WHERE NOT (persons)--&gt;(peter)
                        RETURN persons.name, persons.age
                        </strong></span></p>
            </section>
            <section class="section" id="filter-on-patterns-with-properties">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#filter-on-patterns-with-properties"></a>Filter on patterns with properties
                        </h5>
                     </div>
                  </div>
               </div>
               <p>You can also add properties to your patterns:</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE (n)-[:KNOWS]-({ name: 'Timothy' })
RETURN n.name, n.age</code></pre><p>
                  
               </p>
               <p>Finds all name and age values for nodes that have a <code class="literal">KNOWS</code> relationship to a node with the name <span class="strong"><strong>'Timothy'</strong></span>.
               </p>
               <div class="table" id="d0e20066">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.141.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Andy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">36</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE (n)-[:KNOWS]-({name: 'Timothy'})
                        RETURN n.name, n.age
                        </strong></span></p>
            </section>
            <section class="section" id="filter-on-relationship-type">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#filter-on-relationship-type"></a>Filter on relationship type
                        </h5>
                     </div>
                  </div>
               </div>
               <p>You can put the exact relationship type in the <code class="literal">MATCH</code> pattern, but sometimes you want to be able to do more advanced filtering on the type.
                  You can use the special property <code class="literal">type</code> to compare the type with something else.
                  In this example, the query does a regular expression comparison with the name of the relationship type.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)-[r]-&gt;()
WHERE n.name='Andy' AND type(r)=~ 'K.*'
RETURN type(r), r.since</code></pre><p>
                  
               </p>
               <p>This returns all relationships having a type whose name starts with <span class="strong"><strong>'K'</strong></span>.
               </p>
               <div class="table" id="d0e20125">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.142.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">type(r)</th>
                           <th style="text-align: left; vertical-align: top; ">r.since</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>2 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"KNOWS"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1999</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"KNOWS"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">2012</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)-[r]-&gt;()
                        WHERE n.name='Andy' AND type(r) =~ 'K.*'
                         RETURN type(r), r.since
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="query-where-lists">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-where-lists"></a>3.3.7.6.&nbsp;Lists
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="where-in-operator">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#where-in-operator"></a><code class="literal">IN</code> operator
                        </h5>
                     </div>
                  </div>
               </div>
               <p>To check if an element exists in a list, you can use the <code class="literal">IN</code> operator.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a)
WHERE a.name IN ['Peter', 'Timothy']
RETURN a.name, a.age</code></pre><p>
                  
               </p>
               <p>This query shows how to check if a property exists in a literal list.</p>
               <div class="table" id="d0e20192">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.143.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">a.name</th>
                           <th style="text-align: left; vertical-align: top; ">a.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>2 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Timothy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">25</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (a)
                        WHERE a.name IN ['Peter', 'Timothy']
                        RETURN a.name, a.age
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="missing-properties-and-values">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#missing-properties-and-values"></a>3.3.7.7.&nbsp;Missing properties and values
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="default-to-false-missing-property">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#default-to-false-missing-property"></a>Default to <code class="literal">false</code> if property is missing
                        </h5>
                     </div>
                  </div>
               </div>
               <p>As missing properties evaluate to <code class="literal">null</code>, the comparison in the example will evaluate to <code class="literal">false</code> for nodes without the <code class="literal">belt</code> property.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.belt = 'white'
RETURN n.name, n.age, n.belt</code></pre><p>
                  
               </p>
               <p>Only the name, age and belt values of nodes with white belts are returned.</p>
               <div class="table" id="d0e20266">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.144.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                           <th style="text-align: left; vertical-align: top; ">n.belt</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Andy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">36</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"white"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE n.belt = 'white'
                        RETURN n.name, n.age, n.belt
                        </strong></span></p>
            </section>
            <section class="section" id="default-to-true-missing-property">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#default-to-true-missing-property"></a>Default to <code class="literal">true</code> if property is missing
                        </h5>
                     </div>
                  </div>
               </div>
               <p>If you want to compare a property on a node or relationship, but only if it exists, you can compare the property against both
                  the value you are looking for and <code class="literal">null</code>, like:
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE n.belt = 'white' OR n.belt IS NULL RETURN n.name, n.age, n.belt
ORDER BY n.name</code></pre><p>
                  
               </p>
               <p>This returns all values for all nodes, even those without the belt property.</p>
               <div class="table" id="d0e20329">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.145.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">n.name</th>
                           <th style="text-align: left; vertical-align: top; ">n.age</th>
                           <th style="text-align: left; vertical-align: top; ">n.belt</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>3 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Andy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">36</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"white"</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">&lt;null&gt;</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Timothy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">25</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">&lt;null&gt;</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (n)
                        WHERE n.belt = 'white' OR n.belt IS NULL
                        RETURN n.name, n.age, n.belt
                        ORDER BY n.name
                        </strong></span></p>
            </section>
            <section class="section" id="filter-on-null">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#filter-on-null"></a>Filter on <code class="literal">null</code></h5>
                     </div>
                  </div>
               </div>
               <p>Sometimes you might want to test if a value or a variable is <code class="literal">null</code>.
                  This is done just like SQL does it, using <code class="literal">IS NULL</code>.
                  Also like SQL, the negative is <code class="literal">IS NOT NULL</code>, although <code class="literal">NOT(IS NULL x)</code> also works.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (person)
WHERE person.name = 'Peter' AND person.belt IS NULL RETURN person.name, person.age, person.belt</code></pre><p>
                  
               </p>
               <p>The name and age values for nodes that have name <span class="strong"><strong>'Peter'</strong></span> but no belt property are returned.
               </p>
               <div class="table" id="d0e20429">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.146.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">person.name</th>
                           <th style="text-align: left; vertical-align: top; ">person.age</th>
                           <th style="text-align: left; vertical-align: top; ">person.belt</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">&lt;null&gt;</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (person)
                        WHERE person.name = 'Peter' AND person.belt IS NULL
                        RETURN person.name, person.age, person.belt
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="query-where-ranges">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-where-ranges"></a>3.3.7.8.&nbsp;Using ranges
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="simple-range">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#simple-range"></a>Simple range
                        </h5>
                     </div>
                  </div>
               </div>
               <p>To check for an element being inside a specific range, use the inequality operators <code class="literal">&lt;</code>, <code class="literal">&lt;=</code>, <code class="literal">&gt;=</code>, <code class="literal">&gt;</code>.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a)
WHERE a.name &gt;= 'Peter'
RETURN a.name, a.age</code></pre><p>
                  
               </p>
               <p>The name and age values of nodes having a name property lexicographically greater than or equal to <span class="strong"><strong>'Peter'</strong></span> are returned.
               </p>
               <div class="table" id="d0e20504">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.147.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">a.name</th>
                           <th style="text-align: left; vertical-align: top; ">a.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>2 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Timothy"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">25</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (a)
                        WHERE a.name &gt;= 'Peter'
                        RETURN a.name, a.age
                        </strong></span></p>
            </section>
            <section class="section" id="composite-range">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#composite-range"></a>Composite range
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Several inequalities can be used to construct a range.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a)
WHERE a.name &gt; 'Andy' AND a.name &lt; 'Timothy'
RETURN a.name, a.age</code></pre><p>
                  
               </p>
               <p>The name and age values of nodes having a name property lexicographically between <span class="strong"><strong>'Andy'</strong></span> and <span class="strong"><strong>'Timothy'</strong></span> are returned.
               </p>
               <div class="table" id="d0e20569">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.148.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">a.name</th>
                           <th style="text-align: left; vertical-align: top; ">a.age</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Peter"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">35</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (andy:Swedish {name: 'Andy', age: 36, belt: 'white'}),
                            (timothy {name: 'Timothy', age: 25, address: 'Sweden/Malmo'}),
                            (peter {name: 'Peter', age: 35, email: 'peter_n@example.com'}),
                     
                            (andy)-[:KNOWS {since: 2012}]-&gt;(timothy),
                            (andy)-[:KNOWS {since: 1999}]-&gt;(peter)
                     
                     
                     </span><span class="command"><strong>
                        MATCH (a)
                        WHERE a.name &gt; 'Andy' AND a.name &lt; 'Timothy'
                        RETURN a.name, a.age
                        </strong></span></p>
            </section>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>