
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.3.14.&nbsp;REMOVE - 3.3.&nbsp;Clauses</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="The REMOVE clause is used to remove properties from nodes and relationships, and to remove labels from nodes."></meta>
      <link rel="prev" href="../set/index.html" title="3.3.13.&nbsp;SET"></link>
      <link rel="next" href="../foreach/index.html" title="3.3.15.&nbsp;FOREACH"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../set/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>SET</a></span><span class="nav-current">
               <p class="nav-title hidden">3.3.14.&nbsp;REMOVE</p></span><span class="nav-next"><a accesskey="n" href="../foreach/index.html">FOREACH<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-remove">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-remove"></a>3.3.14.&nbsp;REMOVE
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>The <code class="literal">REMOVE</code> clause is used to remove properties from nodes and relationships, and to remove labels from nodes.
            </p>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#query-remove-introduction" title="3.3.14.1.&nbsp;Introduction">Introduction</a></li>
               <li class="listitem"><a class="link" href="index.html#remove-remove-a-property" title="3.3.14.2.&nbsp;Remove a property">Remove a property</a></li>
               <li class="listitem"><a class="link" href="index.html#remove-remove-all-properties" title="3.3.14.3.&nbsp;Remove all properties">Remove all properties</a></li>
               <li class="listitem"><a class="link" href="index.html#remove-remove-a-label-from-a-node" title="3.3.14.4.&nbsp;Remove a label from a node">Remove a label from a node</a></li>
               <li class="listitem"><a class="link" href="index.html#remove-remove-multiple-labels" title="3.3.14.5.&nbsp;Remove multiple labels from a node">Remove multiple labels from a node</a></li>
            </ul>
         </div>
         <section class="section" id="query-remove-introduction">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-remove-introduction"></a>3.3.14.1.&nbsp;Introduction
                     </h4>
                  </div>
               </div>
            </div>
            <p>For deleting nodes and relationships, see <a class="xref" href="../delete/index.html" title="3.3.12.&nbsp;DELETE">Section&nbsp;3.3.12, &#8220;DELETE&#8221;</a>.
            </p>
            <div class="admonitionblock note">
               <table>
                  <tbody>
                     <tr>
                        <td class="icon"><i class="fa icon-note" title="note"></i></td>
                        <td class="content">
                           <p>Removing labels from a node is an idempotent operation: if you try to remove a label from a node that does not have that label
                              on it, nothing happens.
                              The query statistics will tell you if something needed to be done or not.
                           </p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p>The examples use the following database:</p>
            <div class="figure" id="d0e23300">
               <div class="figure-title">Figure&nbsp;3.18.&nbsp;Graph</div>
               <div class="figure-contents">
                  <div class="mediaobject"><img src="../../../images/REMOVE-1.svg" alt="alt"></img></div>
               </div>
            </div>
         </section>
         <section class="section" id="remove-remove-a-property">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#remove-remove-a-property"></a>3.3.14.2.&nbsp;Remove a property
                     </h4>
                  </div>
               </div>
            </div>
            <p>Neo4j doesn&#8217;t allow storing <code class="literal">null</code> in properties.
               Instead, if no value exists, the property is just not there.
               So, <code class="literal">REMOVE</code> is used to remove a property value from a node or a relationship.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a { name: 'Andy' })
REMOVE a.age
RETURN a.name, a.age</code></pre><p>
               
            </p>
            <p>The node is returned, and no property <code class="literal">age</code> exists on it.
            </p>
            <div class="table" id="d0e23333">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.188.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">a.name</th>
                        <th style="text-align: left; vertical-align: top; ">a.age</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="2">
                           <p>1 row
                              Properties set: 1
                           </p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Andy"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">&lt;null&gt;</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Swedish {name: 'Andy', age: 36}),
                         (t:Swedish {name: 'Timothy', age: 25}),
                         (p:German:Swedish {name: 'Peter', age: 34}),
                         (a)-[:KNOWS]-&gt;(t),
                         (a)-[:KNOWS]-&gt;(p)
                  
                  </span><span class="command"><strong>
                     MATCH (a {name: 'Andy'})
                     REMOVE a.age
                     RETURN a.name, a.age
                     </strong></span></p>
         </section>
         <section class="section" id="remove-remove-all-properties">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#remove-remove-all-properties"></a>3.3.14.3.&nbsp;Remove all properties
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">REMOVE</code> cannot be used to remove all existing properties from a node or relationship.
               Instead, using <a class="link" href="../set/index.html#set-remove-properties-using-empty-map" title="3.3.13.7.&nbsp;Remove all properties using an empty map and ="><code class="literal">SET</code> with <code class="literal">=</code> and an empty map as the right operand</a> will clear all properties from the node or relationship.
            </p>
         </section>
         <section class="section" id="remove-remove-a-label-from-a-node">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#remove-remove-a-label-from-a-node"></a>3.3.14.4.&nbsp;Remove a label from a node
                     </h4>
                  </div>
               </div>
            </div>
            <p>To remove labels, you use <code class="literal">REMOVE</code>.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n { name: 'Peter' })
REMOVE n:German
RETURN n.name, labels(n)</code></pre><p>
               
            </p>
            <div class="table" id="d0e23401">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.189.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n.name</th>
                        <th style="text-align: left; vertical-align: top; ">labels(n)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="2">
                           <p>1 row
                              Labels removed: 1
                           </p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Peter"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">["Swedish"]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Swedish {name: 'Andy', age: 36}),
                         (t:Swedish {name: 'Timothy', age: 25}),
                         (p:German:Swedish {name: 'Peter', age: 34}),
                         (a)-[:KNOWS]-&gt;(t),
                         (a)-[:KNOWS]-&gt;(p)
                  
                  </span><span class="command"><strong>
                     MATCH (n {name: 'Peter'})
                     REMOVE n:German
                     RETURN n.name, labels(n)
                     </strong></span></p>
         </section>
         <section class="section" id="remove-remove-multiple-labels">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#remove-remove-multiple-labels"></a>3.3.14.5.&nbsp;Remove multiple labels from a node
                     </h4>
                  </div>
               </div>
            </div>
            <p>To remove multiple labels, you use <code class="literal">REMOVE</code>.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n { name: 'Peter' })
REMOVE n:German:Swedish
RETURN n.name, labels(n)</code></pre><p>
               
            </p>
            <div class="table" id="d0e23454">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.190.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n.name</th>
                        <th style="text-align: left; vertical-align: top; ">labels(n)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="2">
                           <p>1 row
                              Labels removed: 2
                           </p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Peter"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">[]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a:Swedish {name: 'Andy', age: 36}),
                         (t:Swedish {name: 'Timothy', age: 25}),
                         (p:German:Swedish {name: 'Peter', age: 34}),
                         (a)-[:KNOWS]-&gt;(t),
                         (a)-[:KNOWS]-&gt;(p)
                  
                  </span><span class="command"><strong>
                     MATCH (n {name: 'Peter'})
                     REMOVE n:German:Swedish
                     RETURN n.name, labels(n)
                     </strong></span></p>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>