
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>2.2.3.&nbsp;Getting correct results - 2.2.&nbsp;Get started with Cypher</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <link rel="prev" href="../patterns-in-practice/index.html" title="2.2.2.&nbsp;Patterns in practice"></link>
      <link rel="next" href="../how-to-compose-large-statements/index.html" title="2.2.4.&nbsp;Composing large statements"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../patterns-in-practice/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Patterns in practice</a></span><span class="nav-current">
               <p class="nav-title hidden">2.2.3.&nbsp;Getting correct results</p></span><span class="nav-next"><a accesskey="n" href="../how-to-compose-large-statements/index.html">Composing large statements<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="cypherdoc-getting-the-results-you-want">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#cypherdoc-getting-the-results-you-want"></a>2.2.3.&nbsp;Getting correct results
                  </h3>
               </div>
            </div>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#cypherdoc-getting-the-results-you-want-filtering-results" title="2.2.3.1.&nbsp;Filtering results">Filtering results</a></li>
               <li class="listitem"><a class="link" href="index.html#cypherdoc-getting-the-results-you-want-returning-results" title="2.2.3.2.&nbsp;Returning results">Returning results</a></li>
               <li class="listitem"><a class="link" href="index.html#cypherdoc-getting-the-results-you-want-aggregating-information" title="2.2.3.3.&nbsp;Aggregating information">Aggregating information</a></li>
               <li class="listitem"><a class="link" href="index.html#cypherdoc-getting-the-results-you-want-ordering-and-pagination" title="2.2.3.4.&nbsp;Ordering and pagination">Ordering and pagination</a></li>
               <li class="listitem"><a class="link" href="index.html#cypherdoc-getting-the-results-you-want-collecting-aggregation" title="2.2.3.5.&nbsp;Collecting aggregation">Collecting aggregation</a></li>
            </ul>
         </div>
         <p>Let&#8217;s first get some data in to retrieve results from:</p><pre class="programlisting highlight"><code data-lang="cypher">CREATE (matrix:Movie { title:"The Matrix",released:1997 })
CREATE (cloudAtlas:Movie { title:"Cloud Atlas",released:2012 })
CREATE (forrestGump:Movie { title:"Forrest Gump",released:1994 })
CREATE (keanu:Person { name:"Keanu Reeves", born:1964 })
CREATE (robert:Person { name:"Robert Zemeckis", born:1951 })
CREATE (tom:Person { name:"Tom Hanks", born:1956 })
CREATE (tom)-[:ACTED_IN { roles: ["Forrest"]}]-&gt;(forrestGump)
CREATE (tom)-[:ACTED_IN { roles: ['Zachry']}]-&gt;(cloudAtlas)
CREATE (robert)-[:DIRECTED]-&gt;(forrestGump)</code></pre><p>This is the data we will start out with:</p>
         <div class="informalfigure">
            <div class="mediaobject"><img src="../../../images/cypherdoc--ee5ee0f8.svg" alt="alt"></img></div>
         </div>
         <section class="section" id="cypherdoc-getting-the-results-you-want-filtering-results">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypherdoc-getting-the-results-you-want-filtering-results"></a>2.2.3.1.&nbsp;Filtering results
                     </h4>
                  </div>
               </div>
            </div>
            <p>So far we&#8217;ve matched patterns in the graph and always returned all results we found.
               Quite often there are conditions in play for what we want to see.
               Similar to in <span class="emphasis"><em>SQL</em></span> those filter conditions are expressed in a <code class="literal">WHERE</code> clause.
               This clause allows to use any number of boolean expressions (predicates) combined with <code class="literal">AND</code>, <code class="literal">OR</code>, <code class="literal">XOR</code> and <code class="literal">NOT</code>.
               The simplest predicates are comparisons, especially equality.
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (m:Movie)
WHERE m.title = "The Matrix"
RETURN m</code></pre><pre class="screen highlight"><code>+-------------------------------------------+
| m                                         |
+-------------------------------------------+
| Node[0]{title:"The Matrix",released:1997} |
+-------------------------------------------+
1 row</code></pre><p>For equality on one or more properties, a more compact syntax can be used as well:</p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (m:Movie { title: "The Matrix" })
RETURN m</code></pre><p>Other options are numeric comparisons, matching regular expressions and checking the existence of values within a list.</p>
            <p>The <code class="literal">WHERE</code> clause below includes a regular expression match, a greater than comparison and a test to see if a value exists in a list.
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (p:Person)-[r:ACTED_IN]-&gt;(m:Movie)
WHERE p.name =~ "K.+" OR m.released &gt; 2000 OR "Neo" IN r.roles
RETURN p,r,m</code></pre><pre class="screen highlight"><code>+-------------------------------------------------------------------------------------------------------------------+
| p                                   | r                              | m                                          |
+-------------------------------------------------------------------------------------------------------------------+
| Node[5]{name:"Tom Hanks",born:1956} | :ACTED_IN[1]{roles:["Zachry"]} | Node[1]{title:"Cloud Atlas",released:2012} |
+-------------------------------------------------------------------------------------------------------------------+
1 row</code></pre><p>One aspect that might be a little surprising is that you can even use patterns as predicates.
               Where <code class="literal">MATCH</code> expands the number and shape of patterns matched, a pattern predicate restricts the current result set.
               It only allows the paths to pass that satisfy the additional patterns as well (or <code class="literal">NOT</code>).
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (p:Person)-[:ACTED_IN]-&gt;(m)
WHERE NOT (p)-[:DIRECTED]-&gt;()
RETURN p,m</code></pre><pre class="screen highlight"><code>+-----------------------------------------------------------------------------------+
| p                                   | m                                           |
+-----------------------------------------------------------------------------------+
| Node[5]{name:"Tom Hanks",born:1956} | Node[1]{title:"Cloud Atlas",released:2012}  |
| Node[5]{name:"Tom Hanks",born:1956} | Node[2]{title:"Forrest Gump",released:1994} |
+-----------------------------------------------------------------------------------+
2 rows</code></pre><p>Here we find actors, because they sport an <code class="literal">ACTED_IN</code> relationship but then skip those that ever <code class="literal">DIRECTED</code> any movie.
            </p>
            <p>There are also more advanced ways of filtering like list-predicates which we will look at later on.</p>
         </section>
         <section class="section" id="cypherdoc-getting-the-results-you-want-returning-results">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypherdoc-getting-the-results-you-want-returning-results"></a>2.2.3.2.&nbsp;Returning results
                     </h4>
                  </div>
               </div>
            </div>
            <p>So far we&#8217;ve returned only nodes, relationships, or paths directly via their variables.
               But the <code class="literal">RETURN</code> clause can actually return any number of expressions.
               But what are actually expressions in Cypher?
            </p>
            <p>The simplest expressions are literal values like numbers, strings and arrays as <code class="literal">[1,2,3]</code>, and maps like <code class="literal">{name:"Tom Hanks", born:1964, movies:["Forrest Gump", &#8230;&#8203;], count:13}</code>.
               You can access individual properties of any node, relationship, or map with a dot-syntax like <code class="literal">n.name</code>.
               Individual elements or slices of arrays can be retrieved with subscripts like <code class="literal">names[0]</code> or <code class="literal">movies[1..-1]</code>.
               Each function evaluation like <code class="literal">length(array)</code>, <code class="literal">toInteger("12")</code>, <code class="literal">substring("2014-07-01",0,4)</code>, or <code class="literal">coalesce(p.nickname,"n/a")</code> is also an expression.
            </p>
            <p>Predicates that you&#8217;d use in <code class="literal">WHERE</code> count as boolean expressions.
            </p>
            <p>Of course simpler expressions can be composed and concatenated to form more complex expressions.</p>
            <p>By default the expression itself will be used as label for the column, in many cases you want to alias that with a more understandable
               name using <code class="literal">expression AS alias</code>.
               You can later on refer to that column using its alias.
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (p:Person)
RETURN p, p.name AS name, toUpper(p.name), coalesce(p.nickname,"n/a") AS nickname, { name: p.name,
  label:head(labels(p))} AS person</code></pre><pre class="screen highlight"><code>+-----------------------------------------------------------------------------------------------------------------------------------------------+
| p                                         | name              | toUpper(p.name)     | nickname | person                                         |
+-----------------------------------------------------------------------------------------------------------------------------------------------+
| Node[3]{name:"Keanu Reeves",born:1964}    | "Keanu Reeves"    | "KEANU REEVES"    | "n/a"    | {name -&gt; "Keanu Reeves", label -&gt; "Person"}    |
| Node[4]{name:"Robert Zemeckis",born:1951} | "Robert Zemeckis" | "ROBERT ZEMECKIS" | "n/a"    | {name -&gt; "Robert Zemeckis", label -&gt; "Person"} |
| Node[5]{name:"Tom Hanks",born:1956}       | "Tom Hanks"       | "TOM HANKS"       | "n/a"    | {name -&gt; "Tom Hanks", label -&gt; "Person"}       |
+-----------------------------------------------------------------------------------------------------------------------------------------------+
3 rows</code></pre><p>If you&#8217;re interested in unique results you can use the <code class="literal">DISTINCT</code> keyword after <code class="literal">RETURN</code> to indicate that.
            </p>
         </section>
         <section class="section" id="cypherdoc-getting-the-results-you-want-aggregating-information">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypherdoc-getting-the-results-you-want-aggregating-information"></a>2.2.3.3.&nbsp;Aggregating information
                     </h4>
                  </div>
               </div>
            </div>
            <p>In many cases you want to aggregate or group the data that you encounter while traversing patterns in your graph.
               In Cypher aggregation happens in the <code class="literal">RETURN</code> clause while computing your final results.
               Many common aggregation functions are supported, e.g. <code class="literal">count</code>, <code class="literal">sum</code>, <code class="literal">avg</code>, <code class="literal">min</code>, and <code class="literal">max</code>, but there are several more.
            </p>
            <p>Counting the number of people in your database could be achieved by this:</p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (:Person)
RETURN count(*) AS people</code></pre><pre class="screen highlight"><code>+--------+
| people |
+--------+
| 3      |
+--------+
1 row</code></pre><p>Please note that <code class="literal">NULL</code> values are skipped during aggregation.
               For aggregating only unique values use <code class="literal">DISTINCT</code>, like in <code class="literal">count(DISTINCT role)</code>.
            </p>
            <p>Aggregation in Cypher just works.
               You specify which result columns you want to aggregate and <span class="emphasis"><em>Cypher will use all non-aggregated columns as grouping keys</em></span>.
            </p>
            <p>Aggregation affects which data is still visible in ordering or later query parts.</p>
            <p>To find out how often an actor and director worked together, you&#8217;d run this statement:</p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (actor:Person)-[:ACTED_IN]-&gt;(movie:Movie)&lt;-[:DIRECTED]-(director:Person)
RETURN actor,director,count(*) AS collaborations</code></pre><pre class="screen highlight"><code>+--------------------------------------------------------------------------------------------------+
| actor                               | director                                  | collaborations |
+--------------------------------------------------------------------------------------------------+
| Node[5]{name:"Tom Hanks",born:1956} | Node[4]{name:"Robert Zemeckis",born:1951} | 1              |
+--------------------------------------------------------------------------------------------------+
1 row</code></pre><p>Frequently you want to sort and paginate after aggregating a <code class="literal">count(x)</code>.
            </p>
         </section>
         <section class="section" id="cypherdoc-getting-the-results-you-want-ordering-and-pagination">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypherdoc-getting-the-results-you-want-ordering-and-pagination"></a>2.2.3.4.&nbsp;Ordering and pagination
                     </h4>
                  </div>
               </div>
            </div>
            <p>Ordering works like in other query languages, with an <code class="literal">ORDER BY expression [ASC|DESC]</code> clause.
               The expression can be any expression discussed before as long as it is computable from the returned information.
            </p>
            <p>So for instance if you return <code class="literal">person.name</code> you can still <code class="literal">ORDER BY person.age</code> as both are accessible from the <code class="literal">person</code> reference.
               You cannot order by things that you can&#8217;t infer from the information you return.
               This is especially important with aggregation and <code class="literal">DISTINCT</code> return values as both remove the visibility of data that is aggregated.
            </p>
            <p>Pagination is a straightforward use of <code class="literal">SKIP {offset} LIMIT {count}</code>.
            </p>
            <p>A common pattern is to aggregate for a count (score or frequency), order by it and only return the top-n entries.</p>
            <p>For instance to find the most prolific actors you could do:</p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a:Person)-[:ACTED_IN]-&gt;(m:Movie)
RETURN a,count(*) AS appearances
ORDER BY appearances DESC LIMIT 10;</code></pre><pre class="screen highlight"><code>+---------------------------------------------------+
| a                                   | appearances |
+---------------------------------------------------+
| Node[5]{name:"Tom Hanks",born:1956} | 2           |
+---------------------------------------------------+
1 row</code></pre></section>
         <section class="section" id="cypherdoc-getting-the-results-you-want-collecting-aggregation">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypherdoc-getting-the-results-you-want-collecting-aggregation"></a>2.2.3.5.&nbsp;Collecting aggregation
                     </h4>
                  </div>
               </div>
            </div>
            <p>The most helpful aggregation function is <code class="literal">collect()</code>, which, appropriately collects all aggregated values into a list.
               This comes very handy in many situations as no information of details is lost while aggregating.
            </p>
            <p><code class="literal">collect()</code> is well suited for retrieving typical parent-child structures, where one core entity (parent, root or head) is returned per
               row with all its dependent information in associated lists created with <code class="literal">collect()</code>.
               This means that there is no need to repeat the parent information per each child-row, or even running <code class="literal">n+1</code> statements to retrieve the parent and its children individually.
            </p>
            <p>To retrieve the cast of each movie in our database this statement could be used:</p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (m:Movie)&lt;-[:ACTED_IN]-(a:Person)
RETURN m.title AS movie, collect(a.name) AS cast, count(*) AS actors</code></pre><pre class="screen highlight"><code>+-----------------------------------------+
| movie          | cast          | actors |
+-----------------------------------------+
| "Forrest Gump" | ["Tom Hanks"] | 1      |
| "Cloud Atlas"  | ["Tom Hanks"] | 1      |
+-----------------------------------------+
2 rows</code></pre><p>The lists created by <code class="literal">collect()</code> can either be used from the client consuming the Cypher results or directly within a statement with any of the list functions
               or predicates.
            </p>
            <p class="cypherdoc-console"></p>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>