
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.4.1.&nbsp;Predicate functions - 3.4.&nbsp;Functions</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="Predicates are boolean functions that return true or false for a given set of input. They are most commonly used to filter out subgraphs in the WHERE part of a query."></meta>
      <link rel="prev" href="../index.html" title="3.4.&nbsp;Functions"></link>
      <link rel="next" href="../scalar/index.html" title="3.4.2.&nbsp;Scalar functions"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Functions</a></span><span class="nav-current">
               <p class="nav-title hidden">3.4.1.&nbsp;Predicate functions</p></span><span class="nav-next"><a accesskey="n" href="../scalar/index.html">Scalar functions<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-functions-predicate">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-functions-predicate"></a>3.4.1.&nbsp;Predicate functions
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>Predicates are boolean functions that return true or false for a given set of input.
               They are most commonly used to filter out subgraphs in the <code class="literal">WHERE</code> part of a query.
            </p>
         </div>
         <p>Functions:</p>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#functions-all" title="3.4.1.1.&nbsp;all()">all()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-any" title="3.4.1.2.&nbsp;any()">any()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-exists" title="3.4.1.3.&nbsp;exists()">exists()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-none" title="3.4.1.4.&nbsp;none()">none()</a></li>
               <li class="listitem"><a class="link" href="index.html#functions-single" title="3.4.1.5.&nbsp;single()">single()</a></li>
            </ul>
         </div>
         <div class="figure" id="d0e28574">
            <div class="figure-title">Figure&nbsp;3.22.&nbsp;Graph</div>
            <div class="figure-contents">
               <div class="mediaobject"><img src="../../../images/Predicate&#32;functions-1.svg" alt="alt"></img></div>
            </div>
         </div>
         <section class="section" id="functions-all">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-all"></a>3.4.1.1.&nbsp;all()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">all()</code> returns true if the predicate holds for all elements in the given list.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">all(variable IN list WHERE predicate)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e28599">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A Boolean.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e28610">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">list</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a list.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">variable</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>This is the variable that can be used from within the predicate.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">predicate</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A predicate that is tested against all items in the list.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH p =(a)-[*1..3]-&gt;(b)
WHERE a.name = 'Alice' AND b.name = 'Daniel' AND ALL (x IN nodes(p) WHERE x.age &gt; 30)
RETURN p</code></pre><p>
               
            </p>
            <p>All nodes in the returned paths will have an <code class="literal">age</code> property of at least <span class="strong"><strong>'30'</strong></span>.
            </p>
            <div class="table" id="d0e28661">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.212.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">p</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">(0)-[KNOWS,1]-&gt;(2)-[KNOWS,3]-&gt;(3)</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH p = (a)-[*1..3]-&gt;(b)
                     WHERE a.name = 'Alice' AND b.name = 'Daniel'
                     AND all(x IN nodes(p) WHERE x.age &gt; 30)
                     RETURN p
                     </strong></span></p>
         </section>
         <section class="section" id="functions-any">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-any"></a>3.4.1.2.&nbsp;any()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">any()</code> returns true if the predicate holds for at least one element in the given list.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">any(variable IN list WHERE predicate)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e28705">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A Boolean.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e28716">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">list</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a list.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">variable</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>This is the variable that can be used from within the predicate.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">predicate</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A predicate that is tested against all items in the list.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a)
WHERE a.name = 'Eskil' AND ANY (x IN a.array WHERE x = 'one')
RETURN a.name, a.array</code></pre><p>
               
            </p>
            <p>All nodes in the returned paths have at least one <span class="strong"><strong>'one'</strong></span> value set in the array property named <code class="literal">array</code>.
            </p>
            <div class="table" id="d0e28767">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.213.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">a.name</th>
                        <th style="text-align: left; vertical-align: top; ">a.array</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="2">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Eskil"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">["one","two","three"]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH (a)
                     WHERE a.name = 'Eskil'
                     AND any(x IN a.array WHERE x = 'one')
                     RETURN a.name, a.array
                     </strong></span></p>
         </section>
         <section class="section" id="functions-exists">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-exists"></a>3.4.1.3.&nbsp;exists()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">exists()</code> returns true if a match for the given pattern exists in the graph, or if the specified property exists in the node, relationship
               or map.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">exists(pattern-or-property)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e28818">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A Boolean.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e28829">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">pattern-or-property</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A pattern or a property (in the form 'variable.prop').</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WHERE exists(n.name)
RETURN n.name AS name, exists((n)-[:MARRIED]-&gt;()) AS is_married</code></pre><p>
               
            </p>
            <p>The names of all nodes with the <code class="literal">name</code> property are returned, along with a boolean <code class="literal">true</code> / <code class="literal">false</code> indicating if they are married.
            </p>
            <div class="table" id="d0e28867">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.214.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">name</th>
                        <th style="text-align: left; vertical-align: top; ">is_married</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="2">
                           <p>5 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Alice"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">false</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Bob"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">true</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Charlie"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">false</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Daniel"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">false</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Eskil"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">false</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH (n)
                     WHERE exists(n.name)
                     RETURN n.name AS name, exists((n)-[:MARRIED]-&gt;()) AS is_married
                     </strong></span></p>
         </section>
         <section class="section" id="functions-none">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-none"></a>3.4.1.4.&nbsp;none()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">none()</code> returns true if the predicate holds for no element in the given list.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">none(variable IN list WHERE predicate)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e28954">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A Boolean.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e28965">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">list</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a list.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">variable</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>This is the variable that can be used from within the predicate.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">predicate</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A predicate that is tested against all items in the list.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH p =(n)-[*1..3]-&gt;(b)
WHERE n.name = 'Alice' AND NONE (x IN nodes(p) WHERE x.age = 25)
RETURN p</code></pre><p>
               
            </p>
            <p>No node in the returned paths has an <code class="literal">age</code> property set to <span class="strong"><strong>'25'</strong></span>.
            </p>
            <div class="table" id="d0e29016">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.215.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">p</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>2 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">(0)-[KNOWS,1]-&gt;(2)</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">(0)-[KNOWS,1]-&gt;(2)-[KNOWS,3]-&gt;(3)</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH p = (n)-[*1..3]-&gt;(b)
                     WHERE n.name = 'Alice'
                     AND none(x IN nodes(p) WHERE x.age = 25) RETURN p
                     </strong></span></p>
         </section>
         <section class="section" id="functions-single">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#functions-single"></a>3.4.1.5.&nbsp;single()
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">single()</code> returns true if the predicate holds for exactly one of the elements in the given list.
            </p>
            <p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">single(variable IN list WHERE predicate)</code></p>
            <p><span class="strong"><strong>Returns:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e29065">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A Boolean.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="strong"><strong>Arguments:</strong></span></p>
            <div class="informaltable">
               <div class="table" id="d0e29076">
                  <table class="informaltable" border="1">
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">Name</th>
                           <th style="text-align: left; vertical-align: top; ">Description</th>
                        </tr>
                     </thead>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">list</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>An expression that returns a list.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">variable</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>This is the variable that can be used from within the predicate.</p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">predicate</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p>A predicate that is tested against all items in the list.</p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH p =(n)--&gt;(b)
WHERE n.name = 'Alice' AND SINGLE (var IN nodes(p) WHERE var.eyes = 'blue')
RETURN p</code></pre><p>
               
            </p>
            <p>Exactly one node in every returned path has the <code class="literal">eyes</code> property set to <span class="strong"><strong>'blue'</strong></span>.
            </p>
            <div class="table" id="d0e29127">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.216.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">p</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">(0)-[KNOWS,0]-&gt;(1)</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (alice {name:'Alice', age: 38, eyes: 'brown'}),
                         (bob {name: 'Bob', age: 25, eyes: 'blue'}),
                         (charlie {name: 'Charlie', age: 53, eyes: 'green'}),
                         (daniel {name: 'Daniel', age: 54, eyes: 'brown'}),
                         (eskil {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
                  
                         (alice)-[:KNOWS]-&gt;(bob),
                         (alice)-[:KNOWS]-&gt;(charlie),
                         (bob)-[:KNOWS]-&gt;(daniel),
                         (charlie)-[:KNOWS]-&gt;(daniel),
                         (bob)-[:MARRIED]-&gt;(eskil)
                  
                  </span><span class="command"><strong>
                     MATCH p = (n)--&gt;(b)
                     WHERE n.name = 'Alice'
                     AND single(var IN nodes(p) WHERE var.eyes = 'blue')
                     RETURN p
                     </strong></span></p>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>