
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.2.9.&nbsp;Patterns - 3.2.&nbsp;Syntax</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <link rel="prev" href="../comments/index.html" title="3.2.8.&nbsp;Comments"></link>
      <link rel="next" href="../temporal/index.html" title="3.2.10.&nbsp;Temporal (Date/Time) values"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../comments/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Comments</a></span><span class="nav-current">
               <p class="nav-title hidden">3.2.9.&nbsp;Patterns</p></span><span class="nav-next"><a accesskey="n" href="../temporal/index.html">Temporal (Date/Time) values<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="cypher-patterns">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#cypher-patterns"></a>3.2.9.&nbsp;Patterns
                  </h3>
               </div>
            </div>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#cypher-pattern-node-introduction" title="3.2.9.1.&nbsp;Introduction">Introduction</a></li>
               <li class="listitem"><a class="link" href="index.html#cypher-pattern-node" title="3.2.9.2.&nbsp;Patterns for nodes">Patterns for nodes</a></li>
               <li class="listitem"><a class="link" href="index.html#cypher-pattern-related-nodes" title="3.2.9.3.&nbsp;Patterns for related nodes">Patterns for related nodes</a></li>
               <li class="listitem"><a class="link" href="index.html#cypher-pattern-label" title="3.2.9.4.&nbsp;Patterns for labels">Patterns for labels</a></li>
               <li class="listitem"><a class="link" href="index.html#cypher-pattern-properties" title="3.2.9.5.&nbsp;Specifying properties">Specifying properties</a></li>
               <li class="listitem"><a class="link" href="index.html#cypher-pattern-relationship" title="3.2.9.6.&nbsp;Patterns for relationships">Patterns for relationships</a></li>
               <li class="listitem"><a class="link" href="index.html#cypher-pattern-varlength" title="3.2.9.7.&nbsp;Variable-length pattern matching">Variable-length pattern matching</a></li>
               <li class="listitem"><a class="link" href="index.html#cypher-pattern-path-variables" title="3.2.9.8.&nbsp;Assigning to path variables">Assigning to path variables</a></li>
            </ul>
         </div>
         <section class="section" id="cypher-pattern-node-introduction">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-pattern-node-introduction"></a>3.2.9.1.&nbsp;Introduction
                     </h4>
                  </div>
               </div>
            </div>
            <p>Patterns and pattern-matching are at the very heart of Cypher, so being effective with Cypher requires a good understanding
               of patterns.
            </p>
            <p>Using patterns, you describe the shape of the data you&#8217;re looking for.
               For example, in the <code class="literal">MATCH</code> clause you describe the shape with a pattern, and Cypher will figure out how to get that data for you.
            </p>
            <p>The pattern describes the data using a form that is very similar to how one typically draws the shape of property graph data
               on a whiteboard: usually as circles (representing nodes) and arrows between them to represent relationships.
            </p>
            <p>Patterns appear in multiple places in Cypher: in <code class="literal">MATCH</code>, <code class="literal">CREATE</code> and <code class="literal">MERGE</code> clauses, and in pattern expressions.
                    Each of these is described in more detail in:
            </p>
            <div class="itemizedlist">
               <ul class="itemizedlist" style="list-style-type: disc; ">
                  <li class="listitem"><a class="xref" href="../../clauses/match/index.html" title="3.3.1.&nbsp;MATCH">Section&nbsp;3.3.1, &#8220;MATCH&#8221;</a></li>
                  <li class="listitem"><a class="xref" href="../../clauses/optional-match/index.html" title="3.3.2.&nbsp;OPTIONAL MATCH">Section&nbsp;3.3.2, &#8220;OPTIONAL MATCH&#8221;</a></li>
                  <li class="listitem"><a class="xref" href="../../clauses/create/index.html" title="3.3.11.&nbsp;CREATE">Section&nbsp;3.3.11, &#8220;CREATE&#8221;</a></li>
                  <li class="listitem"><a class="xref" href="../../clauses/merge/index.html" title="3.3.16.&nbsp;MERGE">Section&nbsp;3.3.16, &#8220;MERGE&#8221;</a></li>
                  <li class="listitem"><a class="xref" href="../../clauses/where/index.html#query-where-patterns" title="3.3.7.5.&nbsp;Using path patterns in WHERE">Section&nbsp;3.3.7.5, &#8220;Using path patterns in <code class="literal">WHERE</code>&#8221;</a></li>
               </ul>
            </div>
         </section>
         <section class="section" id="cypher-pattern-node">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-pattern-node"></a>3.2.9.2.&nbsp;Patterns for nodes
                     </h4>
                  </div>
               </div>
            </div>
            <p>The very simplest 'shape' that can be described in a pattern is a node.
                    A node is described using a pair of parentheses, and is typically given a name.
                    For example:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a)</code></pre><p>This simple pattern describes a single node, and names that node using the variable <code class="literal">a</code>.
            </p>
         </section>
         <section class="section" id="cypher-pattern-related-nodes">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-pattern-related-nodes"></a>3.2.9.3.&nbsp;Patterns for related nodes
                     </h4>
                  </div>
               </div>
            </div>
            <p>A more powerful construct is a pattern that describes multiple nodes and relationships between them.
               Cypher patterns describe relationships by employing an arrow between two nodes.
               For example:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a)--&gt;(b)</code></pre><p>This pattern describes a very simple data shape: two nodes, and a single relationship from one to the other.
               In this example, the two nodes are both named as <code class="literal">a</code> and <code class="literal">b</code> respectively, and the relationship is 'directed': it goes from <code class="literal">a</code> to <code class="literal">b</code>.
            </p>
            <p>This manner of describing nodes and relationships can be extended to cover an arbitrary number of nodes and the relationships
               between them, for example:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a)--&gt;(b)&lt;--(c)</code></pre><p>Such a series of connected nodes and relationships is called a "path".</p>
            <p>Note that the naming of the nodes in these patterns is only necessary should one need to refer to the same node again, either
               later in the pattern or elsewhere in the Cypher query.
               If this is not necessary, then the name may be omitted, as follows:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a)--&gt;()&lt;--(c)</code></pre></section>
         <section class="section" id="cypher-pattern-label">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-pattern-label"></a>3.2.9.4.&nbsp;Patterns for labels
                     </h4>
                  </div>
               </div>
            </div>
            <p>In addition to simply describing the shape of a node in the pattern, one can also describe attributes.
               The most simple attribute that can be described in the pattern is a label that the node must have.
               For example:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a:User)--&gt;(b)</code></pre><p>One can also describe a node that has multiple labels:</p><pre class="programlisting highlight"><code data-lang="cypher">(a:User:Admin)--&gt;(b)</code></pre></section>
         <section class="section" id="cypher-pattern-properties">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-pattern-properties"></a>3.2.9.5.&nbsp;Specifying properties
                     </h4>
                  </div>
               </div>
            </div>
            <p>Nodes and relationships are the fundamental structures in a graph. Neo4j uses properties on both of these to allow for far
               richer models.
            </p>
            <p>Properties can be expressed in patterns using a map-construct: curly brackets surrounding a number of key-expression pairs,
               separated by commas.
               E.g. a node with two properties on it would look like:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a {name: 'Andy', sport: 'Brazilian Ju-Jitsu'})</code></pre><p>A relationship with expectations on it is given by:</p><pre class="programlisting highlight"><code data-lang="cypher">(a)-[{blocked: false}]-&gt;(b)</code></pre><p>When properties appear in patterns, they add an additional constraint to the shape of the data.
               In the case of a <code class="literal">CREATE</code> clause, the properties will be set in the newly-created nodes and relationships.
               In the case of a <code class="literal">MERGE</code> clause, the properties will be used as additional constraints on the shape any existing data must have (the specified properties
               must exactly match any existing data in the graph).
               If no matching data is found, then <code class="literal">MERGE</code> behaves like <code class="literal">CREATE</code> and the properties will be set in the newly created nodes and relationships.
            </p>
            <p>Note that patterns supplied to <code class="literal">CREATE</code> may use a single parameter to specify properties, e.g: <code class="literal">CREATE (node $paramName)</code>.
               This is not possible with patterns used in other clauses, as Cypher needs to know the property names at the time the query
               is compiled, so that matching can be done effectively.
            </p>
         </section>
         <section class="section" id="cypher-pattern-relationship">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-pattern-relationship"></a>3.2.9.6.&nbsp;Patterns for relationships
                     </h4>
                  </div>
               </div>
            </div>
            <p>The simplest way to describe a relationship is by using the arrow between two nodes, as in the previous examples.
               Using this technique, you can describe that the relationship should exist and the directionality of it.
               If you don&#8217;t care about the direction of the relationship, the arrow head can be omitted, as exemplified by:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a)--(b)</code></pre><p>As with nodes, relationships may also be given names.
               In this case, a pair of square brackets is used to break up the arrow and the variable is placed between.
               For example:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a)-[r]-&gt;(b)</code></pre><p>Much like labels on nodes, relationships can have types.
               To describe a relationship with a specific type, you can specify this as follows:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a)-[r:REL_TYPE]-&gt;(b)</code></pre><p>Unlike labels, relationships can only have one type.
               But if we&#8217;d like to describe some data such that the relationship could have any one of a set of types, then they can all
               be listed in the pattern, separating them with the pipe symbol <code class="literal">|</code> like this:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a)-[r:TYPE1|TYPE2]-&gt;(b)</code></pre><p>Note that this form of pattern can only be used to describe existing data (ie. when using a pattern with <code class="literal">MATCH</code> or as an expression).
               It will not work with <code class="literal">CREATE</code> or <code class="literal">MERGE</code>, since it&#8217;s not possible to create a relationship with multiple types.
            </p>
            <p>As with nodes, the name of the relationship can always be omitted, as exemplified by:</p><pre class="programlisting highlight"><code data-lang="cypher">(a)-[:REL_TYPE]-&gt;(b)</code></pre></section>
         <section class="section" id="cypher-pattern-varlength">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-pattern-varlength"></a>3.2.9.7.&nbsp;Variable-length pattern matching
                     </h4>
                  </div>
               </div>
            </div>
            <div class="admonitionblock caution">
               <table>
                  <tbody>
                     <tr>
                        <td class="icon"><i class="fa icon-caution" title="caution"></i></td>
                        <td class="content">
                           <p>Variable length pattern matching in versions 2.1.x and earlier does not enforce relationship uniqueness for patterns described
                              within a single <code class="literal">MATCH</code> clause.
                              This means that a query such as the following: <code class="literal">MATCH (a)-[r]-&gt;(b), p = (a)-[*]-&gt;(c) RETURN *, relationships(p) AS rs</code> may include <code class="literal">r</code> as part of the <code class="literal">rs</code> set.
                              This behavior has changed in versions 2.2.0 and later, in such a way that <code class="literal">r</code> will be excluded from the result set, as this better adheres to the rules of relationship uniqueness as documented here <a class="xref" href="../../introduction/uniqueness/index.html" title="3.1.4.&nbsp;Uniqueness">Section&nbsp;3.1.4, &#8220;Uniqueness&#8221;</a>.
                              If you have a query pattern that needs to retrace relationships rather than ignoring them as the relationship uniqueness rules
                              normally dictate, you can accomplish this using multiple match clauses, as follows: <code class="literal">MATCH (a)-[r]-&gt;(b) MATCH p = (a)-[*]-&gt;(c) RETURN *, relationships(p)</code>.
                              This will work in all versions of Neo4j that support the <code class="literal">MATCH</code> clause, namely 2.0.0 and later.
                           </p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p>Rather than describing a long path using a sequence of many node and relationship descriptions in a pattern, many relationships
               (and the intermediate nodes) can be described by specifying a length in the relationship description of a pattern.
               For example:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a)-[*2]-&gt;(b)</code></pre><p>This describes a graph of three nodes and two relationship, all in one path (a path of length 2).
               This is equivalent to:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a)--&gt;()--&gt;(b)</code></pre><p>A range of lengths can also be specified: such relationship patterns are called 'variable length relationships'.
               For example:
            </p><pre class="programlisting highlight"><code data-lang="cypher">(a)-[*3..5]-&gt;(b)</code></pre><p>This is a minimum length of 3, and a maximum of 5.
               It describes a graph of either 4 nodes and 3 relationships, 5 nodes and 4 relationships or 6 nodes and 5 relationships, all
               connected together in a single path.
            </p>
            <p>Either bound can be omitted. For example, to describe paths of length 3 or more, use:</p><pre class="programlisting highlight"><code data-lang="cypher">(a)-[*3..]-&gt;(b)</code></pre><p>To describe paths of length 5 or less, use:</p><pre class="programlisting highlight"><code data-lang="cypher">(a)-[*..5]-&gt;(b)</code></pre><p>Both bounds can be omitted, allowing paths of any length to be described:</p><pre class="programlisting highlight"><code data-lang="cypher">(a)-[*]-&gt;(b)</code></pre><p>As a simple example, let&#8217;s take the graph and query below:</p>
            <div class="figure" id="d0e7801">
               <div class="figure-title">Figure&nbsp;3.3.&nbsp;Graph</div>
               <div class="figure-contents">
                  <div class="mediaobject"><img src="../../../images/Patterns-1.svg" alt="alt"></img></div>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (me)-[:KNOWS*1..2]-(remote_friend)
WHERE me.name = 'Filipa'
RETURN remote_friend.name</code></pre><p>
               
            </p>
            <div class="table" id="d0e7818">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.29.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">remote_friend.name</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>2 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Dilshad"</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Anders"</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a {name: 'Anders'}),
                  (b {name: 'Becky'}),
                  (c {name: 'Cesar'}),
                  (d {name: 'Dilshad'}),
                  (e {name: 'George'}),
                  (f {name: 'Filipa'}),
                  
                  (a)-[:KNOWS]-&gt;(b),
                  (a)-[:KNOWS]-&gt;(c),
                  (a)-[:KNOWS]-&gt;(d),
                  (b)-[:KNOWS]-&gt;(e),
                  (c)-[:KNOWS]-&gt;(e),
                  (d)-[:KNOWS]-&gt;(f)
                  
                  
                  
                  </span><span class="command"><strong>
                     MATCH (me)-[:KNOWS*1..2]-(remote_friend)
                     WHERE me.name = 'Filipa'
                     RETURN remote_friend.name
                     </strong></span></p>
            <p>This query finds data in the graph which a shape that fits the pattern: specifically a node (with the name property <span class="strong"><strong>'Filipa'</strong></span>) and then the <code class="literal">KNOWS</code> related nodes, one or two hops away.
               This is a typical example of finding first and second degree friends.
            </p>
            <p>Note that variable length relationships cannot be used with <code class="literal">CREATE</code> and <code class="literal">MERGE</code>.
            </p>
         </section>
         <section class="section" id="cypher-pattern-path-variables">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-pattern-path-variables"></a>3.2.9.8.&nbsp;Assigning to path variables
                     </h4>
                  </div>
               </div>
            </div>
            <p>As described above, a series of connected nodes and relationships is called a "path". Cypher allows paths to be named
               using an identifer, as exemplified by:
            </p><pre class="programlisting highlight"><code data-lang="cypher">p = (a)-[*3..5]-&gt;(b)</code></pre><p>You can do this in <code class="literal">MATCH</code>, <code class="literal">CREATE</code> and <code class="literal">MERGE</code>, but not when using patterns as expressions.
            </p>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>