
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.2.12.&nbsp;Maps - 3.2.&nbsp;Syntax</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="Cypher has solid support for maps."></meta>
      <link rel="prev" href="../lists/index.html" title="3.2.11.&nbsp;Lists"></link>
      <link rel="next" href="../spatial/index.html" title="3.2.13.&nbsp;Spatial values"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../lists/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Lists</a></span><span class="nav-current">
               <p class="nav-title hidden">3.2.12.&nbsp;Maps</p></span><span class="nav-next"><a accesskey="n" href="../spatial/index.html">Spatial values<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="cypher-maps">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#cypher-maps"></a>3.2.12.&nbsp;Maps
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>Cypher has solid support for maps.</p>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#cypher-literal-maps" title="3.2.12.1.&nbsp;Literal maps">Literal maps</a></li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#cypher-map-projection" title="3.2.12.2.&nbsp;Map projection">Map projection</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#cypher-map-projection-examples" title="Examples of map projections">Examples of map projection</a></li>
                     </ul>
                  </div>
               </li>
            </ul>
         </div>
         <p>The following graph is used for the examples below:</p>
         <div class="figure" id="d0e12996">
            <div class="figure-title">Figure&nbsp;3.5.&nbsp;Graph</div>
            <div class="figure-contents">
               <div class="mediaobject"><img src="../../../images/Maps-1.svg" alt="alt"></img></div>
            </div>
         </div>
         <div class="admonitionblock note">
            <table>
               <tbody>
                  <tr>
                     <td class="icon"><i class="fa icon-note" title="note"></i></td>
                     <td class="content">
                        <p>Information regarding property access operators such as <code class="literal">.</code> and <code class="literal">[]</code> can be found <a class="link" href="../operators/index.html#query-operators-map" title="3.2.7.9.&nbsp;Map operators">here</a>.
                           The behavior of the <code class="literal">[]</code> operator with respect to <code class="literal">null</code> is detailed <a class="link" href="../working-with-null/index.html#cypher-null-bracket-operator" title="3.2.14.4.&nbsp;The [] operator and null">here</a>.
                        </p>
                     </td>
                  </tr>
               </tbody>
            </table>
         </div>
         <section class="section" id="cypher-literal-maps">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-literal-maps"></a>3.2.12.1.&nbsp;Literal maps
                     </h4>
                  </div>
               </div>
            </div>
            <p>From Cypher, you can also construct maps.
               Through REST you will get JSON objects; in Java they will be <code class="literal">java.util.Map&lt;String,Object&gt;</code>.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">RETURN { key: 'Value', listKey: [{ inner: 'Map1' }, { inner: 'Map2' }]}</code></pre><p>
               
            </p>
            <div class="table" id="d0e13042">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.69.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">{ key: 'Value', listKey: [{ inner: 'Map1' }, { inner: 'Map2' }]}</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">{listKey -&gt; [{inner -&gt; "Map1"},{inner -&gt; "Map2"}], key -&gt; "Value"}</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (charlie:Person {name: 'Charlie Sheen',  realName: 'Carlos Irwin Est&eacute;vez'}),
                  (martin:Person {name: 'Martin Sheen'}),
                  (wallstreet:Movie {title: 'Wall Street', year: 1987}),
                  (reddawn:Movie {title: 'Red Dawn', year: 1984}),
                  (apocalypsenow:Movie {title: 'Apocalypse Now', year: 1979}),
                  
                  (charlie)-[:ACTED_IN]-&gt;(wallstreet),
                  (charlie)-[:ACTED_IN]-&gt;(reddawn),
                  (charlie)-[:ACTED_IN]-&gt;(apocalypsenow),
                  (martin)-[:ACTED_IN]-&gt;(wallstreet),
                  (martin)-[:ACTED_IN]-&gt;(apocalypsenow)
                  
                  
                  
                  </span><span class="command"><strong>
                     RETURN { key: 'Value', listKey: [{ inner: 'Map1' }, { inner: 'Map2' }]}
                     </strong></span></p>
         </section>
         <section class="section" id="cypher-map-projection">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#cypher-map-projection"></a>3.2.12.2.&nbsp;Map projection
                     </h4>
                  </div>
               </div>
            </div>
            <p>Cypher supports a concept called "map projections".
               It allows for easily constructing map projections from nodes, relationships and other map values.
            </p>
            <p>A map projection begins with the variable bound to the graph entity to be projected from, and contains a body of comma-separated
               map elements, enclosed by <code class="literal">{</code> and  <code class="literal">}</code>.
            </p>
            <p><code class="literal">map_variable {map_element, [, &#8230;&#8203;n]}</code></p>
            <p>A map element projects one or more key-value pairs to the map projection.
               There exist four different types of map projection elements:
            </p>
            <div class="itemizedlist">
               <ul class="itemizedlist" style="list-style-type: disc; ">
                  <li class="listitem">Property selector - Projects the property name as the key, and the value from the <code class="literal">map_variable</code> as the value for the projection.
                  </li>
                  <li class="listitem">Literal entry - This is a key-value pair, with the value being arbitrary expression <code class="literal">key: &lt;expression&gt;</code>.
                  </li>
                  <li class="listitem">Variable selector - Projects a variable, with the variable name as the key, and the value the variable is pointing to as the
                     value of the projection. Its syntax is just the variable.
                  </li>
                  <li class="listitem">All-properties selector - projects all key-value pairs from the <code class="literal">map_variable</code> value.
                  </li>
               </ul>
            </div>
            <p>Note that if the <code class="literal">map_variable</code> points to a <code class="literal">null</code> value, the whole map projection will evaluate to <code class="literal">null</code>.
            </p>
            <section class="section" id="cypher-map-projection-examples">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#cypher-map-projection-examples"></a>Examples of map projections
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Find <span class="strong"><strong>'Charlie Sheen'</strong></span> and return data about him and the movies he has acted in.
                  This example shows an example of map projection with a literal entry, which in turn also uses map projection inside the aggregating
                  <code class="literal">collect()</code>.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (actor:Person { name: 'Charlie Sheen' })-[:ACTED_IN]-&gt;(movie:Movie)
RETURN actor { .name, .realName, movies: collect(movie { .title, .year })}</code></pre><p>
                  
               </p>
               <div class="table" id="d0e13140">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.70.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">actor</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">{movies -&gt; [{year -&gt; 1979, title -&gt; "Apocalypse Now"},{year -&gt; 1984, title -&gt; "Red Dawn"},{year -&gt; 1987, title -&gt; "Wall Street"}],
                                    realName -&gt; "Carlos Irwin Est&eacute;vez", name -&gt; "Charlie Sheen"}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen',  realName: 'Carlos Irwin Est&eacute;vez'}),
                     (martin:Person {name: 'Martin Sheen'}),
                     (wallstreet:Movie {title: 'Wall Street', year: 1987}),
                     (reddawn:Movie {title: 'Red Dawn', year: 1984}),
                     (apocalypsenow:Movie {title: 'Apocalypse Now', year: 1979}),
                     
                     (charlie)-[:ACTED_IN]-&gt;(wallstreet),
                     (charlie)-[:ACTED_IN]-&gt;(reddawn),
                     (charlie)-[:ACTED_IN]-&gt;(apocalypsenow),
                     (martin)-[:ACTED_IN]-&gt;(wallstreet),
                     (martin)-[:ACTED_IN]-&gt;(apocalypsenow)
                     
                     
                     
                     </span><span class="command"><strong>
                        MATCH (actor:Person {name: 'Charlie Sheen'})-[:ACTED_IN]-&gt;(movie:Movie)
                        RETURN actor{ .name, .realName, movies: collect(movie{ .title, .year })}
                        </strong></span></p>
               <p>Find all persons that have acted in movies, and show number for each.
                  This example introduces an variable with the count, and uses a variable selector to project the value.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (actor:Person)-[:ACTED_IN]-&gt;(movie:Movie)
WITH actor, count(movie) AS nrOfMovies
RETURN actor { .name, nrOfMovies }</code></pre><p>
                  
               </p>
               <div class="table" id="d0e13178">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.71.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">actor</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>2 rows</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">{nrOfMovies -&gt; 2, name -&gt; "Martin Sheen"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">{nrOfMovies -&gt; 3, name -&gt; "Charlie Sheen"}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen',  realName: 'Carlos Irwin Est&eacute;vez'}),
                     (martin:Person {name: 'Martin Sheen'}),
                     (wallstreet:Movie {title: 'Wall Street', year: 1987}),
                     (reddawn:Movie {title: 'Red Dawn', year: 1984}),
                     (apocalypsenow:Movie {title: 'Apocalypse Now', year: 1979}),
                     
                     (charlie)-[:ACTED_IN]-&gt;(wallstreet),
                     (charlie)-[:ACTED_IN]-&gt;(reddawn),
                     (charlie)-[:ACTED_IN]-&gt;(apocalypsenow),
                     (martin)-[:ACTED_IN]-&gt;(wallstreet),
                     (martin)-[:ACTED_IN]-&gt;(apocalypsenow)
                     
                     
                     
                     </span><span class="command"><strong>
                        MATCH (actor:Person)-[:ACTED_IN]-&gt;(movie:Movie)
                        WITH actor, count(movie) as nrOfMovies
                        RETURN actor{ .name, nrOfMovies}
                        </strong></span></p>
               <p>Again, focusing on <span class="strong"><strong>'Charlie Sheen'</strong></span>, this time returning all properties from the node.
                  Here we use an all-properties selector to project all the node properties, and additionally, explicitly project the property
                  <code class="literal">age</code>.
                  Since this property does not exist on the node, a <code class="literal">null</code> value is projected instead.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (actor:Person { name: 'Charlie Sheen' })
RETURN actor { .*, .age }</code></pre><p>
                  
               </p>
               <div class="table" id="d0e13230">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.72.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">actor</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">{realName -&gt; "Carlos Irwin Est&eacute;vez", name -&gt; "Charlie Sheen", age -&gt; &lt;null&gt;}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen',  realName: 'Carlos Irwin Est&eacute;vez'}),
                     (martin:Person {name: 'Martin Sheen'}),
                     (wallstreet:Movie {title: 'Wall Street', year: 1987}),
                     (reddawn:Movie {title: 'Red Dawn', year: 1984}),
                     (apocalypsenow:Movie {title: 'Apocalypse Now', year: 1979}),
                     
                     (charlie)-[:ACTED_IN]-&gt;(wallstreet),
                     (charlie)-[:ACTED_IN]-&gt;(reddawn),
                     (charlie)-[:ACTED_IN]-&gt;(apocalypsenow),
                     (martin)-[:ACTED_IN]-&gt;(wallstreet),
                     (martin)-[:ACTED_IN]-&gt;(apocalypsenow)
                     
                     
                     
                     </span><span class="command"><strong>
                        MATCH (actor:Person {name: 'Charlie Sheen'})
                        RETURN actor{.*, .age}
                        </strong></span></p>
            </section>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>