
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.3.4.&nbsp;RETURN - 3.3.&nbsp;Clauses</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="The RETURN clause defines what to include in the query result set."></meta>
      <link rel="prev" href="../start/index.html" title="3.3.3.&nbsp;START"></link>
      <link rel="next" href="../with/index.html" title="3.3.5.&nbsp;WITH"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../start/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>START</a></span><span class="nav-current">
               <p class="nav-title hidden">3.3.4.&nbsp;RETURN</p></span><span class="nav-next"><a accesskey="n" href="../with/index.html">WITH<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-return">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-return"></a>3.3.4.&nbsp;RETURN
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>The <code class="literal">RETURN</code> clause defines what to include in the query result set.
            </p>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#return-introduction" title="3.3.4.1.&nbsp;Introduction">Introduction</a></li>
               <li class="listitem"><a class="link" href="index.html#return-nodes" title="3.3.4.2.&nbsp;Return nodes">Return nodes</a></li>
               <li class="listitem"><a class="link" href="index.html#return-relationships" title="3.3.4.3.&nbsp;Return relationships">Return relationships</a></li>
               <li class="listitem"><a class="link" href="index.html#return-property" title="3.3.4.4.&nbsp;Return property">Return property</a></li>
               <li class="listitem"><a class="link" href="index.html#return-all-elements" title="3.3.4.5.&nbsp;Return all elements">Return all elements</a></li>
               <li class="listitem"><a class="link" href="index.html#return-variable-with-uncommon-characters" title="3.3.4.6.&nbsp;Variable with uncommon characters">Variable with uncommon characters</a></li>
               <li class="listitem"><a class="link" href="index.html#return-column-alias" title="3.3.4.7.&nbsp;Column alias">Column alias</a></li>
               <li class="listitem"><a class="link" href="index.html#return-optional-properties" title="3.3.4.8.&nbsp;Optional properties">Optional properties</a></li>
               <li class="listitem"><a class="link" href="index.html#return-other-expressions" title="3.3.4.9.&nbsp;Other expressions">Other expressions</a></li>
               <li class="listitem"><a class="link" href="index.html#return-unique-results" title="3.3.4.10.&nbsp;Unique results">Unique results</a></li>
            </ul>
         </div>
         <section class="section" id="return-introduction">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#return-introduction"></a>3.3.4.1.&nbsp;Introduction
                     </h4>
                  </div>
               </div>
            </div>
            <p>In the <code class="literal">RETURN</code> part of your query, you define which parts of the pattern you are interested in.
               It can be nodes, relationships, or properties on these.
            </p>
            <div class="admonitionblock tip">
               <table>
                  <tbody>
                     <tr>
                        <td class="icon"><i class="fa icon-tip" title="tip"></i></td>
                        <td class="content">
                           <p>If what you actually want is the value of a property, make sure to not return the full node/relationship.
                              This will improve performance.
                           </p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <div class="figure" id="d0e17519">
               <div class="figure-title">Figure&nbsp;3.10.&nbsp;Graph</div>
               <div class="figure-contents">
                  <div class="mediaobject"><img src="../../../images/RETURN-1.svg" alt="alt"></img></div>
               </div>
            </div>
         </section>
         <section class="section" id="return-nodes">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#return-nodes"></a>3.3.4.2.&nbsp;Return nodes
                     </h4>
                  </div>
               </div>
            </div>
            <p>To return a node, list it in the <code class="literal">RETURN</code> statement.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n { name: 'B' })
RETURN n</code></pre><p>
               
            </p>
            <p>The example will return the node.</p>
            <div class="table" id="d0e17546">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.107.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">Node[1]{name:"B"}</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', happy: 'Yes!', age: 55}),
                         (b {name: 'B'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:BLOCKS]-&gt;(b)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n {name: 'B'})
                     RETURN n
                     </strong></span></p>
         </section>
         <section class="section" id="return-relationships">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#return-relationships"></a>3.3.4.3.&nbsp;Return relationships
                     </h4>
                  </div>
               </div>
            </div>
            <p>To return a relationship, just include it in the <code class="literal">RETURN</code> list.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n { name: 'A' })-[r:KNOWS]-&gt;(c)
RETURN r</code></pre><p>
               
            </p>
            <p>The relationship is returned by the example.</p>
            <div class="table" id="d0e17592">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.108.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">r</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">:KNOWS[0]{}</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', happy: 'Yes!', age: 55}),
                         (b {name: 'B'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:BLOCKS]-&gt;(b)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n {name: 'A'})-[r:KNOWS]-&gt;(c)
                     RETURN r
                     </strong></span></p>
         </section>
         <section class="section" id="return-property">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#return-property"></a>3.3.4.4.&nbsp;Return property
                     </h4>
                  </div>
               </div>
            </div>
            <p>To return a property, use the dot separator, like this:</p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n { name: 'A' })
RETURN n.name</code></pre><p>
               
            </p>
            <p>The value of the property <code class="literal">name</code> gets returned.
            </p>
            <div class="table" id="d0e17638">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.109.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n.name</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"A"</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', happy: 'Yes!', age: 55}),
                         (b {name: 'B'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:BLOCKS]-&gt;(b)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n {name: 'A'})
                     RETURN n.name
                     </strong></span></p>
         </section>
         <section class="section" id="return-all-elements">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#return-all-elements"></a>3.3.4.5.&nbsp;Return all elements
                     </h4>
                  </div>
               </div>
            </div>
            <p>When you want to return all nodes, relationships and paths found in a query, you can use the <code class="literal">*</code> symbol.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH p =(a { name: 'A' })-[r]-&gt;(b)
RETURN *</code></pre><p>
               
            </p>
            <p>This returns the two nodes, the relationship and the path used in the query.</p>
            <div class="table" id="d0e17684">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.110.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                     <col class="col_3"></col>
                     <col class="col_4"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">a</th>
                        <th style="text-align: left; vertical-align: top; ">b</th>
                        <th style="text-align: left; vertical-align: top; ">p</th>
                        <th style="text-align: left; vertical-align: top; ">r</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="4">
                           <p>2 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">Node[0]{name:"A",happy:"Yes!",age:55}</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">Node[1]{name:"B"}</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">(0)-[BLOCKS,1]-&gt;(1)</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">:BLOCKS[1]{}</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">Node[0]{name:"A",happy:"Yes!",age:55}</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">Node[1]{name:"B"}</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">(0)-[KNOWS,0]-&gt;(1)</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">:KNOWS[0]{}</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', happy: 'Yes!', age: 55}),
                         (b {name: 'B'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:BLOCKS]-&gt;(b)
                  
                  
                  </span><span class="command"><strong>
                     MATCH p = (a {name: 'A'})-[r]-&gt;(b)
                     RETURN *
                     </strong></span></p>
         </section>
         <section class="section" id="return-variable-with-uncommon-characters">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#return-variable-with-uncommon-characters"></a>3.3.4.6.&nbsp;Variable with uncommon characters
                     </h4>
                  </div>
               </div>
            </div>
            <p>To introduce a placeholder that is made up of characters that are not contained in the English alphabet, you can use the <code class="literal">`</code> to enclose the variable, like this:
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (`This isn\'t a common variable`)
WHERE `This isn\'t a common variable`.name = 'A'
RETURN `This isn\'t a common variable`.happy</code></pre><p>
               
            </p>
            <p>The node with name "A" is returned.</p>
            <div class="table" id="d0e17768">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.111.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">`This isn\'t a common variable`.happy</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Yes!"</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', happy: 'Yes!', age: 55}),
                         (b {name: 'B'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:BLOCKS]-&gt;(b)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (`This isn\'t a common variable`)
                              WHERE `This isn\'t a common variable`.name = 'A'
                              RETURN `This isn\'t a common variable`.happy
                     </strong></span></p>
         </section>
         <section class="section" id="return-column-alias">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#return-column-alias"></a>3.3.4.7.&nbsp;Column alias
                     </h4>
                  </div>
               </div>
            </div>
            <p>If the name of the column should be different from the expression used, you can rename it by using <code class="literal">AS</code> &lt;new name&gt;.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a { name: 'A' })
RETURN a.age AS SomethingTotallyDifferent</code></pre><p>
               
            </p>
            <p>Returns the age property of a node, but renames the column.</p>
            <div class="table" id="d0e17814">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.112.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">SomethingTotallyDifferent</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">55</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', happy: 'Yes!', age: 55}),
                         (b {name: 'B'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:BLOCKS]-&gt;(b)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (a {name: 'A'})
                     RETURN a.age AS SomethingTotallyDifferent
                     </strong></span></p>
         </section>
         <section class="section" id="return-optional-properties">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#return-optional-properties"></a>3.3.4.8.&nbsp;Optional properties
                     </h4>
                  </div>
               </div>
            </div>
            <p>If a property might or might not be there, you can still select it as usual.
               It will be treated as <code class="literal">null</code> if it is missing.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
RETURN n.age</code></pre><p>
               
            </p>
            <p>This example returns the age when the node has that property, or <code class="literal">null</code> if the property is not there.
            </p>
            <div class="table" id="d0e17863">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.113.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">n.age</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>2 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">55</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">&lt;null&gt;</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', happy: 'Yes!', age: 55}),
                         (b {name: 'B'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:BLOCKS]-&gt;(b)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n)
                     RETURN n.age
                     </strong></span></p>
         </section>
         <section class="section" id="return-other-expressions">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#return-other-expressions"></a>3.3.4.9.&nbsp;Other expressions
                     </h4>
                  </div>
               </div>
            </div>
            <p>Any expression can be used as a return item&#8201;&#8212;&#8201;literals, predicates, properties, functions, and everything else.</p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a { name: 'A' })
RETURN a.age &gt; 30, "I'm a literal",(a)--&gt;()</code></pre><p>
               
            </p>
            <p>Returns a predicate, a literal and function call with a pattern expression parameter.</p>
            <div class="table" id="d0e17911">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.114.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                     <col class="col_2"></col>
                     <col class="col_3"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">a.age &gt; 30</th>
                        <th style="text-align: left; vertical-align: top; ">"I'm a literal"</th>
                        <th style="text-align: left; vertical-align: top; ">(a)--&gt;()</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; " colspan="3">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">true</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"I'm a literal"</code></p>
                        </td>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">[(0)-[BLOCKS,1]-&gt;(1),(0)-[KNOWS,0]-&gt;(1)]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', happy: 'Yes!', age: 55}),
                         (b {name: 'B'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:BLOCKS]-&gt;(b)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (a {name: 'A'})
                     RETURN a.age &gt; 30, "I'm a literal", (a)--&gt;()
                     </strong></span></p>
         </section>
         <section class="section" id="return-unique-results">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#return-unique-results"></a>3.3.4.10.&nbsp;Unique results
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">DISTINCT</code> retrieves only unique rows depending on the columns that have been selected to output.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a { name: 'A' })--&gt;(b)
RETURN DISTINCT b</code></pre><p>
               
            </p>
            <p>The node named "B" is returned by the query, but only once.</p>
            <div class="table" id="d0e17970">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.115.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">b</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">Node[1]{name:"B"}</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  
                  CREATE (a {name: 'A', happy: 'Yes!', age: 55}),
                         (b {name: 'B'}),
                  
                         (a)-[:KNOWS]-&gt;(b),
                         (a)-[:BLOCKS]-&gt;(b)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (a {name: 'A'})--&gt;(b)
                     RETURN DISTINCT b
                     </strong></span></p>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>