
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.7.5.&nbsp;Shortest path planning - 3.7.&nbsp;Execution plans</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="Shortest path finding in Cypher and how it is planned."></meta>
      <link rel="prev" href="../operators/index.html" title="3.7.4.&nbsp;Operators"></link>
      <link rel="next" href="../../deprecations-additions-removals-compatibility/index.html" title="3.8.&nbsp;Deprecations, additions and compatibility"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../operators/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>Operators</a></span><span class="nav-current">
               <p class="nav-title hidden">3.7.5.&nbsp;Shortest path planning</p></span><span class="nav-next"><a accesskey="n" href="../../deprecations-additions-removals-compatibility/index.html">Deprecations, additions and compatibility<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-shortestpath-planning">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-shortestpath-planning"></a>3.7.5.&nbsp;Shortest path planning
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>Shortest path finding in Cypher and how it is planned.</p>
         </div>
         <p>Planning shortest paths in Cypher can lead to different query plans depending on the predicates that need
            to be evaluated. Internally, Neo4j will use a fast bidirectional breadth-first search algorithm if the
            predicates can be evaluated whilst searching for the path. Therefore, this fast algorithm will always
            be certain to return the right answer when there are universal predicates on the path; for example, when
            searching for the shortest path where all nodes have the <code class="literal">Person</code> label, or where there are no nodes with
            a <code class="literal">name</code> property.
         </p>
         <p>If the predicates need to inspect the whole path before deciding on whether it is valid or not, this fast
            algorithm cannot be relied on to find the shortest path, and Neo4j may have to resort to using a slower
            exhaustive depth-first search algorithm to find the path. This means that query plans for shortest path
            queries with non-universal predicates will include a fallback to running the exhaustive search to find
            the path should the fast algorithm not succeed. For example, depending on the data, an answer to a shortest
            path query with existential predicates&#8201;&#8212;&#8201;such as the requirement that at least one node contains the property
            <code class="literal">name='Charlie Sheen'</code>&#8201;&#8212;&#8201;may not be able to be found by the fast algorithm. In this case, Neo4j will fall back to using
            the exhaustive search to enumerate all paths and potentially return an answer.
         </p>
         <p>The running times of these two algorithms may differ by orders of magnitude, so it is important to ensure
            that the fast approach is used for time-critical queries.
         </p>
         <p>When the exhaustive search is planned, it is still only executed when the fast algorithm fails to find any
            matching paths. The fast algorithm is always executed first, since it is possible that it can find a valid
            path even though that could not be guaranteed at planning time.
         </p>
         <p>Please note that falling back to the exhaustive search may prove to be a very time consuming strategy in some
            cases; such as when there is no shortest path between two nodes.
            Therefore, in these cases, it is recommended to set <code class="literal">cypher.forbid_exhaustive_shortestpath</code> to <code class="literal">true</code>,
            as explained in <a href="https://neo4j.com/docs/operations-manual/3.4/reference/configuration-settings/#config_cypher.forbid_exhaustive_shortestpath" class="olink">Operations Manual &#8594; Configuration settings</a></p>
         <section class="section" id="_shortest_path_with_fast_algorithm">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#_shortest_path_with_fast_algorithm"></a>3.7.5.1.&nbsp;Shortest path with fast algorithm
                     </h4>
                  </div>
               </div>
            </div>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (ms:Person { name: 'Martin Sheen' }),(cs:Person { name: 'Charlie Sheen' }), p = shortestPath((ms)-[:ACTED_IN*]-(cs))
WHERE ALL (r IN relationships(p) WHERE exists(r.role))
RETURN p</code></pre><p>
               
            </p>
            <p>This query can be evaluated with the fast algorithm&#8201;&#8212;&#8201;there are no predicates that need to see the whole
               path before being evaluated.
            </p>
            <p><span class="formalpara-title">Query plan.&nbsp;</span>
               
            </p><pre class="screen highlight"><code>Compiler CYPHER 3.4

Planner COST

Runtime SLOTTED

Runtime version 3.4

+-------------------+----------------+------+---------+-----------------+-------------------+----------------------+------------------------+--------------------------------------------------------+
| Operator          | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Variables              | Other                                                  |
+-------------------+----------------+------+---------+-----------------+-------------------+----------------------+------------------------+--------------------------------------------------------+
| +ProduceResults   |              1 |    1 |       0 |              12 |                 1 |               0.9231 | anon[104], cs, ms, p   |                                                        |
| |                 +----------------+------+---------+-----------------+-------------------+----------------------+------------------------+--------------------------------------------------------+
| +ShortestPath     |              1 |    1 |       5 |              12 |                 1 |               0.9231 | anon[104], p -- cs, ms | {p0 : all(r IN relationships(p) WHERE exists(r.role))} |
| |                 +----------------+------+---------+-----------------+-------------------+----------------------+------------------------+--------------------------------------------------------+
| +CartesianProduct |              1 |    1 |       0 |              12 |                 1 |               0.9231 | ms -- cs               |                                                        |
| |\                +----------------+------+---------+-----------------+-------------------+----------------------+------------------------+--------------------------------------------------------+
| | +NodeIndexSeek  |              1 |    1 |       3 |              12 |                 0 |               1.0000 | cs                     | :Person(name)                                          |
| |                 +----------------+------+---------+-----------------+-------------------+----------------------+------------------------+--------------------------------------------------------+
| +NodeIndexSeek    |              1 |    1 |       3 |              12 |                 1 |               0.9231 | ms                     | :Person(name)                                          |
+-------------------+----------------+------+---------+-----------------+-------------------+----------------------+------------------------+--------------------------------------------------------+

Total database accesses: 11</code></pre><p>
               
            </p>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (charlie:Person {name: 'Charlie Sheen'}),
                         (martin:Person {name: 'Martin Sheen'}),
                         (michael:Person {name: 'Michael Douglas'}),
                         (oliver:Person {name: 'Oliver Stone'}),
                         (rob:Person {name: 'Rob Reiner'}),
                  
                         (wallStreet:Movie {title: 'Wall Street'}),
                         (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                         (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                         (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                         (oliver)-[:DIRECTED]-&gt;(wallStreet),
                  
                         (thePresident:Movie {title: 'The American President'}),
                         (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                         (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                         (rob)-[:DIRECTED]-&gt;(thePresident)
                  CREATE INDEX ON :Person(name)
                  
                  </span><span class="command"><strong>
                     MATCH (ms:Person {name: 'Martin Sheen'} ),
                           (cs:Person {name: 'Charlie Sheen'}),
                           p = shortestPath((ms)-[:ACTED_IN*]-(cs))
                     WHERE all(r IN relationships(p) WHERE exists(r.role))
                     RETURN p
                     </strong></span></p>
         </section>
         <section class="section" id="_shortest_path_with_additional_predicate_checks_on_the_paths">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#_shortest_path_with_additional_predicate_checks_on_the_paths"></a>3.7.5.2.&nbsp;Shortest path with additional predicate checks on the paths
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="_consider_using_the_exhaustive_search_as_a_fallback">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#_consider_using_the_exhaustive_search_as_a_fallback"></a>Consider using the exhaustive search as a fallback
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Predicates used in the <code class="literal">WHERE</code> clause that apply to the shortest path pattern are evaluated before deciding
                  what the shortest matching path is.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (cs:Person { name: 'Charlie Sheen' }),(ms:Person { name: 'Martin Sheen' }), p = shortestPath((cs)-[*]-(ms))
WHERE length(p)&gt; 1
RETURN p</code></pre><p>
                  
               </p>
               <p>This query, in contrast with the one above, needs to check that the whole path follows the predicate
                  before we know if it is valid or not, and so the query plan will also include the fallback to the slower
                  exhaustive search algorithm
               </p>
               <p><span class="formalpara-title">Query plan.&nbsp;</span>
                  
               </p><pre class="screen highlight"><code>Compiler CYPHER 3.4

Planner COST

Runtime SLOTTED

Runtime version 3.4

+--------------------------+----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| Operator                 | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Variables                        | Other                                                                                                                             |
+--------------------------+----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| +ProduceResults          |              0 |    1 |       0 |              10 |                 0 |               1.0000 | anon[86], anon[104], cs, ms, p   |                                                                                                                                   |
| |                        +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| +AntiConditionalApply    |              0 |    1 |       0 |              10 |                 0 |               1.0000 | anon[86], anon[104], cs, ms, p   |                                                                                                                                   |
| |\                       +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| | +Top                   |              0 |    0 |       0 |               0 |                 0 |               0.0000 | anon[86], anon[104], cs, ms, p   | anon[86]; 1                                                                                                                       |
| | |                      +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| | +Projection            |              0 |    0 |       0 |               0 |                 0 |               0.0000 | anon[86] -- anon[104], cs, ms, p | { : length(p)}                                                                                                                    |
| | |                      +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| | +Filter                |              0 |    0 |       0 |               0 |                 0 |               0.0000 | anon[104], cs, ms, p             | length(p) &gt; $`  AUTOINT2`                                                                                                         |
| | |                      +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| | +Projection            |              0 |    0 |       0 |               0 |                 0 |               0.0000 | anon[104], cs, ms, p             | {p : PathExpression(NodePathStep(NodeFromSlot(0,cs),MultiRelationshipPathStep(ReferenceFromSlot(1,anon[104]),BOTH,NilPathStep)))} |
| | |                      +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| | +VarLengthExpand(Into) |              0 |    0 |       0 |               0 |                 0 |               0.0000 | anon[104], cs, ms, p             | (cs)-[:*]-(ms)                                                                                                                    |
| | |                      +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| | +Argument              |              1 |    0 |       0 |               0 |                 0 |               0.0000 | anon[104], cs, ms, p             |                                                                                                                                   |
| |                        +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| +Apply                   |              1 |    1 |       0 |              10 |                 0 |               1.0000 | anon[104], cs, ms, p             |                                                                                                                                   |
| |\                       +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| | +Optional              |              1 |    1 |       0 |               8 |                 0 |               1.0000 | anon[104], cs, ms, p             |                                                                                                                                   |
| | |                      +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| | +ShortestPath          |              0 |    1 |       1 |               8 |                 0 |               1.0000 | anon[104], p -- cs, ms           | {p0 : length(p) &gt; $`  AUTOINT2`}                                                                                                  |
| | |                      +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| | +Argument              |              1 |    1 |       0 |               8 |                 0 |               1.0000 | cs, ms                           |                                                                                                                                   |
| |                        +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| +CartesianProduct        |              1 |    1 |       0 |              10 |                 0 |               1.0000 | cs -- ms                         |                                                                                                                                   |
| |\                       +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| | +NodeIndexSeek         |              1 |    1 |       3 |               9 |                 0 |               1.0000 | ms                               | :Person(name)                                                                                                                     |
| |                        +----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+
| +NodeIndexSeek           |              1 |    1 |       3 |              10 |                 0 |               1.0000 | cs                               | :Person(name)                                                                                                                     |
+--------------------------+----------------+------+---------+-----------------+-------------------+----------------------+----------------------------------+-----------------------------------------------------------------------------------------------------------------------------------+

Total database accesses: 7</code></pre><p>
                  
               </p>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     CREATE INDEX ON :Person(name)
                     
                     </span><span class="command"><strong>
                        MATCH (cs:Person {name: 'Charlie Sheen'}),
                              (ms:Person {name: 'Martin Sheen'}),
                              p = shortestPath((cs)-[*]-(ms))
                        WHERE length(p) &gt; 1
                        RETURN p
                        </strong></span></p>
               <p>The way the bigger exhaustive query plan works is by using <code class="literal">Apply</code>/<code class="literal">Optional</code> to ensure that when the
                  fast algorithm does not find any results, a <code class="literal">null</code> result is generated instead of simply stopping the result
                  stream.
                  On top of this, the planner will issue an <code class="literal">AntiConditionalApply</code>, which will run the exhaustive search
                  if the path variable is pointing to <code class="literal">null</code> instead of a path.
               </p>
               <p>An <code class="literal">ErrorPlan</code> operator will appear in the execution plan in cases where (i)
                  <code class="literal">cypher.forbid_exhaustive_shortestpath</code> is set to <code class="literal">true</code>, and (ii) the fast algorithm is not able to find the shortest path.
               </p>
            </section>
            <section class="section" id="_prevent_the_exhaustive_search_from_being_used_as_a_fallback">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#_prevent_the_exhaustive_search_from_being_used_as_a_fallback"></a>Prevent the exhaustive search from being used as a fallback
                        </h5>
                     </div>
                  </div>
               </div>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (cs:Person { name: 'Charlie Sheen' }),(ms:Person { name: 'Martin Sheen' }), p = shortestPath((cs)-[*]-(ms))
WITH p
WHERE length(p)&gt; 1
RETURN p</code></pre><p>
                  
               </p>
               <p>This query, just like the one above, needs to check that the whole path follows the predicate
                  before we know if it is valid or not. However, the inclusion of the <code class="literal">WITH</code> clause means that the query
                  plan will not include the fallback to the slower exhaustive search algorithm. Instead, any
                  paths found by the fast algorithm will subsequently be filtered, which may result in no answers
                   being returned.
               </p>
               <p><span class="formalpara-title">Query plan.&nbsp;</span>
                  
               </p><pre class="screen highlight"><code>Compiler CYPHER 3.4

Planner COST

Runtime SLOTTED

Runtime version 3.4

+-------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------------------------------+---------------------------------------+
| Operator          | Estimated Rows | Rows | DB Hits | Page Cache Hits | Page Cache Misses | Page Cache Hit Ratio | Variables                         | Other                                 |
+-------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------------------------------+---------------------------------------+
| +ProduceResults   |              1 |    1 |       0 |              10 |                 0 |               1.0000 | anon[136], anon[104], cs, ms, p   |                                       |
| |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------------------------------+---------------------------------------+
| +Filter           |              1 |    1 |       0 |              10 |                 0 |               1.0000 | anon[136], anon[104], cs, ms, p   | anon[136]                             |
| |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------------------------------+---------------------------------------+
| +Projection       |              1 |    1 |       0 |              10 |                 0 |               1.0000 | anon[136] -- anon[104], cs, ms, p | {p : p,  : length(p) &gt; $`  AUTOINT2`} |
| |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------------------------------+---------------------------------------+
| +ShortestPath     |              1 |    1 |       1 |              10 |                 0 |               1.0000 | anon[104], p -- cs, ms            | {}                                    |
| |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------------------------------+---------------------------------------+
| +CartesianProduct |              1 |    1 |       0 |              10 |                 0 |               1.0000 | cs -- ms                          |                                       |
| |\                +----------------+------+---------+-----------------+-------------------+----------------------+-----------------------------------+---------------------------------------+
| | +NodeIndexSeek  |              1 |    1 |       3 |               9 |                 0 |               1.0000 | ms                                | :Person(name)                         |
| |                 +----------------+------+---------+-----------------+-------------------+----------------------+-----------------------------------+---------------------------------------+
| +NodeIndexSeek    |              1 |    1 |       3 |              10 |                 0 |               1.0000 | cs                                | :Person(name)                         |
+-------------------+----------------+------+---------+-----------------+-------------------+----------------------+-----------------------------------+---------------------------------------+

Total database accesses: 7</code></pre><p>
                  
               </p>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE (charlie:Person {name: 'Charlie Sheen'}),
                            (martin:Person {name: 'Martin Sheen'}),
                            (michael:Person {name: 'Michael Douglas'}),
                            (oliver:Person {name: 'Oliver Stone'}),
                            (rob:Person {name: 'Rob Reiner'}),
                     
                            (wallStreet:Movie {title: 'Wall Street'}),
                            (charlie)-[:ACTED_IN {role: 'Bud Fox'}]-&gt;(wallStreet),
                            (martin)-[:ACTED_IN {role: 'Carl Fox'}]-&gt;(wallStreet),
                            (michael)-[:ACTED_IN {role: 'Gordon Gekko'}]-&gt;(wallStreet),
                            (oliver)-[:DIRECTED]-&gt;(wallStreet),
                     
                            (thePresident:Movie {title: 'The American President'}),
                            (martin)-[:ACTED_IN {role: 'A.J. MacInerney'}]-&gt;(thePresident),
                            (michael)-[:ACTED_IN {role: 'President Andrew Shepherd'}]-&gt;(thePresident),
                            (rob)-[:DIRECTED]-&gt;(thePresident)
                     CREATE INDEX ON :Person(name)
                     
                     </span><span class="command"><strong>
                        MATCH (cs:Person {name: 'Charlie Sheen'}),
                              (ms:Person {name: 'Martin Sheen'}),
                              p = shortestPath((cs)-[*]-(ms))
                        WITH p
                        WHERE length(p) &gt; 1
                        RETURN p
                        </strong></span></p>
            </section>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>