
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.3.18.&nbsp;CREATE UNIQUE - 3.3.&nbsp;Clauses</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="The CREATE UNIQUE clause is a mix of MATCH and CREATE&#8201;&#8212;&#8201;it will match what it can, and create what is missing."></meta>
      <link rel="prev" href="../call/index.html" title="3.3.17.&nbsp;CALL[&#8230;&#8203;YIELD]"></link>
      <link rel="next" href="../union/index.html" title="3.3.19.&nbsp;UNION"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../call/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>CALL[&#8230;&#8203;YIELD]</a></span><span class="nav-current">
               <p class="nav-title hidden">3.3.18.&nbsp;CREATE UNIQUE</p></span><span class="nav-next"><a accesskey="n" href="../union/index.html">UNION<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section deprecated" id="query-create-unique">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-create-unique"></a>3.3.18.&nbsp;CREATE UNIQUE
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>The <code class="literal">CREATE UNIQUE</code> clause is a mix of <code class="literal">MATCH</code> and <code class="literal">CREATE</code>&#8201;&#8212;&#8201;it will match what it can, and create what is missing.
            </p>
         </div>
         <div class="admonitionblock important">
            <table>
               <tbody>
                  <tr>
                     <td class="icon"><i class="fa icon-important" title="important"></i></td>
                     <td class="content">
                        <p>The <code class="literal">CREATE UNIQUE</code> clause was removed in Cypher 3.2.
                           Using the <code class="literal">CREATE UNIQUE</code> clause will cause the query to fall back to using Cypher 3.1.
                           Use <code class="literal"><a class="link" href="../merge/index.html" title="3.3.16.&nbsp;MERGE">MERGE</a></code> instead of <code class="literal">CREATE UNIQUE</code>; refer to the <a class="link" href="index.html#query-create-unique-introduction" title="3.3.18.1.&nbsp;Introduction">Introduction</a> for an example of how to achieve the same level of node and relationship uniqueness.
                        </p>
                     </td>
                  </tr>
               </tbody>
            </table>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#query-create-unique-introduction" title="3.3.18.1.&nbsp;Introduction">Introduction</a></li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-create-unique-nodes" title="3.3.18.2.&nbsp;Create unique nodes">Create unique nodes</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#create-unique-create-node-if-missing" title="Create node if missing">Create node if missing</a></li>
                        <li class="listitem"><a class="link" href="index.html#create-unique-create-nodes-with-values" title="Create nodes with values">Create nodes with values</a></li>
                        <li class="listitem"><a class="link" href="index.html#create-unique-create-labeled-node-if-missing" title="Create labeled node if missing">Create labeled node if missing</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-create-unique-relationships" title="3.3.18.3.&nbsp;Create unique relationships">Create unique relationships</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#create-unique-create-relationship-if-it-is-missing" title="Create relationship if it is missing">Create relationship if it is missing</a></li>
                        <li class="listitem"><a class="link" href="index.html#create-unique-create-relationship-with-values" title="Create relationship with values">Create relationship with values</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem"><a class="link" href="index.html#create-unique-describe-complex-pattern" title="3.3.18.4.&nbsp;Describe complex pattern">Describe complex pattern</a></li>
            </ul>
         </div>
         <section class="section" id="query-create-unique-introduction">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-create-unique-introduction"></a>3.3.18.1.&nbsp;Introduction
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">CREATE UNIQUE</code> is in the middle of <code class="literal">MATCH</code> and <code class="literal">CREATE</code>&#8201;&#8212;&#8201;it will match what it can, and create what is missing.
            </p>
            <p>We show in the following example how to express using <code class="literal">MERGE</code> the same level of uniqueness guaranteed by <code class="literal">CREATE UNIQUE</code> for nodes and relationships.
            </p>
            <p>Assume the original set of queries is given by:</p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (p:Person {name: 'Joe'})
RETURN p

MATCH (a:Person {name: 'Joe'})
CREATE UNIQUE (a)-[r:LIKES]-&gt;(b:Person {name: 'Jill'})-[r1:EATS]-&gt;(f:Food {name: 'Margarita Pizza'})
RETURN a

MATCH (a:Person {name: 'Joe'})
CREATE UNIQUE (a)-[r:LIKES]-&gt;(b:Person {name: 'Jill'})-[r1:EATS]-&gt;(f:Food {name: 'Banana'})
RETURN a</code></pre><p>This will create two <code class="literal">:Person</code> nodes, a <code class="literal">:LIKES</code> relationship between them, and two <code class="literal">:EATS</code> relationships from one of the <code class="literal">:Person</code> nodes to two <code class="literal">:Food</code> nodes.
               No node or relationship is duplicated.
            </p>
            <p>The following set of queries&#8201;&#8212;&#8201;using <code class="literal">MERGE</code>&#8201;&#8212;&#8201;will achieve the same result:
            </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (p:Person {name: 'Joe'})
RETURN p

MATCH (a:Person {name: 'Joe'})
MERGE (b:Person {name: 'Jill'})
MERGE (a)-[r:LIKES]-&gt;(b)
MERGE (b)-[r1:EATS]-&gt;(f:Food {name: 'Margarita Pizza'})
RETURN a

MATCH (a:Person {name: 'Joe'})
MERGE (b:Person {name: 'Jill'})
MERGE (a)-[r:LIKES]-&gt;(b)
MERGE (b)-[r1:EATS]-&gt;(f:Food {name: 'Banana'})
RETURN a</code></pre><p>We note that all these queries can also be combined into a single, larger query.</p>
            <p>The <code class="literal">CREATE UNIQUE</code> examples below use the following graph:
            </p>
            <div class="informalfigure">
               <div class="mediaobject"><img src="../../../images/cypher-createunique-graph.svg" alt="alt"></img></div>
            </div>
         </section>
         <section class="section" id="query-create-unique-nodes">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-create-unique-nodes"></a>3.3.18.2.&nbsp;Create unique nodes
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="create-unique-create-node-if-missing">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#create-unique-create-node-if-missing"></a>Create node if missing
                        </h5>
                     </div>
                  </div>
               </div>
               <p>If the pattern described needs a node, and it can&#8217;t be matched, a new node will be created.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[:LOVES]-(someone)
RETURN someone</code></pre><p>
                  
               </p>
               <p>The root node doesn&#8217;t have any <code class="literal">LOVES</code> relationships, and so a node is created, and also a relationship to that node.
               </p>
               <p class="queryresult"><span class="formalpara-title">Result.&nbsp;</span>
                  
               </p><pre class="screen highlight"><code>+------------+
| someone    |
+------------+
| Node[20]{} |
+------------+
1 row
Nodes created: 1
Relationships created: 1</code></pre><p class="queryresult">
                  
               </p>
            </section>
            <section class="section" id="create-unique-create-nodes-with-values">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#create-unique-create-nodes-with-values"></a>Create nodes with values
                        </h5>
                     </div>
                  </div>
               </div>
               <p>The pattern described can also contain values on the node. These are given using the following syntax: <code class="literal">prop: &lt;expression&gt;</code>.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[:X]-(leaf { name: 'D' })
RETURN leaf</code></pre><p>
                  
               </p>
               <p>No node connected with the root node has the name <code class="literal">D</code>, and so a new node is created to match the pattern.
               </p>
               <p class="queryresult"><span class="formalpara-title">Result.&nbsp;</span>
                  
               </p><pre class="screen highlight"><code>+--------------------+
| leaf               |
+--------------------+
| Node[20]{name:"D"} |
+--------------------+
1 row
Nodes created: 1
Relationships created: 1
Properties set: 1</code></pre><p class="queryresult">
                  
               </p>
            </section>
            <section class="section" id="create-unique-create-labeled-node-if-missing">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#create-unique-create-labeled-node-if-missing"></a>Create labeled node if missing
                        </h5>
                     </div>
                  </div>
               </div>
               <p>If the pattern described needs a labeled node and there is none with the given labels, Cypher will create a new one.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (a { name: 'A' })
CREATE UNIQUE (a)-[:KNOWS]-(c:blue)
RETURN c</code></pre><p>
                  
               </p>
               <p>The <span class="strong"><strong>'A'</strong></span> node is connected in a <code class="literal">KNOWS</code> relationship to the <span class="strong"><strong>'c'</strong></span> node, but since <span class="strong"><strong>'C'</strong></span> doesn&#8217;t have the <code class="literal">blue</code> label, a new node labeled as <code class="literal">blue</code> is created along with a <code class="literal">KNOWS</code> relationship from <span class="strong"><strong>'A'</strong></span> to it.
               </p>
               <p class="queryresult"><span class="formalpara-title">Result.&nbsp;</span>
                  
               </p><pre class="screen highlight"><code>+------------+
| c          |
+------------+
| Node[20]{} |
+------------+
1 row
Nodes created: 1
Relationships created: 1
Labels added: 1</code></pre><p class="queryresult">
                  
               </p>
            </section>
         </section>
         <section class="section" id="query-create-unique-relationships">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-create-unique-relationships"></a>3.3.18.3.&nbsp;Create unique relationships
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="create-unique-create-relationship-if-it-is-missing">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#create-unique-create-relationship-if-it-is-missing"></a>Create relationship if it is missing
                        </h5>
                     </div>
                  </div>
               </div>
               <p><code class="literal">CREATE UNIQUE</code> is used to describe the pattern that should be found or created.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (lft { name: 'A' }),(rgt)
WHERE rgt.name IN ['B', 'C']
CREATE UNIQUE (lft)-[r:KNOWS]-&gt;(rgt)
RETURN r</code></pre><p>
                  
               </p>
               <p>The left node is matched against the two right nodes. One relationship already exists and can be matched, and the other relationship
                  is created before it is returned.
               </p>
               <p class="queryresult"><span class="formalpara-title">Result.&nbsp;</span>
                  
               </p><pre class="screen highlight"><code>+--------------+
| r            |
+--------------+
| :KNOWS[20]{} |
| :KNOWS[3]{}  |
+--------------+
2 rows
Relationships created: 1</code></pre><p class="queryresult">
                  
               </p>
            </section>
            <section class="section" id="create-unique-create-relationship-with-values">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#create-unique-create-relationship-with-values"></a>Create relationship with values
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Relationships to be created can also be matched on values.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[r:X { since: 'forever' }]-()
RETURN r</code></pre><p>
                  
               </p>
               <p>In this example, we want the relationship to have a value, and since no such relationship can be found, a new node and relationship
                  are created. Note that since we are not interested in the created node, we don&#8217;t name it.
               </p>
               <p class="queryresult"><span class="formalpara-title">Result.&nbsp;</span>
                  
               </p><pre class="screen highlight"><code>+-------------------------+
| r                       |
+-------------------------+
| :X[20]{since:"forever"} |
+-------------------------+
1 row
Nodes created: 1
Relationships created: 1
Properties set: 1</code></pre><p class="queryresult">
                  
               </p>
            </section>
         </section>
         <section class="section" id="create-unique-describe-complex-pattern">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#create-unique-describe-complex-pattern"></a>3.3.18.4.&nbsp;Describe complex pattern
                     </h4>
                  </div>
               </div>
            </div>
            <p>The pattern described by <code class="literal">CREATE UNIQUE</code> can be separated by commas, just like in <code class="literal">MATCH</code> and <code class="literal">CREATE</code>.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[:FOO]-&gt;(x),(root)-[:BAR]-&gt;(x)
RETURN x</code></pre><p>
               
            </p>
            <p>This example pattern uses two paths, separated by a comma.</p>
            <p class="queryresult"><span class="formalpara-title">Result.&nbsp;</span>
               
            </p><pre class="screen highlight"><code>+------------+
| x          |
+------------+
| Node[20]{} |
+------------+
1 row
Nodes created: 1
Relationships created: 2</code></pre><p class="queryresult">
               
            </p>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>