
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.3.5.&nbsp;WITH - 3.3.&nbsp;Clauses</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="The WITH clause allows query parts to be chained together, piping the results from one to be used as starting points or criteria in the next."></meta>
      <link rel="prev" href="../return/index.html" title="3.3.4.&nbsp;RETURN"></link>
      <link rel="next" href="../unwind/index.html" title="3.3.6.&nbsp;UNWIND"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../return/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>RETURN</a></span><span class="nav-current">
               <p class="nav-title hidden">3.3.5.&nbsp;WITH</p></span><span class="nav-next"><a accesskey="n" href="../unwind/index.html">UNWIND<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-with">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-with"></a>3.3.5.&nbsp;WITH
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>The <code class="literal">WITH</code> clause allows query parts to be chained together, piping the results from one to be used as starting points or criteria in
               the next.
            </p>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#with-introduction" title="3.3.5.1.&nbsp;Introduction">Introduction</a></li>
               <li class="listitem"><a class="link" href="index.html#with-filter-on-aggregate-function-results" title="3.3.5.2.&nbsp;Filter on aggregate function results">Filter on aggregate function results</a></li>
               <li class="listitem"><a class="link" href="index.html#with-sort-results-before-using-collect-on-them" title="3.3.5.3.&nbsp;Sort results before using collect on them">Sort results before using collect on them</a></li>
               <li class="listitem"><a class="link" href="index.html#with-limit-branching-of-path-search" title="3.3.5.4.&nbsp;Limit branching of a path search">Limit branching of a path search</a></li>
            </ul>
         </div>
         <section class="section" id="with-introduction">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#with-introduction"></a>3.3.5.1.&nbsp;Introduction
                     </h4>
                  </div>
               </div>
            </div>
            <p>Using <code class="literal">WITH</code>, you can manipulate the output before it is passed on to the following query parts.
               The manipulations can be of the shape and/or number of entries in the result set.
            </p>
            <p>One common usage of <code class="literal">WITH</code> is to limit the number of entries that are then passed on to other <code class="literal">MATCH</code> clauses.
               By combining <code class="literal">ORDER BY</code> and <code class="literal">LIMIT</code>, it&#8217;s possible to get the top X entries by some criteria, and then bring in additional data from the graph.
            </p>
            <p>Another use is to filter on aggregated values.
               <code class="literal">WITH</code> is used to introduce aggregates which can then be used in predicates in <code class="literal">WHERE</code>.
               These aggregate expressions create new bindings in the results.
               <code class="literal">WITH</code> can also, like <code class="literal">RETURN</code>, alias expressions that are introduced into the results using the aliases as the binding name.
            </p>
            <p><code class="literal">WITH</code> is also used to separate reading from updating of the graph.
               Every part of a query must be either read-only or write-only.
               When going from a writing part to a reading part, the switch must be done with a <code class="literal">WITH</code> clause.
            </p>
            <div class="figure" id="d0e18067">
               <div class="figure-title">Figure&nbsp;3.11.&nbsp;Graph</div>
               <div class="figure-contents">
                  <div class="mediaobject"><img src="../../../images/WITH-1.svg" alt="alt"></img></div>
               </div>
            </div>
         </section>
         <section class="section" id="with-filter-on-aggregate-function-results">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#with-filter-on-aggregate-function-results"></a>3.3.5.2.&nbsp;Filter on aggregate function results
                     </h4>
                  </div>
               </div>
            </div>
            <p>Aggregated results have to pass through a <code class="literal">WITH</code> clause to be able to filter on.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (david { name: 'David' })--(otherPerson)--&gt;()
WITH otherPerson, count(*) AS foaf
WHERE foaf &gt; 1
RETURN otherPerson.name</code></pre><p>
               
            </p>
            <p>The name of the person connected to <span class="strong"><strong>'David'</strong></span> with the at least more than one outgoing relationship will be returned by the query.
            </p>
            <div class="table" id="d0e18097">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.116.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">otherPerson.name</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Anders"</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a {name: 'Anders'}),
                                  (b {name: 'Bossman'}),
                                  (c {name: 'Ceasar'}),
                                  (d {name: 'David'}),
                                  (e {name: 'George'}),
                  
                                  (a)-[:KNOWS]-&gt;(b),
                                  (a)-[:BLOCKS]-&gt;(c),
                                  (d)-[:KNOWS]-&gt;(a),
                                  (b)-[:KNOWS]-&gt;(e),
                                  (c)-[:KNOWS]-&gt;(e),
                                  (b)-[:BLOCKS]-&gt;(d)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (david {name: 'David'})--(otherPerson)--&gt;()
                     WITH otherPerson, count(*) AS foaf
                     WHERE foaf &gt; 1
                     RETURN otherPerson.name
                     </strong></span></p>
         </section>
         <section class="section" id="with-sort-results-before-using-collect-on-them">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#with-sort-results-before-using-collect-on-them"></a>3.3.5.3.&nbsp;Sort results before using collect on them
                     </h4>
                  </div>
               </div>
            </div>
            <p>You can sort your results before passing them to collect, thus sorting the resulting list.</p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n)
WITH n
ORDER BY n.name DESC LIMIT 3
RETURN collect(n.name)</code></pre><p>
               
            </p>
            <p>A list of the names of people in reverse order, limited to 3, is returned in a list.</p>
            <div class="table" id="d0e18140">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.117.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">collect(n.name)</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>1 row</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">["George","David","Ceasar"]</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a {name: 'Anders'}),
                                  (b {name: 'Bossman'}),
                                  (c {name: 'Ceasar'}),
                                  (d {name: 'David'}),
                                  (e {name: 'George'}),
                  
                                  (a)-[:KNOWS]-&gt;(b),
                                  (a)-[:BLOCKS]-&gt;(c),
                                  (d)-[:KNOWS]-&gt;(a),
                                  (b)-[:KNOWS]-&gt;(e),
                                  (c)-[:KNOWS]-&gt;(e),
                                  (b)-[:BLOCKS]-&gt;(d)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n)
                     WITH n
                     ORDER BY n.name DESC
                     LIMIT 3
                     RETURN collect(n.name)
                     </strong></span></p>
         </section>
         <section class="section" id="with-limit-branching-of-path-search">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#with-limit-branching-of-path-search"></a>3.3.5.4.&nbsp;Limit branching of a path search
                     </h4>
                  </div>
               </div>
            </div>
            <p>You can match paths, limit to a certain number, and then match again using those paths as a base, as well as any number of
               similar limited searches.
            </p>
            <p><span class="formalpara-title">Query.&nbsp;</span>
               
            </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (n { name: 'Anders' })--(m)
WITH m
ORDER BY m.name DESC LIMIT 1
MATCH (m)--(o)
RETURN o.name</code></pre><p>
               
            </p>
            <p>Starting at <span class="strong"><strong>'Anders'</strong></span>, find all matching nodes, order by name descending and get the top result, then find all the nodes connected to that top
               result, and return their names.
            </p>
            <div class="table" id="d0e18186">
               <table class="table queryresult" summary="Result" border="1">
                  <caption class="table-title">Table&nbsp;3.118.&nbsp;Result</caption>
                  <colgroup>
                     <col class="col_1"></col>
                  </colgroup>
                  <thead>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">o.name</th>
                     </tr>
                  </thead>
                  <tfoot>
                     <tr>
                        <th style="text-align: left; vertical-align: top; ">
                           <p>2 rows</p>
                        </th>
                     </tr>
                  </tfoot>
                  <tbody>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Bossman"</code></p>
                        </td>
                     </tr>
                     <tr>
                        <td style="text-align: left; vertical-align: top; ">
                           <p><code class="literal">"Anders"</code></p>
                        </td>
                     </tr>
                  </tbody>
               </table>
            </div>
            <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                  CREATE (a {name: 'Anders'}),
                                  (b {name: 'Bossman'}),
                                  (c {name: 'Ceasar'}),
                                  (d {name: 'David'}),
                                  (e {name: 'George'}),
                  
                                  (a)-[:KNOWS]-&gt;(b),
                                  (a)-[:BLOCKS]-&gt;(c),
                                  (d)-[:KNOWS]-&gt;(a),
                                  (b)-[:KNOWS]-&gt;(e),
                                  (c)-[:KNOWS]-&gt;(e),
                                  (b)-[:BLOCKS]-&gt;(d)
                  
                  
                  </span><span class="command"><strong>
                     MATCH (n {name: 'Anders'})--(m)
                     WITH m
                     ORDER BY m.name DESC
                     LIMIT 1
                     MATCH (m)--(o)
                     RETURN o.name
                     </strong></span></p>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>