
<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta charset="utf-8"></meta>
      <meta name="viewport" content="width=device-width, initial-scale=1.0"></meta>
      <title>3.3.16.&nbsp;MERGE - 3.3.&nbsp;Clauses</title>
      <link rel="stylesheet" type="text/css" href="../../../docbook.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/font-awesome/4.1.0/css/font-awesome.min.css"></link>
      <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Open+Sans:400,300,400italic,600,300italic"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/theme/neo.min.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/extra.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/chunked-base.css"></link>
      <link rel="stylesheet" type="text/css" href="../../../css/console.css"></link><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.2.0/jquery.min.js" type="text/javascript"></script><script src="../../../../../../../maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/codemirror.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/addon/runmode/runmode.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/javascript/javascript.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/shell/shell.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/python/python.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/xml/xml.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/clike/clike.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/cypher/cypher.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/properties/properties.min.js" type="text/javascript"></script><script src="../../../../../../../cdnjs.cloudflare.com/ajax/libs/codemirror/5.36.0/mode/groovy/groovy.min.js" type="text/javascript"></script><script src="../../../javascript/colorize.js" type="text/javascript"></script><script src="../../../javascript/tabs-for-chunked.js" type="text/javascript"></script><script src="../../../javascript/mp-nav.js" type="text/javascript"></script><script src="../../../javascript/versionswitcher.js" type="text/javascript"></script><script src="../../../javascript/version.js" type="text/javascript"></script><script src="https://s3-eu-west-1.amazonaws.com/alpha.neohq.net/docs/new-manual/assets/search.js" type="text/javascript"></script><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></meta>
      <meta name="description" content="The MERGE clause ensures that a pattern exists in the graph. Either the pattern already exists, or it needs to be created."></meta>
      <link rel="prev" href="../foreach/index.html" title="3.3.15.&nbsp;FOREACH"></link>
      <link rel="next" href="../call/index.html" title="3.3.17.&nbsp;CALL[&#8230;&#8203;YIELD]"></link>
      <link rel="shortcut icon" href="../../../../../../wp-content/themes/neo4jweb/favicon.ico"></link><script>
        $(document).ready(function() {
          CodeMirror.colorize();
          tabTheSource($('body'));
          var $header = $('header').first();
          $header.prepend(
            $('<a href="../../../index.html" id="logo"><img src="../../../../../../wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png" alt="Neo4j Logo"></img></a>')
          );
          var $sidebar = $('<div id="sidebar-wrapper"></div>');
          $.get('toc.html', function (d){
            $(d).appendTo($sidebar);
            highlightToc();
            highlightLibraryHeader();
          });
          $sidebar.insertAfter($('header').first());
        });
        </script></head>
   <body>
      <header>
         <div class="searchbox">
            <form id="search-form" class="search" name="search-form" role="search"><input id="search-form-input" name="q" title="search" type="search" lang="en" placeholder="Search Neo4j docs..." aria-label="Search Neo4j documentation" max-length="128" required="required"></input><input id="search-form-button" type="submit" value="Search"></input></form>
         </div>
         <ul class="documentation-library">
            <li><a href="https://neo4j.com/docs/operations-manual/3.4/">Operations Manual</a></li>
            <li><a href="../../../index.html">Developer Manual</a></li>
            <li><a href="https://neo4j.com/docs/ogm-manual/3.0/">OGM Manual</a></li>
            <li><a href="https://neo4j.com/docs/graph-algorithms/3.4/">Graph Algorithms</a></li>
            <li><a href="https://neo4j.com/docs/java-reference/3.4/">Java Reference</a></li>
         </ul>
         <nav id="header-nav"><span class="nav-previous"><a accesskey="p" href="../foreach/index.html"><span class="fa fa-long-arrow-left" aria-hidden="true"></span>FOREACH</a></span><span class="nav-current">
               <p class="nav-title hidden">3.3.16.&nbsp;MERGE</p></span><span class="nav-next"><a accesskey="n" href="../call/index.html">CALL[&#8230;&#8203;YIELD]<span class="fa fa-long-arrow-right" aria-hidden="true"></span></a></span></nav>
      </header>
      <div id="search-results" class="hidden"></div>
      <section class="section" id="query-merge">
         <div class="titlepage">
            <div>
               <div>
                  <h3 class="title"><a class="anchor" href="index.html#query-merge"></a>3.3.16.&nbsp;MERGE
                  </h3>
               </div>
            </div>
         </div>
         <div class="abstract">
            <p>The <code class="literal">MERGE</code> clause ensures that a pattern exists in the graph.
               Either the pattern already exists, or it needs to be created.
            </p>
         </div>
         <div class="itemizedlist">
            <ul class="itemizedlist" style="list-style-type: disc; ">
               <li class="listitem"><a class="link" href="index.html#query-merge-introduction" title="3.3.16.1.&nbsp;Introduction">Introduction</a></li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-merge-node-derived" title="3.3.16.2.&nbsp;Merge nodes">Merge nodes</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#merge-merge-single-node-with-a-label" title="Merge single node with a label">Merge single node with a label</a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-single-node-with-properties" title="Merge single node with properties">Merge single node with properties</a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-single-node-specifying-both-label-and-property" title="Merge single node specifying both label and property">Merge single node specifying both label and property</a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-single-node-derived-from-an-existing-node-property" title="Merge single node derived from an existing node property">Merge single node derived from an existing node property</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-merge-on-create-on-match" title="3.3.16.3.&nbsp;Use ON CREATE and ON MATCH">Use <code class="literal">ON CREATE</code> and <code class="literal">ON MATCH</code></a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#merge-merge-with-on-create" title="Merge with ON CREATE">Merge with <code class="literal">ON CREATE</code></a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-with-on-match" title="Merge with ON MATCH">Merge with <code class="literal">ON MATCH</code></a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-with-on-create-and-on-match" title="Merge with ON CREATE and ON MATCH">Merge with <code class="literal">ON CREATE</code> and <code class="literal">ON MATCH</code></a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-with-on-match-setting-multiple-properties" title="Merge with ON MATCH setting multiple properties">Merge with <code class="literal">ON MATCH</code> setting multiple properties</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-merge-relationships" title="3.3.16.4.&nbsp;Merge relationships">Merge relationships</a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#merge-merge-on-a-relationship" title="Merge on a relationship">Merge on a relationship</a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-on-multiple-relationships" title="Merge on multiple relationships">Merge on multiple relationships</a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-on-an-undirected-relationship" title="Merge on an undirected relationship">Merge on an undirected relationship</a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-on-a-relationship-between-two-existing-nodes" title="Merge on a relationship between two existing nodes">Merge on a relationship between two existing nodes</a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-on-a-relationship-between-an-existing-node-and-a-merged-node-derived-from-a-node-property" title="Merge on a relationship between an existing node and a merged node derived from a node property">Merge on a relationship between an existing node and a merged node derived from a node property</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem">
                  <p class="simpara"><a class="link" href="index.html#query-merge-using-unique-constraints" title="3.3.16.5.&nbsp;Using unique constraints with MERGE">Using unique constraints with <code class="literal">MERGE</code></a></p>
                  <div class="itemizedlist">
                     <ul class="itemizedlist" style="list-style-type: circle; ">
                        <li class="listitem"><a class="link" href="index.html#merge-merge-using-unique-constraints-creates-a-new-node-if-no-node-is-found" title="Merge using unique constraints creates a new node if no node is found">Merge using unique constraints creates a new node if no node is found</a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-using-unique-constraints-matches-an-existing-node" title="Merge using unique constraints matches an existing node">Merge using unique constraints matches an existing node</a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-with-unique-constraints-and-partial-matches" title="Merge with unique constraints and partial matches">Merge with unique constraints and partial matches</a></li>
                        <li class="listitem"><a class="link" href="index.html#merge-merge-with-unique-constraints-and-conflicting-matches" title="Merge with unique constraints and conflicting matches">Merge with unique constraints and conflicting matches</a></li>
                     </ul>
                  </div>
               </li>
               <li class="listitem"><a class="link" href="index.html#merge-using-map-parameters-with-merge" title="Using map parameters with MERGE">Using map parameters with <code class="literal">MERGE</code></a></li>
            </ul>
         </div>
         <section class="section" id="query-merge-introduction">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-merge-introduction"></a>3.3.16.1.&nbsp;Introduction
                     </h4>
                  </div>
               </div>
            </div>
            <p><code class="literal">MERGE</code> either matches existing nodes and binds them, or it creates new data and binds that.
               It&#8217;s like a combination of <code class="literal">MATCH</code> and <code class="literal">CREATE</code> that additionally allows you to specify what happens if the data was matched or created.
            </p>
            <p>For example, you can specify that the graph must contain a node for a user with a certain name.
               If there isn&#8217;t a node with the correct name, a new node will be created and its name property set.
            </p>
            <p>When using <code class="literal">MERGE</code> on full patterns, the behavior is that either the whole pattern matches, or the whole pattern is created.
               <code class="literal">MERGE</code> will not partially use existing patterns&#8201;&#8212;&#8201;it&#8217;s all or nothing.
               If partial matches are needed, this can be accomplished by splitting a pattern up into multiple <code class="literal">MERGE</code> clauses.
            </p>
            <p>As with <code class="literal">MATCH</code>, <code class="literal">MERGE</code> can match multiple occurrences of a pattern.
               If there are multiple matches, they will all be passed on to later stages of the query.
            </p>
            <p>The last part of <code class="literal">MERGE</code> is the <code class="literal">ON CREATE</code> and <code class="literal">ON MATCH</code>.
               These allow a query to express additional changes to the properties of a node or relationship, depending on if the element
               was <code class="literal">MATCH</code> -ed in the database or if it was <code class="literal">CREATE</code> -ed.
            </p>
            <p>The following graph is used for the examples below:</p>
            <div class="figure" id="d0e23794">
               <div class="figure-title">Figure&nbsp;3.20.&nbsp;Graph</div>
               <div class="figure-contents">
                  <div class="mediaobject"><img src="../../../images/MERGE-1.svg" alt="alt"></img></div>
               </div>
            </div>
         </section>
         <section class="section" id="query-merge-node-derived">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-merge-node-derived"></a>3.3.16.2.&nbsp;Merge nodes
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="merge-merge-single-node-with-a-label">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-single-node-with-a-label"></a>Merge single node with a label
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Merging a single node with the given label.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (robert:Critic)
RETURN robert, labels(robert)</code></pre><p>
                  
               </p>
               <p>A new node is created because there are no nodes labeled <code class="literal">Critic</code> in the database.
               </p>
               <div class="table" id="d0e23824">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.192.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">robert</th>
                           <th style="text-align: left; vertical-align: top; ">labels(robert)</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row
                                 Nodes created: 1
                                 Labels added: 1
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[20]{}</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">["Critic"]</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (robert:Critic)
                        RETURN robert, labels(robert)
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-single-node-with-properties">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-single-node-with-properties"></a>Merge single node with properties
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Merging a single node with properties where not all properties match any existing node.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (charlie { name: 'Charlie Sheen', age: 10 })
RETURN charlie</code></pre><p>
                  
               </p>
               <p>A new node with the name <span class="strong"><strong>'Charlie Sheen'</strong></span> will be created since not all properties matched the existing <span class="strong"><strong>'Charlie Sheen'</strong></span> node.
               </p>
               <div class="table" id="d0e23884">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.193.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">charlie</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row
                                 Nodes created: 1
                                 Properties set: 2
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[20]{name:"Charlie Sheen",age:10}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (charlie {name: 'Charlie Sheen', age: 10})
                        RETURN charlie
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-single-node-specifying-both-label-and-property">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-single-node-specifying-both-label-and-property"></a>Merge single node specifying both label and property
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Merging a single node with both label and property matching an existing node.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (michael:Person { name: 'Michael Douglas' })
RETURN michael.name, michael.bornIn</code></pre><p>
                  
               </p>
               <p><span class="strong"><strong>'Michael Douglas'</strong></span> will be matched and the <code class="literal">name</code> and  <code class="literal">bornIn</code> properties returned.
               </p>
               <div class="table" id="d0e23939">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.194.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">michael.name</th>
                           <th style="text-align: left; vertical-align: top; ">michael.bornIn</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Michael Douglas"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"New Jersey"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (michael:Person {name: 'Michael Douglas'})
                        RETURN michael.name, michael.bornIn
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-single-node-derived-from-an-existing-node-property">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-single-node-derived-from-an-existing-node-property"></a>Merge single node derived from an existing node property
                        </h5>
                     </div>
                  </div>
               </div>
               <p>For some property 'p' in each bound node in a set of nodes, a single new node is created for each unique value for 'p'.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (person:Person)
MERGE (city:City { name: person.bornIn })
RETURN person.name, person.bornIn, city</code></pre><p>
                  
               </p>
               <p>Three nodes labeled <code class="literal">City</code> are created, each of which contains a <code class="literal">name</code> property with the value of <span class="strong"><strong>'New York'</strong></span>, <span class="strong"><strong>'Ohio'</strong></span>, and <span class="strong"><strong>'New Jersey'</strong></span>, respectively.
                  Note that even though the <code class="literal">MATCH</code> clause results in three bound nodes having the value <span class="strong"><strong>'New York'</strong></span> for the <code class="literal">bornIn</code> property, only a single <span class="strong"><strong>'New York'</strong></span> node (i.e. a <code class="literal">City</code> node with a name of <span class="strong"><strong>'New York'</strong></span>) is created.
                  As the <span class="strong"><strong>'New York'</strong></span> node is not matched for the first bound node, it is created.
                  However, the newly-created <span class="strong"><strong>'New York'</strong></span> node is matched and bound for the second and third bound nodes."
               </p>
               <div class="table" id="d0e24028">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.195.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">person.name</th>
                           <th style="text-align: left; vertical-align: top; ">person.bornIn</th>
                           <th style="text-align: left; vertical-align: top; ">city</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>5 rows
                                 Nodes created: 3
                                 Properties set: 3
                                 Labels added: 3
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Charlie Sheen"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"New York"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[20]{name:"New York"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Martin Sheen"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Ohio"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[21]{name:"Ohio"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Michael Douglas"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"New Jersey"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[22]{name:"New Jersey"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Oliver Stone"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"New York"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[20]{name:"New York"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Rob Reiner"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"New York"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[20]{name:"New York"}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MATCH (person:Person)
                        MERGE (city:City {name: person.bornIn})
                        RETURN person.name, person.bornIn, city
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="query-merge-on-create-on-match">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-merge-on-create-on-match"></a>3.3.16.3.&nbsp;Use <code class="literal">ON CREATE</code> and <code class="literal">ON MATCH</code></h4>
                  </div>
               </div>
            </div>
            <section class="section" id="merge-merge-with-on-create">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-with-on-create"></a>Merge with <code class="literal">ON CREATE</code></h5>
                     </div>
                  </div>
               </div>
               <p>Merge a node and set properties if the node needs to be created.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (keanu:Person { name: 'Keanu Reeves' })
ON CREATE SET keanu.created = timestamp()
RETURN keanu.name, keanu.created</code></pre><p>
                  
               </p>
               <p>The query creates the <span class="strong"><strong>'keanu'</strong></span> node and sets a timestamp on creation time.
               </p>
               <div class="table" id="d0e24156">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.196.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">keanu.name</th>
                           <th style="text-align: left; vertical-align: top; ">keanu.created</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row
                                 Nodes created: 1
                                 Properties set: 2
                                 Labels added: 1
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Keanu Reeves"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1558547915684</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (keanu:Person {name: 'Keanu Reeves'})
                          ON CREATE SET keanu.created = timestamp()
                        RETURN keanu.name, keanu.created
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-with-on-match">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-with-on-match"></a>Merge with <code class="literal">ON MATCH</code></h5>
                     </div>
                  </div>
               </div>
               <p>Merging nodes and setting properties on found nodes.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (person:Person)
ON MATCH SET person.found = TRUE RETURN person.name, person.found</code></pre><p>
                  
               </p>
               <p>The query finds all the <code class="literal">Person</code> nodes, sets a property on them, and returns them.
               </p>
               <div class="table" id="d0e24217">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.197.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">person.name</th>
                           <th style="text-align: left; vertical-align: top; ">person.found</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>5 rows
                                 Properties set: 5
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Charlie Sheen"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">true</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Martin Sheen"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">true</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Michael Douglas"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">true</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Oliver Stone"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">true</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Rob Reiner"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">true</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (person:Person)
                          ON MATCH SET person.found = true
                        RETURN person.name, person.found
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-with-on-create-and-on-match">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-with-on-create-and-on-match"></a>Merge with <code class="literal">ON CREATE</code> and <code class="literal">ON MATCH</code></h5>
                     </div>
                  </div>
               </div>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (keanu:Person { name: 'Keanu Reeves' })
ON CREATE SET keanu.created = timestamp()
ON MATCH SET keanu.lastSeen = timestamp()
RETURN keanu.name, keanu.created, keanu.lastSeen</code></pre><p>
                  
               </p>
               <p>The query creates the <span class="strong"><strong>'keanu'</strong></span> node, and sets a timestamp on creation time.
                  If <span class="strong"><strong>'keanu'</strong></span> had already existed, a different property would have been set.
               </p>
               <div class="table" id="d0e24314">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.198.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">keanu.name</th>
                           <th style="text-align: left; vertical-align: top; ">keanu.created</th>
                           <th style="text-align: left; vertical-align: top; ">keanu.lastSeen</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>1 row
                                 Nodes created: 1
                                 Properties set: 2
                                 Labels added: 1
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Keanu Reeves"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1558547915989</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">&lt;null&gt;</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (keanu:Person {name: 'Keanu Reeves'})
                          ON CREATE SET keanu.created = timestamp()
                          ON MATCH SET keanu.lastSeen = timestamp()
                        RETURN keanu.name, keanu.created, keanu.lastSeen
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-with-on-match-setting-multiple-properties">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-with-on-match-setting-multiple-properties"></a>Merge with <code class="literal">ON MATCH</code> setting multiple properties
                        </h5>
                     </div>
                  </div>
               </div>
               <p>If multiple properties should be set, simply separate them with commas.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (person:Person)
ON MATCH SET person.found = TRUE , person.lastAccessed = timestamp()
RETURN person.name, person.found, person.lastAccessed</code></pre><p>
                  
               </p>
               <div class="table" id="d0e24378">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.199.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">person.name</th>
                           <th style="text-align: left; vertical-align: top; ">person.found</th>
                           <th style="text-align: left; vertical-align: top; ">person.lastAccessed</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>5 rows
                                 Properties set: 10
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Charlie Sheen"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">true</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1558547916143</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Martin Sheen"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">true</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1558547916143</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Michael Douglas"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">true</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1558547916143</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Oliver Stone"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">true</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1558547916143</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Rob Reiner"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">true</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">1558547916143</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (person:Person)
                        ON MATCH SET person.found = true, person.lastAccessed = timestamp()
                        RETURN person.name, person.found, person.lastAccessed
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="query-merge-relationships">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-merge-relationships"></a>3.3.16.4.&nbsp;Merge relationships
                     </h4>
                  </div>
               </div>
            </div>
            <section class="section" id="merge-merge-on-a-relationship">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-on-a-relationship"></a>Merge on a relationship
                        </h5>
                     </div>
                  </div>
               </div>
               <p><code class="literal">MERGE</code> can be used to match or create a relationship.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (charlie:Person { name: 'Charlie Sheen' }),(wallStreet:Movie { title: 'Wall Street' })
MERGE (charlie)-[r:ACTED_IN]-&gt;(wallStreet)
RETURN charlie.name, type(r), wallStreet.title</code></pre><p>
                  
               </p>
               <p><span class="strong"><strong>'Charlie Sheen'</strong></span> had already been marked as acting in <span class="strong"><strong>'Wall Street'</strong></span>, so the existing relationship is found and returned.
                  Note that in order to match or create a relationship when using <code class="literal">MERGE</code>, at least one bound node must be specified, which is done via the <code class="literal">MATCH</code> clause in the above example.
               </p>
               <div class="table" id="d0e24505">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.200.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">charlie.name</th>
                           <th style="text-align: left; vertical-align: top; ">type(r)</th>
                           <th style="text-align: left; vertical-align: top; ">wallStreet.title</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Charlie Sheen"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"ACTED_IN"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Wall Street"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MATCH (charlie:Person {name: 'Charlie Sheen'}), (wallStreet:Movie {title: 'Wall Street'})
                        MERGE (charlie)-[r:ACTED_IN]-&gt;(wallStreet)
                        RETURN charlie.name, type(r), wallStreet.title
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-on-multiple-relationships">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-on-multiple-relationships"></a>Merge on multiple relationships
                        </h5>
                     </div>
                  </div>
               </div>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (oliver:Person { name: 'Oliver Stone' }),(reiner:Person { name: 'Rob Reiner' })
MERGE (oliver)-[:DIRECTED]-&gt;(movie:Movie)&lt;-[:ACTED_IN]-(reiner)
RETURN movie</code></pre><p>
                  
               </p>
               <p>In our example graph, <span class="strong"><strong>'Oliver Stone'</strong></span> and <span class="strong"><strong>'Rob Reiner'</strong></span> have never worked together.
                  When we try to <code class="literal">MERGE</code> a "movie between them, Neo4j will not use any of the existing movies already connected to either person.
                  Instead, a new <span class="strong"><strong>'movie'</strong></span> node is created.
               </p>
               <div class="table" id="d0e24572">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.201.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">movie</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row
                                 Nodes created: 1
                                 Relationships created: 2
                                 Labels added: 1
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[20]{}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MATCH (oliver:Person {name: 'Oliver Stone'}), (reiner:Person {name: 'Rob Reiner'})
                        MERGE (oliver)-[:DIRECTED]-&gt;(movie:Movie)&lt;-[:ACTED_IN]-(reiner)
                        RETURN movie
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-on-an-undirected-relationship">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-on-an-undirected-relationship"></a>Merge on an undirected relationship
                        </h5>
                     </div>
                  </div>
               </div>
               <p><code class="literal">MERGE</code> can also be used with an undirected relationship.
                  When it needs to create a new one, it will pick a direction.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (charlie:Person { name: 'Charlie Sheen' }),(oliver:Person { name: 'Oliver Stone' })
MERGE (charlie)-[r:KNOWS]-(oliver)
RETURN r</code></pre><p>
                  
               </p>
               <p>As <span class="strong"><strong>'Charlie Sheen'</strong></span> and <span class="strong"><strong>'Oliver Stone'</strong></span> do not know each other this <code class="literal">MERGE</code> query will create a <code class="literal">KNOWS</code> relationship between them.
                  The direction of the created relationship is arbitrary.
               </p>
               <div class="table" id="d0e24635">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.202.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">r</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row
                                 Relationships created: 1
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">:KNOWS[20]{}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MATCH (charlie:Person {name: 'Charlie Sheen'}), (oliver:Person {name: 'Oliver Stone'})
                        MERGE (charlie)-[r:KNOWS]-(oliver)
                        RETURN r
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-on-a-relationship-between-two-existing-nodes">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-on-a-relationship-between-two-existing-nodes"></a>Merge on a relationship between two existing nodes
                        </h5>
                     </div>
                  </div>
               </div>
               <p><code class="literal">MERGE</code> can be used in conjunction with preceding <code class="literal">MATCH</code> and <code class="literal">MERGE</code> clauses to create a relationship between two bound nodes 'm' and 'n', where 'm' is returned by <code class="literal">MATCH</code> and 'n' is created or matched by the earlier <code class="literal">MERGE</code>.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (person:Person)
MERGE (city:City { name: person.bornIn })
MERGE (person)-[r:BORN_IN]-&gt;(city)
RETURN person.name, person.bornIn, city</code></pre><p>
                  
               </p>
               <p>This builds on the example from <a class="xref" href="index.html#merge-merge-single-node-derived-from-an-existing-node-property" title="Merge single node derived from an existing node property">the section called &#8220;Merge single node derived from an existing node property&#8221;</a>.
                  The second <code class="literal">MERGE</code> creates a <code class="literal">BORN_IN</code> relationship between each person and a city corresponding to the value of the person&#8217;s <code class="literal">bornIn</code> property. <span class="strong"><strong>'Charlie Sheen'</strong></span>, <span class="strong"><strong>'Rob Reiner'</strong></span> and <span class="strong"><strong>'Oliver Stone'</strong></span> all have a <code class="literal">BORN_IN</code> relationship to the 'same' <code class="literal">City</code> node (<span class="strong"><strong>'New York'</strong></span>).
               </p>
               <div class="table" id="d0e24723">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.203.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">person.name</th>
                           <th style="text-align: left; vertical-align: top; ">person.bornIn</th>
                           <th style="text-align: left; vertical-align: top; ">city</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>5 rows
                                 Nodes created: 3
                                 Relationships created: 5
                                 Properties set: 3
                                 Labels added: 3
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Charlie Sheen"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"New York"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[20]{name:"New York"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Martin Sheen"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Ohio"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[21]{name:"Ohio"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Michael Douglas"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"New Jersey"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[22]{name:"New Jersey"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Oliver Stone"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"New York"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[20]{name:"New York"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Rob Reiner"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"New York"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[20]{name:"New York"}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MATCH (person:Person)
                        MERGE (city:City {name: person.bornIn})
                        MERGE (person)-[r:BORN_IN]-&gt;(city)
                        RETURN person.name, person.bornIn, city
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-on-a-relationship-between-an-existing-node-and-a-merged-node-derived-from-a-node-property">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-on-a-relationship-between-an-existing-node-and-a-merged-node-derived-from-a-node-property"></a>Merge on a relationship between an existing node and a merged node derived from a node property
                        </h5>
                     </div>
                  </div>
               </div>
               <p><code class="literal">MERGE</code> can be used to simultaneously create both a new node 'n' and a relationship between a bound node 'm' and 'n'.
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MATCH (person:Person)
MERGE (person)-[r:HAS_CHAUFFEUR]-&gt;(chauffeur:Chauffeur { name: person.chauffeurName })
RETURN person.name, person.chauffeurName, chauffeur</code></pre><p>
                  
               </p>
               <p>As <code class="literal">MERGE</code> found no matches&#8201;&#8212;&#8201;in our example graph, there are no nodes labeled with <code class="literal">Chauffeur</code> and no <code class="literal">HAS_CHAUFFEUR</code> relationships&#8201;&#8212;&#8201;<code class="literal">MERGE</code> creates five nodes labeled with <code class="literal">Chauffeur</code>, each of which contains a <code class="literal">name</code> property whose value corresponds to each matched <code class="literal">Person</code> node&#8217;s <code class="literal">chauffeurName</code> property value.
                  <code class="literal">MERGE</code> also creates a <code class="literal">HAS_CHAUFFEUR</code> relationship between each <code class="literal">Person</code> node and the newly-created corresponding <code class="literal">Chauffeur</code> node.
                  As <span class="strong"><strong>'Charlie Sheen'</strong></span> and <span class="strong"><strong>'Michael Douglas'</strong></span> both have a chauffeur with the same name&#8201;&#8212;&#8201;<span class="strong"><strong>'John Brown'</strong></span>&#8201;&#8212;&#8201;a new node is created in each case, resulting in 'two' <code class="literal">Chauffeur</code> nodes having a <code class="literal">name</code> of <span class="strong"><strong>'John Brown'</strong></span>, correctly denoting the fact that even though the <code class="literal">name</code> property may be identical, these are two separate people.
                  This is in contrast to the example shown above in <a class="xref" href="index.html#merge-merge-on-a-relationship-between-two-existing-nodes" title="Merge on a relationship between two existing nodes">the section called &#8220;Merge on a relationship between two existing nodes&#8221;</a>, where we used the first <code class="literal">MERGE</code> to bind the <code class="literal">City</code> nodes to prevent them from being recreated (and thus duplicated) in the second <code class="literal">MERGE</code>.
               </p>
               <div class="table" id="d0e24910">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.204.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                        <col class="col_3"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">person.name</th>
                           <th style="text-align: left; vertical-align: top; ">person.chauffeurName</th>
                           <th style="text-align: left; vertical-align: top; ">chauffeur</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="3">
                              <p>5 rows
                                 Nodes created: 5
                                 Relationships created: 5
                                 Properties set: 5
                                 Labels added: 5
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Charlie Sheen"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"John Brown"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[20]{name:"John Brown"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Martin Sheen"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Bob Brown"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[21]{name:"Bob Brown"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Michael Douglas"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"John Brown"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[22]{name:"John Brown"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Oliver Stone"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Bill White"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[23]{name:"Bill White"}</code></p>
                           </td>
                        </tr>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Rob Reiner"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Ted Green"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">Node[24]{name:"Ted Green"}</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MATCH (person:Person)
                        MERGE (person)-[r:HAS_CHAUFFEUR]-&gt;(chauffeur:Chauffeur {name: person.chauffeurName})
                        RETURN person.name, person.chauffeurName, chauffeur
                        </strong></span></p>
            </section>
         </section>
         <section class="section" id="query-merge-using-unique-constraints">
            <div class="titlepage">
               <div>
                  <div>
                     <h4 class="title"><a class="anchor" href="index.html#query-merge-using-unique-constraints"></a>3.3.16.5.&nbsp;Using unique constraints with <code class="literal">MERGE</code></h4>
                  </div>
               </div>
            </div>
            <p>Cypher prevents getting conflicting results from <code class="literal">MERGE</code> when using patterns that involve unique constraints.
               In this case, there must be at most one node that matches that pattern.
            </p>
            <p>For example, given two unique constraints on <code class="literal">:Person(id)</code> and <code class="literal">:Person(ssn)</code>, a query such as <code class="literal">MERGE (n:Person {id: 12, ssn: 437})</code> will fail, if there are two different nodes (one with <code class="literal">id</code> 12 and one with <code class="literal">ssn</code> 437) or if there is only one node with only one of the properties.
               In other words, there must be exactly one node that matches the pattern, or no matching nodes.
            </p>
            <p>Note that the following examples assume the existence of unique constraints that have been created using:</p><pre class="programlisting highlight"><code data-lang="cypher">CREATE CONSTRAINT ON (n:Person) ASSERT n.name IS UNIQUE;
CREATE CONSTRAINT ON (n:Person) ASSERT n.role IS UNIQUE;</code></pre><section class="section" id="merge-merge-using-unique-constraints-creates-a-new-node-if-no-node-is-found">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-using-unique-constraints-creates-a-new-node-if-no-node-is-found"></a>Merge using unique constraints creates a new node if no node is found
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Merge using unique constraints creates a new node if no node is found.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (laurence:Person { name: 'Laurence Fishburne' })
RETURN laurence.name</code></pre><p>
                  
               </p>
               <p>The query creates the <span class="strong"><strong>'laurence'</strong></span> node.
                  If <span class="strong"><strong>'laurence'</strong></span> had already existed, <code class="literal">MERGE</code> would just match the existing node.
               </p>
               <div class="table" id="d0e25067">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.205.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">laurence.name</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">
                              <p>1 row
                                 Nodes created: 1
                                 Properties set: 1
                                 Labels added: 1
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Laurence Fishburne"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (laurence:Person {name: 'Laurence Fishburne'})
                        RETURN laurence.name
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-using-unique-constraints-matches-an-existing-node">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-using-unique-constraints-matches-an-existing-node"></a>Merge using unique constraints matches an existing node
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Merge using unique constraints matches an existing node.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (oliver:Person { name: 'Oliver Stone' })
RETURN oliver.name, oliver.bornIn</code></pre><p>
                  
               </p>
               <p>The <span class="strong"><strong>'oliver'</strong></span> node already exists, so <code class="literal">MERGE</code> just matches it.
               </p>
               <div class="table" id="d0e25122">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.206.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">oliver.name</th>
                           <th style="text-align: left; vertical-align: top; ">oliver.bornIn</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row</p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Oliver Stone"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"New York"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (oliver:Person {name: 'Oliver Stone'})
                        RETURN oliver.name, oliver.bornIn
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-with-unique-constraints-and-partial-matches">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-with-unique-constraints-and-partial-matches"></a>Merge with unique constraints and partial matches
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Merge using unique constraints fails when finding partial matches.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (michael:Person { name: 'Michael Douglas', role: 'Gordon Gekko' })
RETURN michael</code></pre><p>
                  
               </p>
               <p>While there is a matching unique <span class="strong"><strong>'michael'</strong></span> node with the name <span class="strong"><strong>'Michael Douglas'</strong></span>, there is no unique node with the role of <span class="strong"><strong>'Gordon Gekko'</strong></span> and <code class="literal">MERGE</code> fails to match.
               </p>
               <p><span class="formalpara-title">Error message.&nbsp;</span>
                  
               </p><pre class="screen highlight"><code>Merge did not find a matching node oliver and can not create a new node due to
conflicts with existing unique nodes</code></pre><p>
                  
               </p>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (michael:Person {name: 'Michael Douglas', role: 'Gordon Gekko'})
                        RETURN michael
                        </strong></span></p>
            </section>
            <section class="section" id="merge-merge-with-unique-constraints-and-conflicting-matches">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-merge-with-unique-constraints-and-conflicting-matches"></a>Merge with unique constraints and conflicting matches
                        </h5>
                     </div>
                  </div>
               </div>
               <p>Merge using unique constraints fails when finding conflicting matches.</p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (oliver:Person { name: 'Oliver Stone', role: 'Gordon Gekko' })
RETURN oliver</code></pre><p>
                  
               </p>
               <p>While there is a matching unique <span class="strong"><strong>'oliver'</strong></span> node with the name <span class="strong"><strong>'Oliver Stone'</strong></span>, there is also another  unique node with the role of <span class="strong"><strong>'Gordon Gekko'</strong></span> and <code class="literal">MERGE</code> fails to match.
               </p>
               <p><span class="formalpara-title">Error message.&nbsp;</span>
                  
               </p><pre class="screen highlight"><code>Merge did not find a matching node oliver and can not create a new node due to
conflicts with existing unique nodes</code></pre><p>
                  
               </p>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (oliver:Person {name: 'Oliver Stone', role: 'Gordon Gekko'})
                        RETURN oliver
                        </strong></span></p>
            </section>
            <section class="section" id="merge-using-map-parameters-with-merge">
               <div class="titlepage">
                  <div>
                     <div>
                        <h5 class="title"><a class="anchor" href="index.html#merge-using-map-parameters-with-merge"></a>Using map parameters with <code class="literal">MERGE</code></h5>
                     </div>
                  </div>
               </div>
               <p><code class="literal">MERGE</code> does not support map parameters the same way <code class="literal">CREATE</code> does.
                  To use map parameters with <code class="literal">MERGE</code>, it is necessary to explicitly use the expected properties, such as in the following example.
                  For more information on parameters, see <a class="xref" href="../../syntax/parameters/index.html" title="3.2.6.&nbsp;Parameters">Section&nbsp;3.2.6, &#8220;Parameters&#8221;</a>.
               </p>
               <p><span class="formalpara-title">Parameters.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="javascript">{
  "param" : {
    "name" : "Keanu Reeves",
    "role" : "Neo"
  }
}</code></pre><p>
                  
               </p>
               <p><span class="formalpara-title">Query.&nbsp;</span>
                  
               </p><pre class="programlisting highlight"><code data-lang="cypher">MERGE (person:Person { name: $param.name, role: $param.role })
RETURN person.name, person.role</code></pre><p>
                  
               </p>
               <div class="table" id="d0e25276">
                  <table class="table queryresult" summary="Result" border="1">
                     <caption class="table-title">Table&nbsp;3.207.&nbsp;Result</caption>
                     <colgroup>
                        <col class="col_1"></col>
                        <col class="col_2"></col>
                     </colgroup>
                     <thead>
                        <tr>
                           <th style="text-align: left; vertical-align: top; ">person.name</th>
                           <th style="text-align: left; vertical-align: top; ">person.role</th>
                        </tr>
                     </thead>
                     <tfoot>
                        <tr>
                           <th style="text-align: left; vertical-align: top; " colspan="2">
                              <p>1 row
                                 Nodes created: 1
                                 Properties set: 2
                                 Labels added: 1
                              </p>
                           </th>
                        </tr>
                     </tfoot>
                     <tbody>
                        <tr>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Keanu Reeves"</code></p>
                           </td>
                           <td style="text-align: left; vertical-align: top; ">
                              <p><code class="literal">"Neo"</code></p>
                           </td>
                        </tr>
                     </tbody>
                  </table>
               </div>
               <p class="cypherconsole"><span class="formalpara-title">Try this query live.&nbsp;</span><span class="database">
                     CREATE CONSTRAINT ON (person:Person) ASSERT person.name IS UNIQUE
                     CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE
                     CREATE
                      (charlie:Person {name: 'Charlie Sheen', bornIn: 'New York', chauffeurName: 'John Brown'}),
                      (martin:Person  {name: 'Martin Sheen', bornIn: 'Ohio', chauffeurName: 'Bob Brown'}),
                      (michael:Person {name: 'Michael Douglas', bornIn: 'New Jersey', chauffeurName: 'John Brown'}),
                      (oliver:Person  {name: 'Oliver Stone', bornIn: 'New York', chauffeurName: 'Bill White'}),
                      (rob:Person     {name: 'Rob Reiner', bornIn: 'New York', chauffeurName: 'Ted Green'}),
                      (wallStreet:Movie           {title: 'Wall Street'}),
                      (theAmericanPresident:Movie {title: 'The American President'}),
                      (charlie)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(wallStreet),
                      (michael)-[:ACTED_IN]-&gt;(wallStreet),
                      (martin)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (michael)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (oliver)-[:ACTED_IN]-&gt;(wallStreet),
                      (rob)-[:ACTED_IN]-&gt;(theAmericanPresident),
                      (charlie)-[:FATHER]-&gt;(martin)
                     
                     </span><span class="command"><strong>
                        MERGE (person:Person {name: $param.name, role: $param.role})
                        RETURN person.name, person.role
                        </strong></span></p>
            </section>
         </section>
      </section>
      <footer><script type="text/javascript">
          (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
            (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
          m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
          })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
          //Allow Linker
          ga('create', 'UA-1192232-34','auto', {'allowLinker': true});
          ga('send', 'pageview');
          // Load the plugin.
          ga('require', 'linker');
          // Define which domains to autoLink.
          ga('linker:autoLink', ['neo4j.org','neo4j.com','neotechnology.com','graphdatabases.com','graphconnect.com']);
        </script><script type="text/javascript">
          document.write(unescape("%3Cscript src='//munchkin.marketo.net/munchkin.js' type='text/javascript'%3E%3C/script%3E"));
        </script><script>Munchkin.init('773-GON-065');</script></footer>
   </body>
</html>